{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}D:\曾翠红\Stata14\新建文件夹 - 副本 (2)\新建文件夹\double玉米log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}22 Feb 2019, 15:00:21

{com}. do "D:\曾翠红\Stata14\新建文件夹 - 副本 (2)\新建文件夹\double玉米.do"
{txt}
{com}. **以土地单产为土地生产率
. 
. use "D:\曾翠红\Stata14\新建文件夹 - 副本 (2)\新建文件夹\allnet.dta", clear
{txt}
{com}. keep if sm==11|sm==12|sm==13|sm==32|sm==34|sm==37|sm==41
{txt}(72,970 observations deleted)

{com}. 
. **包含的变量有（yield、income、profit、land、cland、labor、flabor、elabor、resident、machine、other、subsidy、insurance、plots、fstruct、job、concurrent、sex、age、educ、train、health、status）
. 
. **选取变量(删除收获面积、年末耕地面积、家庭常住人口、家庭全年总收入为0的农户数据，并将部分变量+0.001）
. drop if cland==0  //
{txt}(307 observations deleted)

{com}. drop if cland==.
{txt}(13,206 observations deleted)

{com}. drop if cyields==.
{txt}(11 observations deleted)

{com}. g yield = cyields/cland
{txt}
{com}. winsor yield, g (yieldo) p(0.05)
{txt}
{com}. sum yieldo

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}yieldo {c |}{res}     12,818     459.105    119.3916        200        650
{txt}
{com}. drop if yield>650
{txt}(603 observations deleted)

{com}. drop if yield<200
{txt}(535 observations deleted)

{com}. 
. g land = cland      
{txt}
{com}. g labors= clabors   
{txt}(1,417 missing values generated)

{com}. g elabors= celabors     
{txt}(10,983 missing values generated)

{com}. g e1=ce1 
{txt}(99 missing values generated)

{com}. g e2=ce2 
{txt}(9,931 missing values generated)

{com}. g e3=ce3 
{txt}(190 missing values generated)

{com}. g e4=ce4 
{txt}(11,013 missing values generated)

{com}. g e5=ce5 
{txt}(1,705 missing values generated)

{com}. g e6=ce6 
{txt}(6,394 missing values generated)

{com}. g e7=ce7 
{txt}(10,811 missing values generated)

{com}. g e8=ce8 
{txt}(3,150 missing values generated)

{com}. g e9=ce9
{txt}(8,937 missing values generated)

{com}. g e10=ce10
{txt}(9,667 missing values generated)

{com}. g e11=ce11 
{txt}(11,064 missing values generated)

{com}. g e12=ce12   //
{txt}(9,302 missing values generated)

{com}. ren age agee
{res}{txt}
{com}. //winsor land,gen (land1) p(0.025)
. //sum land1
. //sum land
. 
. //drop if elando ==.
. //drop if elando ==0
. drop if labors ==0
{txt}(9 observations deleted)

{com}. drop if labors==.
{txt}(1,417 observations deleted)

{com}. drop if quantitys ==.
{txt}(541 observations deleted)

{com}. //drop if resident ==.
. //drop if resident ==0
. 
. replace eland=0 if eland==.
{txt}(6 real changes made)

{com}. replace elabors=0 if elabors==.
{txt}(9,037 real changes made)

{com}. 
. replace e1=0 if e1==.
{txt}(78 real changes made)

{com}. replace e2=0 if e2==.
{txt}(8,073 real changes made)

{com}. replace e3=0 if e3==.
{txt}(144 real changes made)

{com}. replace e4=0 if e4==.
{txt}(9,078 real changes made)

{com}. replace e5=0 if e5==.
{txt}(1,338 real changes made)

{com}. replace e6=0 if e6==.
{txt}(5,175 real changes made)

{com}. replace e7=0 if e7==.
{txt}(8,923 real changes made)

{com}. replace e8=0 if e8==.
{txt}(2,750 real changes made)

{com}. replace e9=0 if e9==.
{txt}(7,252 real changes made)

{com}. replace e10=0 if e10==.
{txt}(7,899 real changes made)

{com}. replace e11=0 if e11==.
{txt}(9,149 real changes made)

{com}. replace e12=0 if e12==.
{txt}(7,629 real changes made)

{com}. 
. replace s1=0 if s1==.
{txt}(1,338 real changes made)

{com}. replace s2=0 if s2==.
{txt}(2,460 real changes made)

{com}. replace s3=0 if s3==.
{txt}(4,231 real changes made)

{com}. replace s4=0 if s4==.
{txt}(9,247 real changes made)

{com}. g subsidys = s1+s2+s3+s4
{txt}
{com}. 
. replace sex=0 if sex!=1
{txt}(4,384 real changes made)

{com}. 
. g health = train3
{txt}(3,745 missing values generated)

{com}. replace health=4 if health==0
{txt}(0 real changes made)

{com}. replace health=4 if health==.
{txt}(3,745 real changes made)

{com}. replace health=4 if health>5
{txt}(0 real changes made)

{com}. replace health=10 if health==1
{txt}(3,373 real changes made)

{com}. replace health=9 if health==2
{txt}(1,542 real changes made)

{com}. replace health=7 if health==2
{txt}(0 real changes made)

{com}. replace health=6 if health==5
{txt}(42 real changes made)

{com}. replace health=5 if health==10
{txt}(3,373 real changes made)

{com}. replace health=4 if health==9
{txt}(1,542 real changes made)

{com}. replace health=2 if health==7
{txt}(0 real changes made)

{com}. replace health=1 if health==6
{txt}(42 real changes made)

{com}. 
. replace elabors=0 if celabors==.
{txt}(0 real changes made)

{com}. 
. replace resident=0 if resident==.
{txt}(7 real changes made)

{com}. 
. replace familylabor=0 if familylabor==.
{txt}(248 real changes made)

{com}. 
. replace status1=0 if status1!=1
{txt}(9,342 real changes made)

{com}. replace status2=0 if status2!=1
{txt}(9,319 real changes made)

{com}. replace status3=0 if status3!=1
{txt}(8,045 real changes made)

{com}. g status = status1+status2+status3
{txt}
{com}. replace status=1 if status!=0
{txt}(398 real changes made)

{com}. 
. replace train1=0 if train1!=1
{txt}(9,355 real changes made)

{com}. replace train2=0 if train2!=1
{txt}(9,257 real changes made)

{com}. g train = train1+train2
{txt}
{com}. replace train=1 if train!=0
{txt}(287 real changes made)

{com}. 
. replace insurances=0 if insurances==.
{txt}(7,704 real changes made)

{com}. replace insurances=1 if insurances!=0
{txt}(1,624 real changes made)

{com}. 
. replace loan1=1 if loan1>0
{txt}(9,308 real changes made)

{com}. replace loan1=0 if loan1!=1
{txt}(0 real changes made)

{com}. replace loan2=1 if loan1>0
{txt}(9,308 real changes made)

{com}. replace loan2=0 if loan2!=1
{txt}(1 real change made)

{com}. g loan=loan1+loan2
{txt}
{com}. replace loan=1 if loan!=0
{txt}(9,308 real changes made)

{com}. 
. egen avg_agriincome = mean(agriincome)
{txt}
{com}. replace agriincome=avg_agriincome if agriincome==.
{txt}(360 real changes made)

{com}. egen avg_allincome = mean(allincome)
{txt}
{com}. replace allincome=avg_allincome if allincome==.
{txt}(8 real changes made)

{com}. egen avg_age = mean(agee)
{txt}
{com}. replace agee=avg_age if agee==.
{txt}(3,737 real changes made)

{com}. egen avg_educ = mean(educ)
{txt}
{com}. replace educ=avg_educ if educ==.
{txt}(3,835 real changes made)

{com}. 
. 
. g machanes = e8+e9+e10
{txt}
{com}. g fertiles = e2+e3
{txt}
{com}. g ots = e1+e4+e5+e6+e7+e12
{txt}
{com}. g flabors = labors-elabors
{txt}
{com}. 
. 
. 
. //tostring id, replace 
. //gen sm=substr(id,1,2)
. //egen yearsm = concat(year sm)
. //g wage0 = elaborpay/elabors
. //bysort yearsm:egen wageo=mean(wage0)
. //bysort yearsm:egen quantitye = mean(quantity)
. 
. winsor quantitys, gen (quantity) p(0.01)
{txt}
{com}. winsor agriincomes, gen (agriincome) p(0.001)
{txt}
{com}. winsor allincomes, gen (allincome) p(0.001)
{txt}
{com}. winsor agee, gen (age) p(0.01)
{txt}
{com}. 
. g laboro = labors/land
{txt}
{com}. winsor laboro, g (labor) p(0.01)   
{txt}
{com}. g elabor0 = elabors/land
{txt}
{com}. winsor elabor0, gen (elaboro) p(0.001) 
{txt}
{com}. g flaboro = labor - elaboro
{txt}
{com}. 
. g fertile0 = fertiles/land
{txt}
{com}. g machane0 = machanes/land
{txt}
{com}. g ot0 = ots/land
{txt}
{com}. g subsidy0 = subsidys/eland
{txt}(10 missing values generated)

{com}. 
. winsor fertile0, gen (fertileo) p(0.01)
{txt}
{com}. winsor machane0, gen (machaneo) p(0.01)
{txt}
{com}. winsor ot0, gen (oto) p(0.1)
{txt}
{com}. winsor subsidy0, gen (subsidyo) p(0.01)
{txt}
{com}. 
. g plots = eland/quantity
{txt}
{com}. egen ave_plots = mean(plots)
{txt}
{com}. replace plots=ave_plots if plots==.
{txt}(0 real changes made)

{com}. 
. egen avg_sub = mean(subsidyo)
{txt}
{com}. replace subsidyo=avg_sub if subsidyo==.
{txt}(10 real changes made)

{com}. 
. g job = 1-agriincome/allincome
{txt}
{com}. replace job=0 if job<0
{txt}(92 real changes made)

{com}. egen avg_job = mean(job)
{txt}
{com}. replace job=avg_job if job==.
{txt}(0 real changes made)

{com}. 
. 
. g flabor = flaboro+0.001
{txt}
{com}. g elabor = elaboro+0.001    
{txt}
{com}. g fertile = fertileo+0.001
{txt}
{com}. g machane = machaneo+0.001
{txt}
{com}. g ot = oto+0.001
{txt}
{com}. g subsidy = subsidyo+0.001
{txt}
{com}. 
. 
. g fstructs = familylabor/resident
{txt}(8 missing values generated)

{com}. egen avg_fstruct = mean(fstructs)
{txt}
{com}. replace fstructs=avg_fstruct if fstruct==.
{txt}(8 real changes made)

{com}. winsor fstructs, gen (fstruct) p(0.01)
{txt}
{com}. 
. g caland = land 
{txt}
{com}. replace caland = 1 if land>=0&land<10
{txt}(8,484 real changes made)

{com}. replace caland = 2 if land>=10&land<50
{txt}(689 real changes made)

{com}. replace caland = 3 if land>=50
{txt}(2 real changes made)

{com}. 
. tabstat yield land labor flabor elabor fertile machane ot subsidy insurance loan plots fstruct job sex age educ train health status, statistics(mean ma mi q sk k sd n) 

{txt}   stats {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s      loan     plots   fstruct       job       sex       age
{hline 9}{c +}{hline 160}
{ralign 8:mean} {...}
{c |}{...}
 {res} 459.1466  3.837126  13.86807  13.81907  .0510015  140.0947  59.96361  94.88627  100.7687  .1673016  .9583033  1.649357  .7336367    .67148  .5486461  54.65494
{txt}{ralign 8:max} {...}
{c |}{...}
 {res}      650        52        75    75.001  12.72827   350.001   250.001   167.501   431.001         1         1        50  2.764166         1         1        76
{txt}{ralign 8:min} {...}
{c |}{...}
 {res}      200        .1  1.351351      .001      .001    10.001      .001  46.66767      .001         0         0         0         0         0         0        31
{txt}{ralign 8:p25} {...}
{c |}{...}
 {res}      400       1.2         6  5.962539      .001   100.001    10.001    62.501  70.85814         0         1       .75        .5  .5034631         0        53
{txt}{ralign 8:p50} {...}
{c |}{...}
 {res} 483.3333         3        10    10.001      .001  133.3344    50.001  87.14386   100.001         0         1      1.35  .6666667  .7550163         1  54.65947
{txt}{ralign 8:p75} {...}
{c |}{...}
 {res} 533.3333         5  16.66667  16.66767      .001   170.001    90.001   120.001  124.6439         0         1  2.233333         1  .8934208         1        58
{txt}{ralign 8:skewness} {...}
{c |}{...}
 {res}-.5097625  2.739695   2.47888  2.478788  18.39834  .8493328  1.122047  .5517056  1.906228  1.782735 -4.585436  6.482522   1.69111 -.8628864 -.1955121 -.2331448
{txt}{ralign 8:kurtosis} {...}
{c |}{...}
 {res} 2.620236  16.86066  10.45455  10.46399  390.2756  4.621111  3.870656  2.185595   10.9386  4.178146  22.02623  170.8572   9.16408  2.679562  1.038225   3.94172
{txt}{ralign 8:sd} {...}
{c |}{...}
 {res} 104.7474  3.808118  12.88942   12.8914  .5472793  57.68704  58.30805  38.36527  65.06529  .3732641  .1999055  1.379506  .4195142  .2713847  .4976535  8.176516
{txt}{ralign 8:N} {...}
{c |}{...}
 {res}     9713      9713      9713      9713      9713      9713      9713      9713      9713      9713      9713      9713      9713      9713      9713      9713
{txt}{hline 9}{c BT}{hline 160}

   stats {...}
{c |}{...}
      educ     train    health    status
{hline 9}{c +}{hline 40}
{ralign 8:mean} {...}
{c |}{...}
 {res} 7.069071  .0542572  4.260579  .2076598
{txt}{ralign 8:max} {...}
{c |}{...}
 {res}       17         1         5         1
{txt}{ralign 8:min} {...}
{c |}{...}
 {res}        0         0         1         0
{txt}{ralign 8:p25} {...}
{c |}{...}
 {res}        7         0         4         0
{txt}{ralign 8:p50} {...}
{c |}{...}
 {res} 7.069071         0         4         0
{txt}{ralign 8:p75} {...}
{c |}{...}
 {res}        8         0         5         0
{txt}{ralign 8:skewness} {...}
{c |}{...}
 {res}-.4606469  3.935494 -.6817953  1.441406
{txt}{ralign 8:kurtosis} {...}
{c |}{...}
 {res} 5.745754  16.48811  5.084745  3.077652
{txt}{ralign 8:sd} {...}
{c |}{...}
 {res} 1.955065  .2265361  .6261296  .4056528
{txt}{ralign 8:N} {...}
{c |}{...}
 {res}     9713      9713      9713      9713
{txt}{hline 9}{c BT}{hline 40}

{com}. 
. 
. **删除面板重复值
. duplicates drop id year,force

{p 0 4}{txt}Duplicates in terms of {res} id year{p_end}

{txt}(0 observations are duplicates)

{com}. xtset id year
{res}{txt}{col 8}panel variable:  {res}id (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 2011 to 2015, but with gaps
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. 
. **分类均值、最大值、最小值、25%、50%、75%、偏度、峰度、标准差分析
. tabstat yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status, by(caland) statistics(mean ma mi q sk k sd n) 

{txt}Summary statistics: mean, max, min, p25, p50, p75, skewness, kurtosis, sd, N
  by categories of: caland 

{ralign 8:caland} {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s     plots   fstruct       job       sex       age      educ
{hline 9}{c +}{hline 160}
{ralign 8:1} {...}
{c |}{...}
 {res} 458.8033  3.055021   14.5215  14.47708  .0464173  141.4916  57.56076  95.53536  102.0144  .1569497  1.532708  .7340821  .6788359  .5479938  54.77535  7.059658
{txt}{space 8} {...}
{c |}{...}
 {res}      650       9.8        75    75.001  12.72827   350.001   250.001   167.501   431.001         1        23  2.764166         1         1        76        17
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1  1.351351      .001      .001    10.001      .001  46.66767      .001         0         0         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res}      400       1.1      6.25     6.251      .001  102.2737  4.616385    62.501  71.13004         0        .7        .5  .5121171         0        53         7
{txt}{space 8} {...}
{c |}{...}
 {res}  484.375       2.5        10    10.001      .001   136.001  46.07792    88.001  102.3087         0  1.242727  .6666667  .7667276         1  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res} 534.8837       4.5        18    18.001      .001   170.001    85.001  120.9312   125.642         0         2         1  .9002618         1        58         8
{txt}{space 8} {...}
{c |}{...}
 {res}    -.509  .7998479  2.418752  2.418894  19.06354  .8455209  1.220932  .5258338  1.839109   1.88617  2.641127  1.661939 -.9134232 -.1928657  -.230566 -.4587863
{txt}{space 8} {...}
{c |}{...}
 {res} 2.598634  2.818008  10.01967  10.02881  424.1301  4.647773  4.106051  2.150092  10.41755  4.557638   23.5089  9.025982  2.749739  1.037197  3.928245  5.670908
{txt}{space 8} {...}
{c |}{...}
 {res} 105.1883   2.25358    13.099      13.1  .5126718  58.11726  58.56192  38.54676  66.59258  .3637735  1.200235  .4216096  .2731228  .4977188  8.226103  1.959765
{txt}{space 8} {...}
{c |}{...}
 {res}     9022      9022      9022      9022      9022      9022      9022      9022      9022      9022      9022      9022      9022      9022      9022      9022
{txt}{hline 9}{c +}{hline 160}
{ralign 8:2} {...}
{c |}{...}
 {res} 463.6961  13.94136  5.342474  5.237487  .1069876  121.6416  91.18673  86.46069  84.71576  .3033382  3.093629  .7289668  .5760148  .5573295  53.07049  7.189526
{txt}{space 8} {...}
{c |}{...}
 {res}      650        40        50    50.001  12.72827  267.4429   240.001   167.501   431.001         1        15  2.764166  .9863532         1        76        15
{txt}{space 8} {...}
{c |}{...}
 {res}      200        10  1.351351      .001      .001    10.001      .001  46.66767      .001         0        .2         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res}      400        10  2.857143     2.801      .001    90.001    61.001    58.001    70.001         0  2.216667        .5  .4182158         0        50         7
{txt}{space 8} {...}
{c |}{...}
 {res} 481.4815      12.6  4.090909     4.001      .001   110.001  85.71529  79.33434  88.47926         0       2.8  .6666667   .599053         1  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      525        15  6.666667     6.501      .001   152.501   120.001  103.0138   100.001         1       3.7         1  .7629935         1  54.65947         8
{txt}{space 8} {...}
{c |}{...}
 {res}-.5035209  1.936757  4.257192  4.195609    13.082  .6563515  .3925032   .904715  3.007767  .8556094  2.810627  2.160775 -.4585515 -.2308403 -.4511288 -.4730285
{txt}{space 8} {...}
{c |}{...}
 {res} 2.914602  7.718241  38.63108  39.87668  185.0068  2.802679  2.869959  2.904975  30.26444  1.732067   17.2909  11.42265  2.437229  1.053287  4.037023  6.861241
{txt}{space 8} {...}
{c |}{...}
 {res} 98.88464  4.624513  4.089603  3.997476  .8756133   48.0616  44.19282  34.88009   36.2471   .460034  1.481031  .3909423  .2268683  .4970633  7.330517  1.891179
{txt}{space 8} {...}
{c |}{...}
 {res}      689       689       689       689       689       689       689       689       689       689       689       689       689       689       689       689
{txt}{hline 9}{c +}{hline 160}
{ralign 8:3} {...}
{c |}{...}
 {res} 440.3846        51  3.303846  1.862539  1.443308  195.3856  142.8472  69.46254  11.61609         0      30.3  .3333333  .3765282        .5  57.32973  8.034536
{txt}{space 8} {...}
{c |}{...}
 {res} 480.7692        52  4.807693  1.924077  2.885615  230.7702  157.6933  76.92408  14.83119         0        50  .6666667  .4074059         1        60         9
{txt}{space 8} {...}
{c |}{...}
 {res}      400        50       1.8     1.801      .001   160.001   128.001    62.001     8.401         0      10.6         0  .3456505         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      400        50       1.8     1.801      .001   160.001   128.001    62.001     8.401         0      10.6         0  .3456505         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res} 440.3846        51  3.303846  1.862539  1.443308  195.3856  142.8472  69.46254  11.61609         0      30.3  .3333333  .3765282        .5  57.32973  8.034536
{txt}{space 8} {...}
{c |}{...}
 {res} 480.7692        52  4.807693  1.924077  2.885615  230.7702  157.6933  76.92408  14.83119         0        50  .6666667  .4074059         1        60         9
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0         0         0         0         0         0         0         0         .         0         0         0         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}        1         1         1         1         1         1         1         1         1         .         1         1         1         1         1         1
{txt}{space 8} {...}
{c |}{...}
 {res} 57.11247  1.414214   2.12676  .0870287  2.039731   50.0414  20.99563  10.55221   4.54683         0  27.86001  .4714045  .0436677  .7071068  3.776325  1.365373
{txt}{space 8} {...}
{c |}{...}
 {res}        2         2         2         2         2         2         2         2         2         2         2         2         2         2         2         2
{txt}{hline 9}{c +}{hline 160}
{ralign 8:Total} {...}
{c |}{...}
 {res} 459.1466  3.837126  13.86807  13.81907  .0510015  140.0947  59.96361  94.88627  100.7687  .1673016  1.649357  .7336367    .67148  .5486461  54.65494  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      650        52        75    75.001  12.72827   350.001   250.001   167.501   431.001         1        50  2.764166         1         1        76        17
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1  1.351351      .001      .001    10.001      .001  46.66767      .001         0         0         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res}      400       1.2         6  5.962539      .001   100.001    10.001    62.501  70.85814         0       .75        .5  .5034631         0        53         7
{txt}{space 8} {...}
{c |}{...}
 {res} 483.3333         3        10    10.001      .001  133.3344    50.001  87.14386   100.001         0      1.35  .6666667  .7550163         1  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res} 533.3333         5  16.66667  16.66767      .001   170.001    90.001   120.001  124.6439         0  2.233333         1  .8934208         1        58         8
{txt}{space 8} {...}
{c |}{...}
 {res}-.5097625  2.739695   2.47888  2.478788  18.39834  .8493328  1.122047  .5517056  1.906228  1.782735  6.482522   1.69111 -.8628864 -.1955121 -.2331448 -.4606469
{txt}{space 8} {...}
{c |}{...}
 {res} 2.620236  16.86066  10.45455  10.46399  390.2756  4.621111  3.870656  2.185595   10.9386  4.178146  170.8572   9.16408  2.679562  1.038225   3.94172  5.745754
{txt}{space 8} {...}
{c |}{...}
 {res} 104.7474  3.808118  12.88942   12.8914  .5472793  57.68704  58.30805  38.36527  65.06529  .3732641  1.379506  .4195142  .2713847  .4976535  8.176516  1.955065
{txt}{space 8} {...}
{c |}{...}
 {res}     9713      9713      9713      9713      9713      9713      9713      9713      9713      9713      9713      9713      9713      9713      9713      9713
{txt}{hline 9}{c BT}{hline 160}

{ralign 8:caland} {...}
{c |}{...}
     train    health    status
{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res} .0550876  4.256262  .2094879
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 3.900156 -.7100278  1.427777
{txt}{space 8} {...}
{c |}{...}
 {res} 16.21122  5.178041  3.038548
{txt}{space 8} {...}
{c |}{...}
 {res} .2281637  .6309746  .4069657
{txt}{space 8} {...}
{c |}{...}
 {res}     9022      9022      9022
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res}   .04209  4.316401  .1814224
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         3         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 4.560982 -.0508841   1.65337
{txt}{space 8} {...}
{c |}{...}
 {res} 21.80256  2.349859  3.733631
{txt}{space 8} {...}
{c |}{...}
 {res} .2009403  .5564431  .3856477
{txt}{space 8} {...}
{c |}{...}
 {res}      689       689       689
{txt}{hline 9}{c +}{hline 30}
{ralign 8:3} {...}
{c |}{...}
 {res}       .5       4.5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}       .5       4.5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0         .
{txt}{space 8} {...}
{c |}{...}
 {res}        1         1         .
{txt}{space 8} {...}
{c |}{...}
 {res} .7071068  .7071068         0
{txt}{space 8} {...}
{c |}{...}
 {res}        2         2         2
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res} .0542572  4.260579  .2076598
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 3.935494 -.6817953  1.441406
{txt}{space 8} {...}
{c |}{...}
 {res} 16.48811  5.084745  3.077652
{txt}{space 8} {...}
{c |}{...}
 {res} .2265361  .6261296  .4056528
{txt}{space 8} {...}
{c |}{...}
 {res}     9713      9713      9713
{txt}{hline 9}{c BT}{hline 30}

{com}. tabstat yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status if year==2011, by(caland) statistics(mean ma mi q sk k sd n)

{txt}Summary statistics: mean, max, min, p25, p50, p75, skewness, kurtosis, sd, N
  by categories of: caland 

{ralign 8:caland} {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s     plots   fstruct       job       sex       age      educ
{hline 9}{c +}{hline 160}
{ralign 8:1} {...}
{c |}{...}
 {res} 425.6582  3.018502  14.95996   14.9061  .0558606  130.3408  45.51048  83.26667  93.84471  .0925085   1.48913  .7045535   .668679  .8791146  54.62637  6.926183
{txt}{space 8} {...}
{c |}{...}
 {res}      650       9.8        75    75.001  12.72827   350.001   250.001   167.501   431.001         1        23  2.764166         1         1        76        17
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1  1.351351      .001      .001    10.001      .001  46.66767      .001         0         0         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res} 357.1429       1.2         7     7.001      .001    97.501    10.001  51.35235  71.47926         0  .6666667        .5  .5090486         1        47         5
{txt}{space 8} {...}
{c |}{...}
 {res} 449.4898       2.7  10.53589  10.45933      .001   120.001  36.66767    75.001  96.90793         0      1.25  .6666667  .7562347         1        56         7
{txt}{space 8} {...}
{c |}{...}
 {res}      500       4.2  17.33333    17.001      .001   156.251  63.63736   105.001  111.7959         0         2         1  .8857162         1        62         9
{txt}{space 8} {...}
{c |}{...}
 {res}-.3849291   .793916  2.522318  2.531369  18.03014  1.083455  1.539053  .8731322  2.376807  2.812784  4.397806  1.280762 -.9205396   -2.3259 -.1881361 -.3112299
{txt}{space 8} {...}
{c |}{...}
 {res}  2.50327  3.036882  10.36726  10.41557  365.9998  5.150494  5.810896  2.854925  16.38309  8.911755  60.15641  11.22576  2.753378  6.409809  2.457732  3.387853
{txt}{space 8} {...}
{c |}{...}
 {res} 95.31708  2.159815  13.05828  13.04495  .5941309  58.57067  45.65836  35.02046  53.41379  .2898247  1.221633  .3234104  .2716343  .3260865  10.42216  2.549068
{txt}{space 8} {...}
{c |}{...}
 {res}     1762      1762      1762      1762      1762      1762      1762      1762      1762      1762      1762      1762      1762      1762      1762      1762
{txt}{hline 9}{c +}{hline 160}
{ralign 8:2} {...}
{c |}{...}
 {res} 390.1757  13.89495  4.882865  4.781508  .1033569  112.4651  69.90803  72.60154  77.88899  .0707071  3.219552  .6976591  .5470661   .979798  51.22222   7.29572
{txt}{space 8} {...}
{c |}{...}
 {res}      551        40        15    15.001     4.251  240.9534  153.3343   167.501   140.801         1        15         1  .9626168         1        76        12
{txt}{space 8} {...}
{c |}{...}
 {res}      250        10      1.75     1.151      .001    10.001      .001  46.66767      .001         0     .6875  .1666667  .1188559         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res}      350        10  3.007519  2.963963      .001    75.001  41.76571  56.53946    77.501         0         2  .5555556   .347125         1        44         6
{txt}{space 8} {...}
{c |}{...}
 {res}      378        13         4     4.001      .001  92.30869    63.251    64.001  84.61639         0  2.666667  .6666667  .5370703         1        50         8
{txt}{space 8} {...}
{c |}{...}
 {res}      420        15  5.737705     5.601      .001   136.001  95.66766  85.04037   87.3923         0     3.375  .8571429   .724485         1        59         9
{txt}{space 8} {...}
{c |}{...}
 {res} .3640056  2.527888  1.856027  1.811547  6.693672   .969169  .3905669  1.847392 -1.218026  3.349469  3.102652 -.1883317  -.021288 -6.820603  .2098559 -.6553014
{txt}{space 8} {...}
{c |}{...}
 {res} 2.882094  11.16086  6.085631  5.996546  53.69123  2.809755  2.400398  6.906308  6.777358  12.21894  14.04119  2.426299  1.845183  47.52062  2.485094  4.438138
{txt}{space 8} {...}
{c |}{...}
 {res} 67.20975  5.016653  2.863763  2.906634  .4909788  53.85305  34.48877  25.63632  22.70804  .2576394  2.282366  .2192887  .2135848  .1414068  9.040223  2.181465
{txt}{space 8} {...}
{c |}{...}
 {res}       99        99        99        99        99        99        99        99        99        99        99        99        99        99        99        99
{txt}{hline 9}{c +}{hline 160}
{ralign 8:Total} {...}
{c |}{...}
 {res} 423.7707  3.597098  14.42389   14.3675  .0583873  129.3898  46.80836  82.69931  92.99591  .0913487  1.581184  .7041867  .6622095  .8844707  54.44528  6.945841
{txt}{space 8} {...}
{c |}{...}
 {res}      650        40        75    75.001  12.72827   350.001   250.001   167.501   431.001         1        23  2.764166         1         1        76        17
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1  1.351351      .001      .001    10.001      .001  46.66767      .001         0         0         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res}      355       1.3  6.666667  6.667666      .001    93.751  13.33433  52.10627  71.49354         0        .7        .5  .4962623         1        47         5
{txt}{space 8} {...}
{c |}{...}
 {res}      440         3        10    10.001      .001   120.001    40.001  74.19455    96.201         0   1.31875  .6666667  .7436997         1        55         7
{txt}{space 8} {...}
{c |}{...}
 {res}      500         5  16.66667  16.66767      .001   156.001    65.001  103.3343   110.001         0         2         1   .880174         1        62         9
{txt}{space 8} {...}
{c |}{...}
 {res}-.3417358  2.886368  2.558385  2.565674   17.7121   1.07794  1.456824  .9126442  2.422269  2.836828  4.300035  1.265876 -.8635137 -2.405501 -.1619196 -.3287491
{txt}{space 8} {...}
{c |}{...}
 {res} 2.490253  18.65515  10.67498  10.71794  359.6559  5.066505  5.545526  2.950764   16.9827  9.047591  47.78698  11.30632  2.657277  6.786434  2.443905  3.426059
{txt}{space 8} {...}
{c |}{...}
 {res} 94.35687  3.421113  12.92254  12.91217  .5890823  58.45372  45.45761  34.66287  52.35625  .2881818  1.355845  .3186899  .2701977  .3197455   10.3793  2.531702
{txt}{space 8} {...}
{c |}{...}
 {res}     1861      1861      1861      1861      1861      1861      1861      1861      1861      1861      1861      1861      1861      1861      1861      1861
{txt}{hline 9}{c BT}{hline 160}

{ralign 8:caland} {...}
{c |}{...}
     train    health    status
{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res} .0726447  4.406356  .1980704
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 3.293017 -1.235714  1.515158
{txt}{space 8} {...}
{c |}{...}
 {res} 11.84396  4.689096  3.295703
{txt}{space 8} {...}
{c |}{...}
 {res} .2596261  .7584649  .3986586
{txt}{space 8} {...}
{c |}{...}
 {res}     1762      1762      1762
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res} .0606061  4.464646  .2222222
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         3         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 3.683004 -.9529885  1.336306
{txt}{space 8} {...}
{c |}{...}
 {res} 14.56452  2.546585  2.785714
{txt}{space 8} {...}
{c |}{...}
 {res} .2398206  .7187451  .4178554
{txt}{space 8} {...}
{c |}{...}
 {res}       99        99        99
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res} .0720043  4.409457  .1993552
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 3.311442 -1.224005  1.505047
{txt}{space 8} {...}
{c |}{...}
 {res} 11.96565  4.606479  3.265166
{txt}{space 8} {...}
{c |}{...}
 {res} .2585645   .756333   .399623
{txt}{space 8} {...}
{c |}{...}
 {res}     1861      1861      1861
{txt}{hline 9}{c BT}{hline 30}

{com}. tabstat yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status if year==2012, by(caland) statistics(mean ma mi q sk k sd n)

{txt}Summary statistics: mean, max, min, p25, p50, p75, skewness, kurtosis, sd, N
  by categories of: caland 

{ralign 8:caland} {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s     plots   fstruct       job       sex       age      educ
{hline 9}{c +}{hline 160}
{ralign 8:1} {...}
{c |}{...}
 {res} 473.1451  3.049535  14.58382  14.53596  .0498524  142.4963  51.82343  90.79691  95.00891  .1215091  1.501116  .8574631  .6765614  .8902499   54.2925  7.084899
{txt}{space 8} {...}
{c |}{...}
 {res}      650       9.5        75    75.001  12.72827   350.001   250.001   167.501   431.001         1        11  2.764166  .9964203         1        76        17
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1  1.351351      .001      .001    10.001      .001  46.66767      .001         0         0         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res}      400         1  6.470588     6.251      .001  101.6677      .001  61.66767    60.001         0        .7        .5  .5079475         1        47         6
{txt}{space 8} {...}
{c |}{...}
 {res}      500       2.6        10    10.001      .001   137.501    37.501  84.28671   100.001         0       1.2  .6666667  .7607869         1        55         7
{txt}{space 8} {...}
{c |}{...}
 {res} 545.4545       4.5  18.33333  18.33433      .001  170.8343    80.001  113.0445   118.001         0         2         1  .8975042         1        62         9
{txt}{space 8} {...}
{c |}{...}
 {res}-.7042158   .761989  2.459258  2.451108  17.50435  .8947307   1.23684   .663388  1.513242  2.316928  1.980728   1.31657 -.9084859 -2.496976 -.1839969 -.4041759
{txt}{space 8} {...}
{c |}{...}
 {res} 2.863765  2.711743  10.35902  10.32464  353.8153  4.655949  4.169327  2.553917  10.21789  6.368154  10.37537  4.653646  2.770266  7.234887  2.443962  3.606182
{txt}{space 8} {...}
{c |}{...}
 {res} 99.90413  2.255127  12.91647  12.94075  .5295431  59.63335  55.12304  34.82456  59.93769   .326798  1.145212  .6038457  .2706007  .3126546  10.42208  2.423379
{txt}{space 8} {...}
{c |}{...}
 {res}     2041      2041      2041      2041      2041      2041      2041      2041      2041      2041      2041      2041      2041      2041      2041      2041
{txt}{hline 9}{c +}{hline 160}
{ralign 8:2} {...}
{c |}{...}
 {res} 476.2384  13.56967  5.575624   5.42681  .1508137  131.8636  82.68916  82.49735  84.00151  .2213115  3.375765  .6753151  .5453264  .9672131  51.05738  7.353025
{txt}{space 8} {...}
{c |}{...}
 {res}      650        27  45.45454  45.45554  12.72827  265.3344   184.467   160.001   431.001         1      11.1  2.764166  .9702164         1        76        14
{txt}{space 8} {...}
{c |}{...}
 {res}      200        10  1.351351      .001      .001    30.001      .001  46.66767      .001         0        .8         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res} 409.0909        10  3.225806  3.215286      .001  96.15485  49.77878    60.001    60.001         0  2.357143        .4  .3936223         1        45         6
{txt}{space 8} {...}
{c |}{...}
 {res}      500      12.7  4.392982  4.362413      .001  116.1677  77.63144  78.78609  90.00101         0  3.183333        .5  .5800641         1        50         8
{txt}{space 8} {...}
{c |}{...}
 {res}    533.8        15  6.220096  6.177471      .001  166.6677  113.3343    99.001   100.001         0     3.925  .8333333  .7278147         1        60         9
{txt}{space 8} {...}
{c |}{...}
 {res}-.4160616  1.225087  5.189366  5.365036  10.34918  .5729975  .4054197  .6725403  3.305211  1.342657  2.112343  1.665498  -.453035 -5.247275  .0312792 -.4393896
{txt}{space 8} {...}
{c |}{...}
 {res} 2.831294  3.991478  40.82499  43.20149   111.501  2.671033  2.442397  3.038199  25.51068  2.802729  10.16921   6.80968  2.467814   28.5339  2.449886  3.817595
{txt}{space 8} {...}
{c |}{...}
 {res} 91.75004  3.907143  4.804996   4.75117  1.169505  52.85012  43.39391   26.9736  47.40293  .4168416  1.531222  .4593396  .2208733  .1788127   9.56431  2.522298
{txt}{space 8} {...}
{c |}{...}
 {res}      122       122       122       122       122       122       122       122       122       122       122       122       122       122       122       122
{txt}{hline 9}{c +}{hline 160}
{ralign 8:3} {...}
{c |}{...}
 {res}      400        50       1.8     1.801      .001   160.001   128.001    62.001     8.401         0        50  .6666667  .3456505         1        60         9
{txt}{space 8} {...}
{c |}{...}
 {res}      400        50       1.8     1.801      .001   160.001   128.001    62.001     8.401         0        50  .6666667  .3456505         1        60         9
{txt}{space 8} {...}
{c |}{...}
 {res}      400        50       1.8     1.801      .001   160.001   128.001    62.001     8.401         0        50  .6666667  .3456505         1        60         9
{txt}{space 8} {...}
{c |}{...}
 {res}      400        50       1.8     1.801      .001   160.001   128.001    62.001     8.401         0        50  .6666667  .3456505         1        60         9
{txt}{space 8} {...}
{c |}{...}
 {res}      400        50       1.8     1.801      .001   160.001   128.001    62.001     8.401         0        50  .6666667  .3456505         1        60         9
{txt}{space 8} {...}
{c |}{...}
 {res}      400        50       1.8     1.801      .001   160.001   128.001    62.001     8.401         0        50  .6666667  .3456505         1        60         9
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .         .         .         .         .         .         .         .         .         .         .         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .         .         .         .         .         .         .         .         .         .         .         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .         .         .         .         .         .         .         .         .         .         .         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        1         1         1         1         1         1         1         1         1         1         1         1         1         1         1         1
{txt}{hline 9}{c +}{hline 160}
{ralign 8:Total} {...}
{c |}{...}
 {res} 473.2857  3.664325  14.07005  14.01653  .0555217   141.905  53.59875   90.3157  94.34832  .1270795  1.629215   .847106  .6690099  .8946396  54.11275    7.1009
{txt}{space 8} {...}
{c |}{...}
 {res}      650        50        75    75.001  12.72827   350.001   250.001   167.501   431.001         1        50  2.764166  .9964203         1        76        17
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1  1.351351      .001      .001    10.001      .001  46.66767      .001         0         0         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res}      400       1.1         6     6.001      .001   100.001      .001  61.66767    60.001         0  .7333333        .5  .4973863         1        47         6
{txt}{space 8} {...}
{c |}{...}
 {res}      500         3        10    10.001      .001  135.4513  41.66766    83.751  99.73314         0       1.3  .6666667  .7477822         1        55  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res} 545.4545         5  17.31634  17.14386      .001   170.001  82.97201  111.3183   117.128         0      2.15         1  .8911316         1        62         9
{txt}{space 8} {...}
{c |}{...}
 {res}-.6918135  2.917581  2.500267  2.492022  16.99153  .8865158  1.158766  .6789238  1.574661  2.239346  13.09221  1.341403 -.8570724 -2.570797 -.1672737 -.4054315
{txt}{space 8} {...}
{c |}{...}
 {res} 2.868223   21.9499  10.66416  10.62686  326.7938  4.611779  3.963821  2.602794  10.60124  6.014671  367.5587  4.756673  2.691896  7.608997  2.436038  3.618761
{txt}{space 8} {...}
{c |}{...}
 {res} 99.43429  3.540294  12.76824  12.79406  .5844025  59.29868  54.99422  34.47498  59.36163   .333139  1.623988  .5978953  .2697311  .3070883  10.39872  2.429033
{txt}{space 8} {...}
{c |}{...}
 {res}     2164      2164      2164      2164      2164      2164      2164      2164      2164      2164      2164      2164      2164      2164      2164      2164
{txt}{hline 9}{c BT}{hline 160}

{ralign 8:caland} {...}
{c |}{...}
     train    health    status
{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res} .0803528  4.416463  .2283195
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 3.087474 -1.286122  1.294489
{txt}{space 8} {...}
{c |}{...}
 {res}  10.5325  4.827446  2.675701
{txt}{space 8} {...}
{c |}{...}
 {res} .2719052  .7631227  .4198524
{txt}{space 8} {...}
{c |}{...}
 {res}     2041      2041      2041
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res} .0901639  4.557377   .147541
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         3         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 2.861819  -1.11098  1.987676
{txt}{space 8} {...}
{c |}{...}
 {res} 9.190008  3.131097  4.950855
{txt}{space 8} {...}
{c |}{...}
 {res} .2875976  .6304817  .3561068
{txt}{space 8} {...}
{c |}{...}
 {res}      122       122       122
{txt}{hline 9}{c +}{hline 30}
{ralign 8:3} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        1         1         1
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res} .0813309  4.424677   .224122
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 3.063329 -1.289917  1.323147
{txt}{space 8} {...}
{c |}{...}
 {res} 10.38399  4.828526  2.750718
{txt}{space 8} {...}
{c |}{...}
 {res} .2734057  .7567609  .4170992
{txt}{space 8} {...}
{c |}{...}
 {res}     2164      2164      2164
{txt}{hline 9}{c BT}{hline 30}

{com}. tabstat yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status if year==2013, by(caland) statistics(mean ma mi q sk k sd n)

{txt}Summary statistics: mean, max, min, p25, p50, p75, skewness, kurtosis, sd, N
  by categories of: caland 

{ralign 8:caland} {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s     plots   fstruct       job       sex       age      educ
{hline 9}{c +}{hline 160}
{ralign 8:1} {...}
{c |}{...}
 {res} 452.4631  3.107867  14.10154  14.05761  .0459306  145.9889  60.18184  96.46204  108.0971  .1986889  1.646665  .6982979   .662661         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      650       9.4        75    75.001  12.72827   350.001   250.001   167.501   431.001         1     13.75  2.764166         1         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1  1.351351      .001      .001    10.001      .001  46.66767      .001         0         0         0         0         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      400       1.2         6     6.001      .001  108.5724     3.751  64.81581    77.501         0       .75        .5  .4757911         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      475       2.5        10    10.001      .001   140.001    50.001    90.001   110.001         0  1.333333  .6666667  .7574033         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res} 523.8096       4.8  17.72727    17.501      .001  176.4716  91.66766  120.6677  134.1474         0      2.15         1  .8961927         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}-.5477351  .7676632  2.389395  2.390763   19.2415  .7541363  1.045364  .4653714  1.659926  1.510281  2.135898  1.041766 -.8317975         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}  2.65498  2.671803  9.847358  9.862206  462.3356  4.516486  3.658978  2.106878  9.138314   3.28095  12.35964  9.534209  2.509376         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 103.2231  2.287856  12.96943  12.96741  .4488725  57.39326  58.31087  38.47101  70.32834  .3991139   1.29645   .339623  .2834858         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}     1983      1983      1983      1983      1983      1983      1983      1983      1983      1983      1983      1983      1983      1983      1983      1983
{txt}{hline 9}{c +}{hline 160}
{ralign 8:2} {...}
{c |}{...}
 {res} 444.8582  13.48133  5.487847  5.345225   .144622  124.5444  95.19653  84.09146  87.60796  .3493976  3.029874  .7402555  .6107717         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      650        34      32.4    20.001  12.72827  240.3111   240.001   167.501   431.001         1      11.1  2.764166  .9747329         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      200        10  1.351351      .501      .001    25.001     2.001  46.66767      .001         0        .2         0         0         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res} 396.3964        10         3  2.858143      .001    90.001    67.001    53.001    60.001         0         2        .5    .47565         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res} 460.7692        12  4.090909  4.057949      .001   112.001  91.66766  80.75524    90.001         0       2.8  .6666667  .6802456         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      500        15  6.153846  6.154846      .001   160.001   125.001   105.001   100.001         1  3.777778         1  .7837858         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}-.2691435  2.061724  2.565528  1.573863  11.22115  .4293343  .1594969  .6374656  3.091437  .6317484  1.688152  2.965622 -.8752463         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 2.356043  7.887793  13.57211  5.319082  136.2556  2.316997  2.731686  2.650766  21.37371  1.399106  9.833812  19.01673  3.052048         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 109.8516  4.534776  4.139482  3.783146  1.029676  47.76301  43.65083  32.08812  48.00627  .4782223  1.355393  .3124884  .2258437         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}      166       166       166       166       166       166       166       166       166       166       166       166       166       166       166       166
{txt}{hline 9}{c +}{hline 160}
{ralign 8:3} {...}
{c |}{...}
 {res} 480.7692        52  4.807693  1.924077  2.885615  230.7702  157.6933  76.92408  14.83119         0      10.6         0  .4074059         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res} 480.7692        52  4.807693  1.924077  2.885615  230.7702  157.6933  76.92408  14.83119         0      10.6         0  .4074059         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res} 480.7692        52  4.807693  1.924077  2.885615  230.7702  157.6933  76.92408  14.83119         0      10.6         0  .4074059         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res} 480.7692        52  4.807693  1.924077  2.885615  230.7702  157.6933  76.92408  14.83119         0      10.6         0  .4074059         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res} 480.7692        52  4.807693  1.924077  2.885615  230.7702  157.6933  76.92408  14.83119         0      10.6         0  .4074059         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res} 480.7692        52  4.807693  1.924077  2.885615  230.7702  157.6933  76.92408  14.83119         0      10.6         0  .4074059         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .         .         .         .         .         .         .         .         .         .         .         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .         .         .         .         .         .         .         .         .         .         .         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .         .         .         .         .         .         .         .         .         .         .         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        1         1         1         1         1         1         1         1         1         1         1         1         1         1         1         1
{txt}{hline 9}{c +}{hline 160}
{ralign 8:Total} {...}
{c |}{...}
 {res} 451.8891  3.931535  13.43216  13.37929  .0548712  144.3726  62.93065  95.49783  106.4718  .2102326  1.757626  .7012126  .6585359         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      650        52        75    75.001  12.72827   350.001   250.001   167.501   431.001         1     13.75  2.764166         1         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1  1.351351      .001      .001    10.001      .001  46.66767      .001         0         0         0         0         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      400       1.2  5.333333  5.264158      .001  106.6677    12.501  63.33434    74.376         0        .8        .5    .47565         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res} 474.8286         3        10    10.001      .001   140.001  53.16767    90.001   106.001         0       1.5  .6666667  .7474734         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res} 522.7272       5.2  16.66667  16.66767      .001   175.001   100.001   120.001   132.001         0  2.366667         1  .8872599         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}-.5247653  2.966723  2.460537  2.463356  18.15419  .7508855  .9360674  .4896071   1.72906  1.422263  2.010423  1.148923 -.8180546         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 2.626393  21.20885  10.35187    10.381  397.2718  4.468449   3.42428  2.154618  9.519506  3.022833  11.22531  10.08954  2.526965         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}  103.721  3.892596  12.71902  12.71443  .5212085  57.00369  58.08438  38.14617  69.08323  .4075685  1.365282  .3379826  .2797436         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}     2150      2150      2150      2150      2150      2150      2150      2150      2150      2150      2150      2150      2150      2150      2150      2150
{txt}{hline 9}{c BT}{hline 160}

{ralign 8:caland} {...}
{c |}{...}
     train    health    status
{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res}        0         4  .2037317
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  1.471147
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  3.164274
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0  .4028734
{txt}{space 8} {...}
{c |}{...}
 {res}     1983      1983      1983
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res}        0         4  .1807229
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  1.659494
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  3.753922
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0  .3859527
{txt}{space 8} {...}
{c |}{...}
 {res}      166       166       166
{txt}{hline 9}{c +}{hline 30}
{ralign 8:3} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        1         1         1
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res}        0         4  .2023256
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  1.481949
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  3.196173
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0  .4018271
{txt}{space 8} {...}
{c |}{...}
 {res}     2150      2150      2150
{txt}{hline 9}{c BT}{hline 30}

{com}. tabstat yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status if year==2014, by(caland) statistics(mean ma mi q sk k sd n)

{txt}Summary statistics: mean, max, min, p25, p50, p75, skewness, kurtosis, sd, N
  by categories of: caland 

{ralign 8:caland} {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s     plots   fstruct       job       sex       age      educ
{hline 9}{c +}{hline 160}
{ralign 8:1} {...}
{c |}{...}
 {res} 473.7929  3.167849  14.27986  14.24069  .0411763  143.2668  66.41022  104.2225  109.9781  .1993243  1.523442  .6963161  .6889107  .8885135   55.7027  7.144826
{txt}{space 8} {...}
{c |}{...}
 {res}      650       9.8        75    75.001  12.72827   350.001   250.001   167.501   431.001         1      16.6  2.764166         1         1        76        17
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1  1.351351      .001      .001    10.001      .001  46.66767      .001         0         0         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res}      400       1.2         6     6.001      .001   105.001  4.167667    70.001  72.91446         0  .6809524        .5  .5182075         1        48         6
{txt}{space 8} {...}
{c |}{...}
 {res}      500       2.7        10    10.001      .001   140.001  50.95555   100.001  108.1677         0       1.2  .6666667  .7736394         1        57  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res} 555.0555       4.8  18.63636  18.25857      .001  173.3343   100.001  138.4732  133.0962         0         2         1  .9058417         1        63         9
{txt}{space 8} {...}
{c |}{...}
 {res}-.5610799  .7937333  2.361922   2.36503  19.49823   .613146   1.08407  .2741297  1.719988  1.505289  2.547862   1.36684 -.9238171  -2.46884 -.2420971 -.3395159
{txt}{space 8} {...}
{c |}{...}
 {res}  2.58008   2.75265  9.955879  9.976003  507.0824  4.253286  3.368627  1.797836  9.115551  3.265894  20.80112  10.52887  2.835398  7.095172  2.410712  3.511007
{txt}{space 8} {...}
{c |}{...}
 {res} 107.8599  2.328016  13.10411   13.1061   .419545  55.16387  67.44895  40.68504  72.28577  .3996049  1.197501  .3652916  .2677501  .3148223   10.4944  2.509464
{txt}{space 8} {...}
{c |}{...}
 {res}     1776      1776      1776      1776      1776      1776      1776      1776      1776      1776      1776      1776      1776      1776      1776      1776
{txt}{hline 9}{c +}{hline 160}
{ralign 8:2} {...}
{c |}{...}
 {res} 505.7127  13.68352  5.170528  5.063642  .1088857  118.5763  102.2985  89.43036  85.71942  .3806818  2.835056  .7070661  .5875788  .9602273  52.86932  7.216302
{txt}{space 8} {...}
{c |}{...}
 {res}      650      31.5        50    50.001    12.501  243.4119   240.001   167.501   147.001         1      6.25  2.764166  .9718197         1        76        15
{txt}{space 8} {...}
{c |}{...}
 {res} 208.3333        10  1.351351      .001      .001  30.58924      .001  46.66767      .001         0  .7333333         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res} 460.7692     10.25       2.5     2.501      .001  91.60939  72.43607  58.51199   74.0347         0  2.208333        .5  .4250062         1        46       5.5
{txt}{space 8} {...}
{c |}{...}
 {res}      500      12.7  3.877622  3.803776      .001   110.001  96.62188  81.27023  91.43587         0  2.666667  .6666667  .6059839         1        53         8
{txt}{space 8} {...}
{c |}{...}
 {res} 554.8077        15  6.978261   6.90668      .001  134.8479  132.4361  107.9273   100.001         1  3.333333  .8571429   .791564         1        61         9
{txt}{space 8} {...}
{c |}{...}
 {res} -.121423  1.800235  5.325851  5.375499  12.46691  .7066546   .228862  .8304248   -1.2658  .4914718  .9305922  1.772369 -.5339739 -4.710019 -.1211746 -.4101873
{txt}{space 8} {...}
{c |}{...}
 {res} 3.832015  6.798782    49.798  50.56475  161.5172  3.191812  2.900316  2.505058  5.400021  1.241545  4.191559  10.37805  2.555405  23.18428  2.392583  3.907984
{txt}{space 8} {...}
{c |}{...}
 {res} 71.48498  4.158985   4.65959  4.652775  .9571383  43.87079  45.96764  38.11643  24.04921  .4869398  1.004789   .407551  .2259721  .1959824  9.655789  2.635765
{txt}{space 8} {...}
{c |}{...}
 {res}      176       176       176       176       176       176       176       176       176       176       176       176       176       176       176       176
{txt}{hline 9}{c +}{hline 160}
{ralign 8:Total} {...}
{c |}{...}
 {res} 476.6709  4.115984  13.45853  13.41325  .0472812  141.0406  69.64605  102.8888  107.7908  .2156762  1.641702  .6972854  .6797742  .8949795  55.44723   7.15127
{txt}{space 8} {...}
{c |}{...}
 {res}      650      31.5        75    75.001  12.72827   350.001   250.001   167.501   431.001         1      16.6  2.764166         1         1        76        17
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1  1.351351      .001      .001    10.001      .001  46.66767      .001         0         0         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res}      400       1.3         5     5.001      .001   101.789    12.501    68.751  73.14363         0     .7225        .5  .5103949         1        47         6
{txt}{space 8} {...}
{c |}{...}
 {res}      500         3        10    10.001      .001  139.4113  57.33433    96.001  103.0649         0  1.333333  .6666667  .7632273         1        57  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res} 555.0555       5.4      16.8  16.66767      .001  171.4296  103.5427  135.7788   132.001         0  2.333333         1  .8964482         1        63         9
{txt}{space 8} {...}
{c |}{...}
 {res}-.5911381  2.109609  2.439241  2.440977  19.23973  .6407387  .9689728  .3189004  1.822271  1.382593  2.141393  1.419396 -.8644977 -2.576683 -.2222944 -.3461326
{txt}{space 8} {...}
{c |}{...}
 {res}  2.71772  9.502742  10.48195  10.49606  451.6242  4.232427   3.17869  1.820598  9.855029  2.911563  16.47182  10.56491  2.752695  7.639295  2.403758  3.554812
{txt}{space 8} {...}
{c |}{...}
 {res} 105.4811  3.944392  12.84465  12.85023  .4926346  54.69195  66.58985  40.67219  69.67096   .411396  1.239518  .3691999  .2657931  .3066584   10.4508  2.520494
{txt}{space 8} {...}
{c |}{...}
 {res}     1952      1952      1952      1952      1952      1952      1952      1952      1952      1952      1952      1952      1952      1952      1952      1952
{txt}{hline 9}{c BT}{hline 160}

{ralign 8:caland} {...}
{c |}{...}
     train    health    status
{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res} .1154279  4.420045  .2066441
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 2.407053 -1.270503  1.449036
{txt}{space 8} {...}
{c |}{...}
 {res} 6.793905  4.728639  3.099705
{txt}{space 8} {...}
{c |}{...}
 {res} .3196277    .75978   .405012
{txt}{space 8} {...}
{c |}{...}
 {res}     1776      1776      1776
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res} .0681818  4.590909  .1647727
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         3         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 3.426345 -1.158369  1.807275
{txt}{space 8} {...}
{c |}{...}
 {res} 12.73984  3.310945  4.266244
{txt}{space 8} {...}
{c |}{...}
 {res} .2527768  .5978316  .3720337
{txt}{space 8} {...}
{c |}{...}
 {res}      176       176       176
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res}  .111168  4.435451  .2028689
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 2.473957 -1.285238  1.477766
{txt}{space 8} {...}
{c |}{...}
 {res} 7.120464  4.770707  3.183792
{txt}{space 8} {...}
{c |}{...}
 {res} .3144207   .748094  .4022387
{txt}{space 8} {...}
{c |}{...}
 {res}     1952      1952      1952
{txt}{hline 9}{c BT}{hline 30}

{com}. tabstat yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status if year==2015, by(caland) statistics(mean ma mi q sk k sd n)

{txt}Summary statistics: mean, max, min, p25, p50, p75, skewness, kurtosis, sd, N
  by categories of: caland 

{ralign 8:caland} {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s     plots   fstruct       job       sex       age      educ
{hline 9}{c +}{hline 160}
{ralign 8:1} {...}
{c |}{...}
 {res}  469.133   2.89774  14.76956  14.73431  .0372547  145.2769  65.79931    105.14  103.7185  .1760274   1.48596  .6917812  .7039873         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      650       9.8        75    75.001  12.72827   350.001   250.001   167.501   431.001         1        11  2.764166         1         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1  1.351351      .001      .001    10.001      .001  46.66767      .001         0         0         0         0         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      400         1  6.414286     6.401      .001  108.6345  8.378194  72.28858  73.25792         0        .7        .5  .5516527         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      500       2.2        10    10.001      .001   140.001  57.29632  97.43521   102.501         0       1.2  .6666667  .7910716         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      550       4.2  18.42593  18.42693      .001  173.3343   100.001  138.3494   125.001         0         2         1  .9227289         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}-.5777015  .8971942   2.35689  2.352977  19.81908  .9387554   1.02668  .2970941  1.859003  1.701343  1.932263  1.163682 -1.017305         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 2.628906  2.996645  9.474528  9.476031   419.336  4.977714   3.58878  1.816519  9.131934  3.894566  10.35876  9.826627  2.984741         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 113.1974    2.2159  13.55709   13.5468  .5646745  58.28209  62.38717  39.85202  74.81027   .380974  1.104729  .3410815  .2686118         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}     1460      1460      1460      1460      1460      1460      1460      1460      1460      1460      1460      1460      1460      1460      1460      1460
{txt}{hline 9}{c +}{hline 160}
{ralign 8:2} {...}
{c |}{...}
 {res} 475.4463  15.30397  5.526505  5.513333  .0151723  119.4116  95.32952  100.1608  85.55893  .3968254  3.166684  .8212331  .5665304         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      640        36        12    12.001  .9533809  267.4429   225.001   167.501   238.001         1  10.83333  2.764166  .9863532         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      200        10  1.351351  1.352351      .001    40.001  3.637364  46.66767      .001         0      1.15  .2857143  .0450755         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      450      11.5  2.857143  2.858143      .001   90.6025    74.201  67.23177    76.001         0       2.4        .5  .4291374         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      500     13.75  4.155156  4.072823      .001   111.251  85.97926  87.11594  86.00852         0  2.908333  .6666667  .5634629         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      550      17.4        10    10.001      .001   150.001  115.5566   141.001   100.001         1       3.7         1  .7572428         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}-1.332556  1.588439  .4642558  .4743773  7.800784  .5936514  .6570969  .4693552  .8048749  .4217757  2.299029  2.391656  -.223955         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 4.008892  5.633846  1.621942  1.628846  62.13493  3.021062  3.323075  1.786472  10.45004  1.177895  12.32991  9.318374  2.298108         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 107.3091  5.427492  3.152051  3.153404  .1122913  42.80626   43.3484  41.31663  27.37878  .4911923  1.298299  .4741539   .240865         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}      126       126       126       126       126       126       126       126       126       126       126       126       126       126       126       126
{txt}{hline 9}{c +}{hline 160}
{ralign 8:Total} {...}
{c |}{...}
 {res} 469.6346  3.883354  14.03525  14.00175  .0355004  143.2221  68.14535  104.7444  102.2758  .1935687  1.619485  .7020655   .693067         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      650        36        75    75.001  12.72827   350.001   250.001   167.501   431.001         1        11  2.764166         1         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1  1.351351      .001      .001    10.001      .001  46.66767      .001         0         0         0         0         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      400       1.1         6     6.001      .001  103.3343    15.001  71.42957  74.44544         0       .75        .5   .529104         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      500      2.65        10    10.001      .001   140.001    60.001  96.33097   100.001         0  1.333333  .6666667  .7764158         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}      550         5  17.24138    17.201      .001  172.2232   100.001  138.8899  124.0486         0       2.2         1  .9167771         0  54.65947  7.069071
{txt}{space 8} {...}
{c |}{...}
 {res}-.6301922  2.761515  2.441377  2.437773  20.56303  .9545314  .9502425  .3096237  1.945036  1.551179  1.838023  1.468291 -.9303861         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}  2.71091  13.80341  10.03943  10.04118  452.6186  5.017634  3.477925  1.809553  9.777747  3.406155  9.622336  10.61777  2.815394         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 112.7212  4.255169  13.27476    13.264  .5427152  57.62152  61.60162  39.97963  72.35277  .3952194  1.209571  .3550283  .2690253         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}     1586      1586      1586      1586      1586      1586      1586      1586      1586      1586      1586      1586      1586      1586      1586      1586
{txt}{hline 9}{c BT}{hline 160}

{ralign 8:caland} {...}
{c |}{...}
     train    health    status
{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res}        0         4  .2082192
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  1.437222
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  3.065607
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0  .4061735
{txt}{space 8} {...}
{c |}{...}
 {res}     1460      1460      1460
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res}        0         4  .2063492
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  1.451259
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  3.106154
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0  .4062996
{txt}{space 8} {...}
{c |}{...}
 {res}      126       126       126
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res}        0         4  .2080706
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  1.438332
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  3.068799
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0  .4060557
{txt}{space 8} {...}
{c |}{...}
 {res}     1586      1586      1586
{txt}{hline 9}{c BT}{hline 30}

{com}. xtsum yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status

{txt}Variable         {c |}      Mean   Std. Dev.       Min        Max {c |}    Observations
{hline 17}{c +}{hline 44}{c +}{hline 16}
yield{col 10}overall {c |} {res} 459.1466   104.7474        200        650{txt} {c |}{col 69}N =    9713
{col 10}between {c |}{col 31}{res} 91.87876        200        650{txt} {c |}{col 69}n =    3123
{col 10}within  {c |}{col 31}{res} 59.38979   197.7577   729.9799{txt} {c |} T-bar = 3.11015
{col 18}{c |}{col 63}{c |}
land{col 10}overall {c |} {res} 3.837126   3.808118         .1         52{txt} {c |}{col 69}N =    9713
{col 10}between {c |}{col 31}{res} 3.432191         .1     36.125{txt} {c |}{col 69}n =    3123
{col 10}within  {c |}{col 31}{res} 1.343714  -29.78787   20.50379{txt} {c |} T-bar = 3.11015
{col 18}{c |}{col 63}{c |}
labor{col 10}overall {c |} {res} 13.86807   12.88942   1.351351         75{txt} {c |}{col 69}N =    9713
{col 10}between {c |}{col 31}{res}  12.1448   1.351351         75{txt} {c |}{col 69}n =    3123
{col 10}within  {c |}{col 31}{res} 4.512218  -20.81943   67.36807{txt} {c |} T-bar = 3.11015
{col 18}{c |}{col 63}{c |}
flabor{col 10}overall {c |} {res} 13.81907    12.8914       .001     75.001{txt} {c |}{col 69}N =    9713
{col 10}between {c |}{col 31}{res} 12.14535       .001     75.001{txt} {c |}{col 69}n =    3123
{col 10}within  {c |}{col 31}{res} 4.529902  -23.68093   67.31907{txt} {c |} T-bar = 3.11015
{col 18}{c |}{col 63}{c |}
elabor{col 10}overall {c |} {res} .0510015   .5472793       .001   12.72827{txt} {c |}{col 69}N =    9713
{col 10}between {c |}{col 31}{res} .5123523       .001   12.72827{txt} {c |}{col 69}n =    3123
{col 10}within  {c |}{col 31}{res} .3495781  -6.312635   10.23282{txt} {c |} T-bar = 3.11015
{col 18}{c |}{col 63}{c |}
fertile{col 10}overall {c |} {res} 140.0947   57.68704     10.001    350.001{txt} {c |}{col 69}N =    9713
{col 10}between {c |}{col 31}{res} 52.35473     10.001    350.001{txt} {c |}{col 69}n =    3123
{col 10}within  {c |}{col 31}{res}  30.7756  -59.33391   349.4697{txt} {c |} T-bar = 3.11015
{col 18}{c |}{col 63}{c |}
machane{col 10}overall {c |} {res} 59.96361   58.30805       .001    250.001{txt} {c |}{col 69}N =    9713
{col 10}between {c |}{col 31}{res} 52.69588       .001    250.001{txt} {c |}{col 69}n =    3123
{col 10}within  {c |}{col 31}{res} 26.49806  -101.6122   247.4636{txt} {c |} T-bar = 3.11015
{col 18}{c |}{col 63}{c |}
ot{col 10}overall {c |} {res} 94.88627   38.36527   46.66767    167.501{txt} {c |}{col 69}N =    9713
{col 10}between {c |}{col 31}{res} 32.96557   46.66767    167.501{txt} {c |}{col 69}n =    3123
{col 10}within  {c |}{col 31}{res}  19.8943   3.186268   191.4577{txt} {c |} T-bar = 3.11015
{col 18}{c |}{col 63}{c |}
subsidy{col 10}overall {c |} {res} 100.7687   65.06529       .001    431.001{txt} {c |}{col 69}N =    9713
{col 10}between {c |}{col 31}{res} 59.34172       .001    431.001{txt} {c |}{col 69}n =    3123
{col 10}within  {c |}{col 31}{res} 31.47627  -124.1689   421.5687{txt} {c |} T-bar = 3.11015
{col 18}{c |}{col 63}{c |}
insura~s{col 10}overall {c |} {res} .1673016   .3732641          0          1{txt} {c |}{col 69}N =    9713
{col 10}between {c |}{col 31}{res} .3105764          0          1{txt} {c |}{col 69}n =    3123
{col 10}within  {c |}{col 31}{res} .2295785  -.6326984   .9673016{txt} {c |} T-bar = 3.11015
{col 18}{c |}{col 63}{c |}
plots{col 10}overall {c |} {res} 1.649357   1.379506          0         50{txt} {c |}{col 69}N =    9713
{col 10}between {c |}{col 31}{res} 1.352373          0   18.63958{txt} {c |}{col 69}n =    3123
{col 10}within  {c |}{col 31}{res} .5191827  -16.36523   33.00977{txt} {c |} T-bar = 3.11015
{col 18}{c |}{col 63}{c |}
fstruct{col 10}overall {c |} {res} .7336367   .4195142          0   2.764166{txt} {c |}{col 69}N =    9713
{col 10}between {c |}{col 31}{res} .3071133          0   2.764166{txt} {c |}{col 69}n =    3123
{col 10}within  {c |}{col 31}{res} .3072658  -.7734464    2.84497{txt} {c |} T-bar = 3.11015
{col 18}{c |}{col 63}{c |}
job{col 10}overall {c |} {res}   .67148   .2713847          0          1{txt} {c |}{col 69}N =    9713
{col 10}between {c |}{col 31}{res} .2531948          0   .9983931{txt} {c |}{col 69}n =    3123
{col 10}within  {c |}{col 31}{res} .1196845  -.0305972   1.330276{txt} {c |} T-bar = 3.11015
{col 18}{c |}{col 63}{c |}
sex{col 10}overall {c |} {res} .5486461   .4976535          0          1{txt} {c |}{col 69}N =    9713
{col 10}between {c |}{col 31}{res} .3036777          0          1{txt} {c |}{col 69}n =    3123
{col 10}within  {c |}{col 31}{res} .4291972  -.2013539   1.348646{txt} {c |} T-bar = 3.11015
{col 18}{c |}{col 63}{c |}
age{col 10}overall {c |} {res} 54.65494   8.176516         31         76{txt} {c |}{col 69}N =    9713
{col 10}between {c |}{col 31}{res} 7.002675         31         76{txt} {c |}{col 69}n =    3123
{col 10}within  {c |}{col 31}{res} 4.962465   31.79115   81.19115{txt} {c |} T-bar = 3.11015
{col 18}{c |}{col 63}{c |}
educ{col 10}overall {c |} {res} 7.069071   1.955065          0         17{txt} {c |}{col 69}N =    9713
{col 10}between {c |}{col 31}{res} 1.666296          0         17{txt} {c |}{col 69}n =    3123
{col 10}within  {c |}{col 31}{res} 1.196662  -.3791253    14.0518{txt} {c |} T-bar = 3.11015
{col 18}{c |}{col 63}{c |}
train{col 10}overall {c |} {res} .0542572   .2265361          0          1{txt} {c |}{col 69}N =    9713
{col 10}between {c |}{col 31}{res} .1807494          0          1{txt} {c |}{col 69}n =    3123
{col 10}within  {c |}{col 31}{res} .1545685  -.6957428   .8542572{txt} {c |} T-bar = 3.11015
{col 18}{c |}{col 63}{c |}
health{col 10}overall {c |} {res} 4.260579   .6261296          1          5{txt} {c |}{col 69}N =    9713
{col 10}between {c |}{col 31}{res} .4914433          1          5{txt} {c |}{col 69}n =    3123
{col 10}within  {c |}{col 31}{res} .4262483   1.660579   6.260579{txt} {c |} T-bar = 3.11015
{col 18}{c |}{col 63}{c |}
status{col 10}overall {c |} {res} .2076598   .4056528          0          1{txt} {c |}{col 69}N =    9713
{col 10}between {c |}{col 31}{res} .3476354          0          1{txt} {c |}{col 69}n =    3123
{col 10}within  {c |}{col 31}{res} .2239442  -.5923402    1.00766{txt} {c |} T-bar = 3.11015

{com}. 
. **方差分析
. oneway yield caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}    yield
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 458.80333
  {txt}        2 {c |}  {res}  463.6961
  {txt}        3 {c |}  {res} 440.38461
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 459.14661

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 16027.9916      2   8013.99582      0.73     0.4818
{txt} Within groups     {res}  106544171   9710   10972.6231
{txt}{hline 72}
    Total          {res}  106560199   9712   10972.0139

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}  4.4768{txt}  Prob>chi2 = {res}0.107

                        {txt}Comparison of yield by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} 4.89277
         {txt}{c |}  {res}    0.712
         {txt}{c |}
       3 {c |}   {res}-18.4187   -23.3115
         {txt}{c |}  {res}    1.000      1.000
{txt}
{com}. //oneway income cland, mean bonferroni 
. //oneway profit cland, mean bonferroni 
. oneway labor caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   laboro,
            {c |} Winsorized
            {c |}  fraction
            {c |}     .01
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res}   14.5215
  {txt}        2 {c |}  {res} 5.3424744
  {txt}        3 {c |}  {res} 3.3038462
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 13.868068

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 54155.8396      2   27077.9198    168.61     0.0000
{txt} Within groups     {res} 1559367.53   9710   160.593978
{txt}{hline 72}
    Total          {res} 1613523.37   9712   166.137085

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}824.9982{txt}  Prob>chi2 = {res}0.000

           {txt}Comparison of laboro, Winsorized fraction .01 by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-9.17903
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res}-11.2177   -2.03863
         {txt}{c |}  {res}    0.632      1.000
{txt}
{com}. oneway flabor caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   flabor
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 14.477083
  {txt}        2 {c |}  {res} 5.2374869
  {txt}        3 {c |}  {res} 1.8625386
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 13.819067

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 54932.6899      2    27466.345    171.06     0.0000
{txt} Within groups     {res} 1559086.94   9710   160.565081
{txt}{hline 72}
    Total          {res} 1614019.63   9712   166.188183

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}854.6647{txt}  Prob>chi2 = {res}0.000

                        {txt}Comparison of flabor by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} -9.2396
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res}-12.6145   -3.37495
         {txt}{c |}  {res}    0.478      1.000
{txt}
{com}. oneway elabor caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   elabor
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .04641726
  {txt}        2 {c |}  {res} .10698759
  {txt}        3 {c |}  {res} 1.4433077
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res}  .0510015

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 6.22626376      2   3.11313188     10.41     0.0000
{txt} Within groups     {res} 2902.65979   9710   .298935097
{txt}{hline 72}
    Total          {res} 2908.88605   9712   .299514626

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}437.4425{txt}  Prob>chi2 = {res}0.000

                        {txt}Comparison of elabor by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}  .06057
         {txt}{c |}  {res}    0.015
         {txt}{c |}
       3 {c |}   {res} 1.39689    1.33632
         {txt}{c |}  {res}    0.001      0.002
{txt}
{com}. oneway machane caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   machane
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 57.560764
  {txt}        2 {c |}  {res} 91.186728
  {txt}        3 {c |}  {res} 142.84716
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 59.963612

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 737523.846      2   368761.923    110.92     0.0000
{txt} Within groups     {res} 32281615.7   9710   3324.57422
{txt}{hline 72}
    Total          {res} 33019139.5   9712   3399.82903

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 75.1665{txt}  Prob>chi2 = {res}0.000

                       {txt}Comparison of machane by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}  33.626
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res} 85.2864    51.6604
         {txt}{c |}  {res}    0.110      0.617
{txt}
{com}. oneway ot caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}     ot
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 95.535362
  {txt}        2 {c |}  {res} 86.460691
  {txt}        3 {c |}  {res}  69.46254
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 94.886274

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 54006.2584      2   27003.1292     18.41     0.0000
{txt} Within groups     {res} 14241025.3   9710   1466.63494
{txt}{hline 72}
    Total          {res} 14295031.5   9712   1471.89369

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 11.7597{txt}  Prob>chi2 = {res}0.003

                          {txt}Comparison of ot by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-9.07467
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res}-26.0728   -16.9982
         {txt}{c |}  {res}    1.000      1.000
{txt}
{com}. oneway subsidy caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   subsidy
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 102.01443
  {txt}        2 {c |}  {res} 84.715763
  {txt}        3 {c |}  {res} 11.616095
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 100.76872

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 207450.211      2   103725.106     24.62     0.0000
{txt} Within groups     {res} 40908223.6   9710   4212.99934
{txt}{hline 72}
    Total          {res} 41115673.8   9712   4233.49195

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}295.3098{txt}  Prob>chi2 = {res}0.000

                       {txt}Comparison of subsidy by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-17.2987
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res}-90.3983   -73.0997
         {txt}{c |}  {res}    0.147      0.335
{txt}
{com}. oneway insurance caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |} insurances
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .15694968
  {txt}        2 {c |}  {res} .30333817
  {txt}        3 {c |}  {res}         0
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} .16730155

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 13.7733964      2   6.88669819     49.93     0.0000
{txt} Within groups     {res} 1339.36158   9710   .137936311
{txt}{hline 72}
    Total          {res} 1353.13497   9712   .139326089

{txt}Bartlett's test for equal variances:  chi2({res}1{txt}) = {res} 80.6925{txt}  Prob>chi2 = {res}0.000

{txt}note: Bartlett's test performed on cells with positive variance:
      1 multiple-observation cells not used

                      Comparison of insurances by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} .146388
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res} -.15695   -.303338
         {txt}{c |}  {res}    1.000      0.746
{txt}
{com}. oneway plots caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}    plots
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 1.5327084
  {txt}        2 {c |}  {res} 3.0936286
  {txt}        3 {c |}  {res}      30.3
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 1.6493571

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 3201.67934      2   1600.83967   1017.25     0.0000
{txt} Within groups     {res} 15280.6112   9710   1.57369837
{txt}{hline 72}
    Total          {res} 18482.2906   9712   1.90303651

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}482.2520{txt}  Prob>chi2 = {res}0.000

                        {txt}Comparison of plots by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} 1.56092
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res} 28.7673    27.2064
         {txt}{c |}  {res}    0.000      0.000
{txt}
{com}. oneway fstruct caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}  fstructs,
            {c |} Winsorized
            {c |}  fraction
            {c |}     .01
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .73408205
  {txt}        2 {c |}  {res}  .7289668
  {txt}        3 {c |}  {res} .33333334
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} .73363668

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} .337300658      2   .168650329      0.96     0.3836
{txt} Within groups     {res} 1708.89821   9710   .175993636
{txt}{hline 72}
    Total          {res} 1709.23551   9712   .175992124

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}  6.0109{txt}  Prob>chi2 = {res}0.050

          {txt}Comparison of fstructs, Winsorized fraction .01 by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-.005115
         {txt}{c |}  {res}    1.000
         {txt}{c |}
       3 {c |}   {res}-.400749   -.395633
         {txt}{c |}  {res}    0.530      0.549
{txt}
{com}. oneway job caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}     job
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .67883593
  {txt}        2 {c |}  {res} .57601475
  {txt}        3 {c |}  {res} .37652822
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} .67147997

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 6.94145019      2    3.4707251     47.58     0.0000
{txt} Within groups     {res} 708.343867   9710   .072949935
{txt}{hline 72}
    Total          {res} 715.285317   9712   .073649641

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 36.2606{txt}  Prob>chi2 = {res}0.000

                         {txt}Comparison of job by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-.102821
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res}-.302308   -.199487
         {txt}{c |}  {res}    0.341      0.891
{txt}
{com}. oneway sex caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}     sex
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .54799379
  {txt}        2 {c |}  {res} .55732946
  {txt}        3 {c |}  {res}        .5
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} .54864614

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} .060522934      2   .030261467      0.12     0.8850
{txt} Within groups     {res} 2405.20417   9710   .247703828
{txt}{hline 72}
    Total          {res}  2405.2647   9712    .24765905

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}  0.2729{txt}  Prob>chi2 = {res}0.872

                         {txt}Comparison of sex by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} .009336
         {txt}{c |}  {res}    1.000
         {txt}{c |}
       3 {c |}   {res}-.047994   -.057329
         {txt}{c |}  {res}    1.000      1.000
{txt}
{com}. oneway age caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}    agee,
            {c |} Winsorized
            {c |}  fraction
            {c |}     .01
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 54.775351
  {txt}        2 {c |}  {res} 53.070486
  {txt}        3 {c |}  {res} 57.329735
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 54.654941

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 1874.84633      2   937.423163     14.06     0.0000
{txt} Within groups     {res} 647425.012   9710   66.6761083
{txt}{hline 72}
    Total          {res} 649299.858   9712    66.855422

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 14.2833{txt}  Prob>chi2 = {res}0.001

            {txt}Comparison of agee, Winsorized fraction .01 by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-1.70486
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res} 2.55438    4.25925
         {txt}{c |}  {res}    1.000      1.000
{txt}
{com}. oneway educ caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}    educ
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 7.0596582
  {txt}        2 {c |}  {res} 7.1895258
  {txt}        3 {c |}  {res} 8.0345356
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 7.0690712

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 12.6605448      2   6.33027238      1.66     0.1909
{txt} Within groups     {res} 37109.2966   9710   3.82176072
{txt}{hline 72}
    Total          {res} 37121.9571   9712    3.8222773

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}  1.5387{txt}  Prob>chi2 = {res}0.463

                         {txt}Comparison of educ by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} .129868
         {txt}{c |}  {res}    0.279
         {txt}{c |}
       3 {c |}   {res} .974877     .84501
         {txt}{c |}  {res}    1.000      1.000
{txt}
{com}. oneway train caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}    train
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .05508756
  {txt}        2 {c |}  {res} .04208999
  {txt}        3 {c |}  {res}        .5
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} .05425718

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} .505594316      2   .252797158      4.93     0.0072
{txt} Within groups     {res} 497.900871   9710   .051277124
{txt}{hline 72}
    Total          {res} 498.406466   9712   .051318623

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 22.0086{txt}  Prob>chi2 = {res}0.000

                        {txt}Comparison of train by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-.012998
         {txt}{c |}  {res}    0.439
         {txt}{c |}
       3 {c |}   {res} .444912     .45791
         {txt}{c |}  {res}    0.016      0.013
{txt}
{com}. oneway health caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   health
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 4.2562625
  {txt}        2 {c |}  {res} 4.3164006
  {txt}        3 {c |}  {res}       4.5
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 4.2605786

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 2.42970432      2   1.21485216      3.10     0.0451
{txt} Within groups     {res} 3805.04584   9710   .391868779
{txt}{hline 72}
    Total          {res} 3807.47555   9712   .392038257

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 16.1484{txt}  Prob>chi2 = {res}0.000

                        {txt}Comparison of health by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} .060138
         {txt}{c |}  {res}    0.045
         {txt}{c |}
       3 {c |}   {res} .243738    .183599
         {txt}{c |}  {res}    1.000      1.000
{txt}
{com}. oneway status caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   status
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .20948792
  {txt}        2 {c |}  {res} .18142235
  {txt}        3 {c |}  {res}         1
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} .20765984

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 1.76006782      2   .880033912      5.35     0.0047
{txt} Within groups     {res} 1596.39004   9710   .164406801
{txt}{hline 72}
    Total          {res} 1598.15011   9712   .164554171

{txt}Bartlett's test for equal variances:  chi2({res}1{txt}) = {res}  3.5876{txt}  Prob>chi2 = {res}0.058

{txt}note: Bartlett's test performed on cells with positive variance:
      1 multiple-observation cells not used

                        Comparison of status by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-.028066
         {txt}{c |}  {res}    0.240
         {txt}{c |}
       3 {c |}   {res} .790512    .818578
         {txt}{c |}  {res}    0.018      0.013
{txt}
{com}. 
. ***生成交叉项
. g lnyield = ln(yield)
{txt}
{com}. g lnland = ln(land)
{txt}
{com}. g lnlabor = ln(labor)
{txt}
{com}. g lnflabor = ln(flabor)
{txt}
{com}. g lnelabor = ln(elabor)
{txt}
{com}. g lnfertile = ln(fertile)
{txt}
{com}. g lnmachane = ln(machane)
{txt}
{com}. g lnot = ln(ot)
{txt}
{com}. g lnsubsidy = ln(subsidy)
{txt}
{com}. g lninsurance = ln(insurance)
{txt}(8,088 missing values generated)

{com}. g lnland2 = lnland^2
{txt}
{com}. g lnlabor2 = lnlabor^2
{txt}
{com}. g lnflabor2 = lnflabor^2
{txt}
{com}. g lnelabor2 = lnelabor^2
{txt}
{com}. g lnfertile2 = lnfertile^2
{txt}
{com}. g lnmachane2 = lnmachane^2
{txt}
{com}. g lnot2 = lnot^2
{txt}
{com}. g lnlaborlnfertile = lnlabor*lnfertile
{txt}
{com}. g lnlaborlnmachane = lnlabor*lnmachane
{txt}
{com}. g lnlaborlnot = lnlabor*lnot
{txt}
{com}. g lnflaborlnelabor = lnflabor*lnelabor
{txt}
{com}. g lnflaborlnfertile = lnflabor*lnfertile
{txt}
{com}. g lnflaborlnmachane = lnflabor*lnmachane
{txt}
{com}. g lnflaborlnot = lnflabor*lnot
{txt}
{com}. g lnelaborlnfertile = lnelabor*lnfertile
{txt}
{com}. g lnelaborlnmachane = lnelabor*lnmachane
{txt}
{com}. g lnelaborlnot = lnelabor*lnot
{txt}
{com}. g lnfertilelnmachane = lnfertile*lnmachane
{txt}
{com}. g lnfertilelnot = lnfertile*lnot
{txt}
{com}. g lnmachanelnot = lnmachane*lnot
{txt}
{com}. 
. **简单的相关性检验
. //reg lnprofit lnland
. pwcorr lnyield lnland,sig

             {txt}{c |}  lnyield   lnland
{hline 13}{c +}{hline 18}
     lnyield {c |} {res}  1.0000 
             {txt}{c |}
             {c |}
      lnland {c |} {res}  0.2429   1.0000 
             {txt}{c |}{res}   0.0000
             {txt}{c |}

{com}. //pwcorr lnprofit lnland,sig
. qui reg lnyield lnland land lnlabor lnfertile lnmachane lnot lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy
{txt}
{com}. estat vif

{txt}    Variable {c |}       VIF       1/VIF  
{hline 13}{c +}{hline 22}
{space 7}lnot2 {c |} {res}   650.29    0.001538
{txt}{space 8}lnot {c |} {res}   646.57    0.001547
{txt}lnfertilel~t {c |} {res}   256.47    0.003899
{txt}{space 3}lnmachane {c |} {res}   226.44    0.004416
{txt}{space 5}lnlabor {c |} {res}   210.17    0.004758
{txt}{space 1}lnlaborlnot {c |} {res}   209.09    0.004783
{txt}lnmachanel~t {c |} {res}   164.28    0.006087
{txt}{space 3}lnfertile {c |} {res}   155.75    0.006421
{txt}lnlaborlnf~e {c |} {res}   122.97    0.008132
{txt}lnfertilel~e {c |} {res}   108.00    0.009259
{txt}{space 2}lnfertile2 {c |} {res}    69.69    0.014350
{txt}{space 4}lnlabor2 {c |} {res}    29.99    0.033346
{txt}lnlaborlnm~e {c |} {res}    17.83    0.056070
{txt}{space 6}lnland {c |} {res}     4.80    0.208369
{txt}{space 2}lnmachane2 {c |} {res}     4.01    0.249450
{txt}{space 8}land {c |} {res}     3.71    0.269188
{txt}{space 7}plots {c |} {res}     1.61    0.622179
{txt}{space 6}health {c |} {res}     1.36    0.733133
{txt}{space 9}age {c |} {res}     1.35    0.742914
{txt}{space 8}loan {c |} {res}     1.22    0.817983
{txt}{space 9}sex {c |} {res}     1.22    0.818742
{txt}{space 3}lnsubsidy {c |} {res}     1.21    0.823696
{txt}{space 8}educ {c |} {res}     1.21    0.824335
{txt}{space 9}job {c |} {res}     1.15    0.872373
{txt}{space 7}train {c |} {res}     1.12    0.890930
{txt}{space 2}insurances {c |} {res}     1.05    0.948001
{txt}{space 6}status {c |} {res}     1.03    0.969461
{txt}{space 5}fstruct {c |} {res}     1.02    0.979919
{txt}{hline 13}{c +}{hline 22}
    Mean VIF {c |} {res}   103.38
{txt}
{com}. qui reg lnyield lnland land lnlabor lnfertile lnmachane lnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy
{txt}
{com}. estat vif

{txt}    Variable {c |}       VIF       1/VIF  
{hline 13}{c +}{hline 22}
{space 6}lnland {c |} {res}     4.19    0.238702
{txt}{space 8}land {c |} {res}     3.35    0.298147
{txt}{space 5}lnlabor {c |} {res}     1.71    0.583750
{txt}{space 3}lnmachane {c |} {res}     1.60    0.625956
{txt}{space 7}plots {c |} {res}     1.56    0.639330
{txt}{space 6}health {c |} {res}     1.35    0.738220
{txt}{space 9}age {c |} {res}     1.34    0.745780
{txt}{space 9}sex {c |} {res}     1.21    0.825250
{txt}{space 8}educ {c |} {res}     1.21    0.829679
{txt}{space 3}lnsubsidy {c |} {res}     1.18    0.849224
{txt}{space 8}lnot {c |} {res}     1.17    0.852031
{txt}{space 9}job {c |} {res}     1.13    0.888153
{txt}{space 7}train {c |} {res}     1.11    0.902736
{txt}{space 8}loan {c |} {res}     1.10    0.912282
{txt}{space 3}lnfertile {c |} {res}     1.09    0.915159
{txt}{space 2}insurances {c |} {res}     1.04    0.961668
{txt}{space 6}status {c |} {res}     1.03    0.973233
{txt}{space 5}fstruct {c |} {res}     1.02    0.983435
{txt}{hline 13}{c +}{hline 22}
    Mean VIF {c |} {res}     1.52
{txt}
{com}. pwcorr lnlabor lnfertile lnmachane lnot lnlabor2 lnfertile2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot

             {txt}{c |}  lnlabor lnfer~le lnmach~e     lnot lnlabor2 lnfert~2    lnot2
{hline 13}{c +}{hline 63}
     lnlabor {c |} {res}  1.0000 
   {txt}lnfertile {c |} {res}  0.0492   1.0000 
   {txt}lnmachane {c |} {res} -0.3916   0.0646   1.0000 
        {txt}lnot {c |} {res}  0.1753   0.2196   0.0346   1.0000 
    {txt}lnlabor2 {c |} {res}  0.9734   0.0519  -0.4131   0.1797   1.0000 
  {txt}lnfertile2 {c |} {res}  0.0718   0.9913   0.0572   0.2353   0.0776   1.0000 
       {txt}lnot2 {c |} {res}  0.1788   0.2193   0.0300   0.9991   0.1845   0.2356   1.0000 
{txt}lnlaborlnf~e {c |} {res}  0.9471   0.3489  -0.3481   0.2212   0.9276   0.3655   0.2249 
{txt}lnlaborlnm~e {c |} {res} -0.3021   0.0571   0.9536   0.0337  -0.3564   0.0505   0.0286 
 {txt}lnlaborlnot {c |} {res}  0.9655   0.0970  -0.3546   0.4099   0.9479   0.1217   0.4137 
{txt}lnfertilel~e {c |} {res} -0.3893   0.0749   0.9941   0.0430  -0.4140   0.0684   0.0380 
{txt}lnfertilel~t {c |} {res}  0.1386   0.8018   0.0650   0.7554   0.1447   0.8070   0.7552 
{txt}lnmachanel~t {c |} {res} -0.3890   0.0722   0.9953   0.0563  -0.4129   0.0653   0.0517 

             {txt}{c |} lnlab~le lnlab~ne lnlabo~t lnfer~ne lnfert~t lnmach~t
{hline 13}{c +}{hline 54}
lnlaborlnf~e {c |} {res}  1.0000 
{txt}lnlaborlnm~e {c |} {res} -0.2697   1.0000 
 {txt}lnlaborlnot {c |} {res}  0.9303  -0.2737   1.0000 
{txt}lnfertilel~e {c |} {res} -0.3471   0.9513  -0.3518   1.0000 
{txt}lnfertilel~t {c |} {res}  0.3683   0.0582   0.3140   0.0771   1.0000 
{txt}lnmachanel~t {c |} {res} -0.3449   0.9557  -0.3506   0.9917   0.0832   1.0000 
{txt}
{com}. 
. xtreg lnlabor lnland lnland2,fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     9,713
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     3,123

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0967{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.3811{col 63}{txt}avg{col 67}={col 69}{res}       3.1
{txt}     overall = {res}0.3552{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}3122{txt}){col 67}={col 70}{res}   159.51
{txt}corr(u_i, Xb){col 16}= {res}0.2081{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:3,123} clusters in id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     lnlabor{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}lnland {c |}{col 14}{res}{space 2}-.3200442{col 26}{space 2}  .023203{col 37}{space 1}  -13.79{col 46}{space 3}0.000{col 54}{space 4}-.3655388{col 67}{space 3}-.2745496
{txt}{space 5}lnland2 {c |}{col 14}{res}{space 2}-.0176307{col 26}{space 2} .0090004{col 37}{space 1}   -1.96{col 46}{space 3}0.050{col 54}{space 4} -.035278{col 67}{space 3} .0000167
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.626569{col 26}{space 2} .0181953{col 37}{space 1}  144.35{col 46}{space 3}0.000{col 54}{space 4} 2.590893{col 67}{space 3} 2.662245
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .61096162
     {txt}sigma_e {c |} {res} .32480566
         {txt}rho {c |} {res} .77964765{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. xtreg lnflabor lnland lnland2,fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     9,713
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     3,123

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0598{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.3472{col 63}{txt}avg{col 67}={col 69}{res}       3.1
{txt}     overall = {res}0.3063{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}3122{txt}){col 67}={col 70}{res}   116.77
{txt}corr(u_i, Xb){col 16}= {res}0.1716{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:3,123} clusters in id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    lnflabor{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}lnland {c |}{col 14}{res}{space 2}-.3283539{col 26}{space 2} .0251232{col 37}{space 1}  -13.07{col 46}{space 3}0.000{col 54}{space 4}-.3776134{col 67}{space 3}-.2790943
{txt}{space 5}lnland2 {c |}{col 14}{res}{space 2}-.0282433{col 26}{space 2} .0103764{col 37}{space 1}   -2.72{col 46}{space 3}0.007{col 54}{space 4}-.0485886{col 67}{space 3} -.007898
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  2.63488{col 26}{space 2} .0237878{col 37}{space 1}  110.77{col 46}{space 3}0.000{col 54}{space 4} 2.588238{col 67}{space 3} 2.681521
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .66828655
     {txt}sigma_e {c |} {res} .45437958
         {txt}rho {c |} {res} .68386004{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. xtreg lnelabor lnland lnland2,fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     9,713
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     3,123

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0080{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.0108{col 63}{txt}avg{col 67}={col 69}{res}       3.1
{txt}     overall = {res}0.0072{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}3122{txt}){col 67}={col 70}{res}     6.89
{txt}corr(u_i, Xb){col 16}= {res}-0.1418{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0010

{txt}{ralign 78:(Std. Err. adjusted for {res:3,123} clusters in id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    lnelabor{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}lnland {c |}{col 14}{res}{space 2} .1435257{col 26}{space 2} .0464955{col 37}{space 1}    3.09{col 46}{space 3}0.002{col 54}{space 4} .0523607{col 67}{space 3} .2346906
{txt}{space 5}lnland2 {c |}{col 14}{res}{space 2} .0503563{col 26}{space 2} .0242895{col 37}{space 1}    2.07{col 46}{space 3}0.038{col 54}{space 4} .0027313{col 67}{space 3} .0979814
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-6.940096{col 26}{space 2} .0613465{col 37}{space 1} -113.13{col 46}{space 3}0.000{col 54}{space 4} -7.06038{col 67}{space 3}-6.819813
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 1.0451954
     {txt}sigma_e {c |} {res} .82849688
         {txt}rho {c |} {res} .61412669{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. xtreg lnfertile lnland lnland2,fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     9,713
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     3,123

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0083{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.0019{col 63}{txt}avg{col 67}={col 69}{res}       3.1
{txt}     overall = {res}0.0028{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}3122{txt}){col 67}={col 70}{res}    22.09
{txt}corr(u_i, Xb){col 16}= {res}-0.1645{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:3,123} clusters in id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   lnfertile{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}lnland {c |}{col 14}{res}{space 2}-.0707116{col 26}{space 2} .0225458{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-.1149177{col 67}{space 3}-.0265055
{txt}{space 5}lnland2 {c |}{col 14}{res}{space 2}-.0142995{col 26}{space 2} .0085654{col 37}{space 1}   -1.67{col 46}{space 3}0.095{col 54}{space 4} -.031094{col 67}{space 3} .0024949
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 4.934418{col 26}{space 2}  .013751{col 37}{space 1}  358.84{col 46}{space 3}0.000{col 54}{space 4} 4.907456{col 67}{space 3}  4.96138
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res}  .4549615
     {txt}sigma_e {c |} {res} .32350089
         {txt}rho {c |} {res} .66418981{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. xtreg lnmachane lnland lnland2,fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     9,713
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     3,123

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0055{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.2861{col 63}{txt}avg{col 67}={col 69}{res}       3.1
{txt}     overall = {res}0.2626{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}3122{txt}){col 67}={col 70}{res}    10.22
{txt}corr(u_i, Xb){col 16}= {res}0.4626{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:3,123} clusters in id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   lnmachane{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}lnland {c |}{col 14}{res}{space 2} .6431657{col 26}{space 2} .1433798{col 37}{space 1}    4.49{col 46}{space 3}0.000{col 54}{space 4} .3620375{col 67}{space 3} .9242939
{txt}{space 5}lnland2 {c |}{col 14}{res}{space 2}-.1131353{col 26}{space 2} .0550085{col 37}{space 1}   -2.06{col 46}{space 3}0.040{col 54}{space 4}-.2209918{col 67}{space 3}-.0052787
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.211711{col 26}{space 2}  .110404{col 37}{space 1}   10.98{col 46}{space 3}0.000{col 54}{space 4} .9952387{col 67}{space 3} 1.428182
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 4.1821035
     {txt}sigma_e {c |} {res} 2.1818906
         {txt}rho {c |} {res} .78604447{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. xtreg lnot lnland lnland2,fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     9,713
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     3,123

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0108{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.0005{col 63}{txt}avg{col 67}={col 69}{res}       3.1
{txt}     overall = {res}0.0022{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}3122{txt}){col 67}={col 70}{res}    16.99
{txt}corr(u_i, Xb){col 16}= {res}-0.1930{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:3,123} clusters in id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        lnot{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}lnland {c |}{col 14}{res}{space 2} -.098285{col 26}{space 2} .0181971{col 37}{space 1}   -5.40{col 46}{space 3}0.000{col 54}{space 4}-.1339644{col 67}{space 3}-.0626056
{txt}{space 5}lnland2 {c |}{col 14}{res}{space 2} .0094059{col 26}{space 2}  .007205{col 37}{space 1}    1.31{col 46}{space 3}0.192{col 54}{space 4}-.0047211{col 67}{space 3} .0235329
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 4.541435{col 26}{space 2} .0139275{col 37}{space 1}  326.08{col 46}{space 3}0.000{col 54}{space 4} 4.514127{col 67}{space 3} 4.568743
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .36667118
     {txt}sigma_e {c |} {res} .25238005
         {txt}rho {c |} {res} .67853748{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. 
. **混合回归、固定效应回归or随机效应回归？
. qui xtreg lnyield lnland land lnlabor lnfertile lnmachane lnot lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy, re r
{txt}
{com}. xtoverid

{txt}Test of overidentifying restrictions: fixed vs random effects
Cross-section time-series model: xtreg re  robust cluster(id)
Sargan-Hansen statistic{res}{col 25}349.001{txt}  Chi-sq({res}28{txt}){col 47}P-value = {res}0.0000
{txt}
{com}. reg lnyield lnland land lnlabor lnfertile lnmachane lnot lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy i.sm i.year, vce(cluster id)

{txt}Linear regression                               Number of obs     = {res}     9,713
                                                {txt}F(38, 3122)       =  {res}    68.18
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.2516
                                                {txt}Root MSE          =    {res}  .2243

{txt}{ralign 84:(Std. Err. adjusted for {res:3,123} clusters in id)}
{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}           lnyield{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}lnland {c |}{col 20}{res}{space 2} .0467083{col 32}{space 2} .0072226{col 43}{space 1}    6.47{col 52}{space 3}0.000{col 60}{space 4} .0325468{col 73}{space 3} .0608698
{txt}{space 14}land {c |}{col 20}{res}{space 2}-.0064658{col 32}{space 2} .0013385{col 43}{space 1}   -4.83{col 52}{space 3}0.000{col 60}{space 4}-.0090902{col 73}{space 3}-.0038414
{txt}{space 11}lnlabor {c |}{col 20}{res}{space 2}-.0172099{col 32}{space 2} .0552599{col 43}{space 1}   -0.31{col 52}{space 3}0.755{col 60}{space 4}-.1255592{col 73}{space 3} .0911395
{txt}{space 9}lnfertile {c |}{col 20}{res}{space 2} .0640748{col 32}{space 2} .0782542{col 43}{space 1}    0.82{col 52}{space 3}0.413{col 60}{space 4}-.0893602{col 73}{space 3} .2175098
{txt}{space 9}lnmachane {c |}{col 20}{res}{space 2} .0110384{col 32}{space 2} .0100924{col 43}{space 1}    1.09{col 52}{space 3}0.274{col 60}{space 4}-.0087501{col 73}{space 3} .0308269
{txt}{space 14}lnot {c |}{col 20}{res}{space 2} .8097688{col 32}{space 2} .1700122{col 43}{space 1}    4.76{col 52}{space 3}0.000{col 60}{space 4} .4764218{col 73}{space 3} 1.143116
{txt}{space 10}lnlabor2 {c |}{col 20}{res}{space 2} .0178148{col 32}{space 2} .0043211{col 43}{space 1}    4.12{col 52}{space 3}0.000{col 60}{space 4} .0093423{col 73}{space 3} .0262873
{txt}{space 8}lnfertile2 {c |}{col 20}{res}{space 2} -.007567{col 32}{space 2} .0060462{col 43}{space 1}   -1.25{col 52}{space 3}0.211{col 60}{space 4} -.019422{col 73}{space 3}  .004288
{txt}{space 8}lnmachane2 {c |}{col 20}{res}{space 2} .0030146{col 32}{space 2} .0003945{col 43}{space 1}    7.64{col 52}{space 3}0.000{col 60}{space 4} .0022411{col 73}{space 3}  .003788
{txt}{space 13}lnot2 {c |}{col 20}{res}{space 2}-.0835179{col 32}{space 2} .0186593{col 43}{space 1}   -4.48{col 52}{space 3}0.000{col 60}{space 4}-.1201036{col 73}{space 3}-.0469323
{txt}{space 2}lnlaborlnfertile {c |}{col 20}{res}{space 2}-.0166871{col 32}{space 2} .0088837{col 43}{space 1}   -1.88{col 52}{space 3}0.060{col 60}{space 4}-.0341056{col 73}{space 3} .0007313
{txt}{space 2}lnlaborlnmachane {c |}{col 20}{res}{space 2}-.0024103{col 32}{space 2} .0010364{col 43}{space 1}   -2.33{col 52}{space 3}0.020{col 60}{space 4}-.0044423{col 73}{space 3}-.0003783
{txt}{space 7}lnlaborlnot {c |}{col 20}{res}{space 2} .0048087{col 32}{space 2} .0105175{col 43}{space 1}    0.46{col 52}{space 3}0.648{col 60}{space 4}-.0158133{col 73}{space 3} .0254307
{txt}lnfertilelnmachane {c |}{col 20}{res}{space 2}-.0034366{col 32}{space 2}   .00143{col 43}{space 1}   -2.40{col 52}{space 3}0.016{col 60}{space 4}-.0062404{col 73}{space 3}-.0006328
{txt}{space 5}lnfertilelnot {c |}{col 20}{res}{space 2} .0137787{col 32}{space 2} .0142561{col 43}{space 1}    0.97{col 52}{space 3}0.334{col 60}{space 4}-.0141735{col 73}{space 3}  .041731
{txt}{space 5}lnmachanelnot {c |}{col 20}{res}{space 2} .0060614{col 32}{space 2} .0018895{col 43}{space 1}    3.21{col 52}{space 3}0.001{col 60}{space 4} .0023567{col 73}{space 3} .0097662
{txt}{space 15}sex {c |}{col 20}{res}{space 2}-.0025875{col 32}{space 2} .0122561{col 43}{space 1}   -0.21{col 52}{space 3}0.833{col 60}{space 4}-.0266183{col 73}{space 3} .0214433
{txt}{space 15}age {c |}{col 20}{res}{space 2} .0003882{col 32}{space 2}  .000353{col 43}{space 1}    1.10{col 52}{space 3}0.272{col 60}{space 4}-.0003041{col 73}{space 3} .0010804
{txt}{space 14}educ {c |}{col 20}{res}{space 2} .0021773{col 32}{space 2} .0015163{col 43}{space 1}    1.44{col 52}{space 3}0.151{col 60}{space 4}-.0007957{col 73}{space 3} .0051504
{txt}{space 13}train {c |}{col 20}{res}{space 2} -.013149{col 32}{space 2} .0117632{col 43}{space 1}   -1.12{col 52}{space 3}0.264{col 60}{space 4}-.0362134{col 73}{space 3} .0099154
{txt}{space 12}health {c |}{col 20}{res}{space 2} .0167782{col 32}{space 2} .0049185{col 43}{space 1}    3.41{col 52}{space 3}0.001{col 60}{space 4} .0071344{col 73}{space 3}  .026422
{txt}{space 12}status {c |}{col 20}{res}{space 2} .0207904{col 32}{space 2} .0068013{col 43}{space 1}    3.06{col 52}{space 3}0.002{col 60}{space 4} .0074549{col 73}{space 3}  .034126
{txt}{space 11}fstruct {c |}{col 20}{res}{space 2}  -.00108{col 32}{space 2}  .006474{col 43}{space 1}   -0.17{col 52}{space 3}0.868{col 60}{space 4}-.0137737{col 73}{space 3} .0116137
{txt}{space 13}plots {c |}{col 20}{res}{space 2} .0078764{col 32}{space 2} .0031279{col 43}{space 1}    2.52{col 52}{space 3}0.012{col 60}{space 4} .0017434{col 73}{space 3} .0140093
{txt}{space 8}insurances {c |}{col 20}{res}{space 2}-.0642098{col 32}{space 2} .0074609{col 43}{space 1}   -8.61{col 52}{space 3}0.000{col 60}{space 4}-.0788386{col 73}{space 3} -.049581
{txt}{space 14}loan {c |}{col 20}{res}{space 2}-.0017025{col 32}{space 2} .0105567{col 43}{space 1}   -0.16{col 52}{space 3}0.872{col 60}{space 4}-.0224013{col 73}{space 3} .0189963
{txt}{space 15}job {c |}{col 20}{res}{space 2} .0040892{col 32}{space 2} .0110222{col 43}{space 1}    0.37{col 52}{space 3}0.711{col 60}{space 4}-.0175224{col 73}{space 3} .0257008
{txt}{space 9}lnsubsidy {c |}{col 20}{res}{space 2} .0052527{col 32}{space 2} .0013422{col 43}{space 1}    3.91{col 52}{space 3}0.000{col 60}{space 4} .0026211{col 73}{space 3} .0078844
{txt}{space 18} {c |}
{space 16}sm {c |}
{space 15}12  {c |}{col 20}{res}{space 2} .1623497{col 32}{space 2}  .026124{col 43}{space 1}    6.21{col 52}{space 3}0.000{col 60}{space 4} .1111277{col 73}{space 3} .2135718
{txt}{space 15}13  {c |}{col 20}{res}{space 2} .0831271{col 32}{space 2} .0242328{col 43}{space 1}    3.43{col 52}{space 3}0.001{col 60}{space 4} .0356133{col 73}{space 3} .1306409
{txt}{space 15}32  {c |}{col 20}{res}{space 2} .0584165{col 32}{space 2} .0256138{col 43}{space 1}    2.28{col 52}{space 3}0.023{col 60}{space 4} .0081949{col 73}{space 3} .1086382
{txt}{space 15}34  {c |}{col 20}{res}{space 2}-.0829973{col 32}{space 2} .0260447{col 43}{space 1}   -3.19{col 52}{space 3}0.001{col 60}{space 4}-.1340638{col 73}{space 3}-.0319308
{txt}{space 15}37  {c |}{col 20}{res}{space 2} .1065562{col 32}{space 2} .0240618{col 43}{space 1}    4.43{col 52}{space 3}0.000{col 60}{space 4} .0593776{col 73}{space 3} .1537348
{txt}{space 15}41  {c |}{col 20}{res}{space 2} .0019264{col 32}{space 2}  .024815{col 43}{space 1}    0.08{col 52}{space 3}0.938{col 60}{space 4} -.046729{col 73}{space 3} .0505818
{txt}{space 18} {c |}
{space 14}year {c |}
{space 13}2012  {c |}{col 20}{res}{space 2}  .082779{col 32}{space 2} .0059453{col 43}{space 1}   13.92{col 52}{space 3}0.000{col 60}{space 4} .0711219{col 73}{space 3} .0944362
{txt}{space 13}2013  {c |}{col 20}{res}{space 2} .0218926{col 32}{space 2} .0132881{col 43}{space 1}    1.65{col 52}{space 3}0.100{col 60}{space 4}-.0041617{col 73}{space 3} .0479468
{txt}{space 13}2014  {c |}{col 20}{res}{space 2} .0659673{col 32}{space 2}  .007217{col 43}{space 1}    9.14{col 52}{space 3}0.000{col 60}{space 4} .0518168{col 73}{space 3} .0801179
{txt}{space 13}2015  {c |}{col 20}{res}{space 2}  .050019{col 32}{space 2} .0138446{col 43}{space 1}    3.61{col 52}{space 3}0.000{col 60}{space 4} .0228735{col 73}{space 3} .0771645
{txt}{space 18} {c |}
{space 13}_cons {c |}{col 20}{res}{space 2} 3.452099{col 32}{space 2} .4244593{col 43}{space 1}    8.13{col 52}{space 3}0.000{col 60}{space 4} 2.619852{col 73}{space 3} 4.284347
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. xtreg lnyield lnland land lnlabor lnfertile lnmachane lnot lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy i.year, re r
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}     9,713
{txt}Group variable: {res}id                              {txt}Number of groups  = {res}     3,123

{txt}R-sq:                                           Obs per group:
     within  = {res}0.0698                                         {txt}min = {res}         1
{txt}     between = {res}0.2626                                         {txt}avg = {res}       3.1
{txt}     overall = {res}0.1981                                         {txt}max = {res}         5

                                                {txt}Wald chi2({res}32{txt})     =  {res}  1659.51
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2       =     {res}0.0000

{txt}{ralign 84:(Std. Err. adjusted for {res:3,123} clusters in id)}
{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}           lnyield{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}lnland {c |}{col 20}{res}{space 2} .0650314{col 32}{space 2} .0071332{col 43}{space 1}    9.12{col 52}{space 3}0.000{col 60}{space 4} .0510506{col 73}{space 3} .0790121
{txt}{space 14}land {c |}{col 20}{res}{space 2}-.0076562{col 32}{space 2} .0013498{col 43}{space 1}   -5.67{col 52}{space 3}0.000{col 60}{space 4}-.0103018{col 73}{space 3}-.0050106
{txt}{space 11}lnlabor {c |}{col 20}{res}{space 2}-.0198861{col 32}{space 2} .0538208{col 43}{space 1}   -0.37{col 52}{space 3}0.712{col 60}{space 4}-.1253729{col 73}{space 3} .0856007
{txt}{space 9}lnfertile {c |}{col 20}{res}{space 2} -.088931{col 32}{space 2} .0751089{col 43}{space 1}   -1.18{col 52}{space 3}0.236{col 60}{space 4}-.2361417{col 73}{space 3} .0582797
{txt}{space 9}lnmachane {c |}{col 20}{res}{space 2} .0146293{col 32}{space 2} .0085886{col 43}{space 1}    1.70{col 52}{space 3}0.089{col 60}{space 4}-.0022041{col 73}{space 3} .0314627
{txt}{space 14}lnot {c |}{col 20}{res}{space 2} .5186346{col 32}{space 2}  .155131{col 43}{space 1}    3.34{col 52}{space 3}0.001{col 60}{space 4} .2145835{col 73}{space 3} .8226857
{txt}{space 10}lnlabor2 {c |}{col 20}{res}{space 2} .0059672{col 32}{space 2} .0039458{col 43}{space 1}    1.51{col 52}{space 3}0.130{col 60}{space 4}-.0017665{col 73}{space 3} .0137008
{txt}{space 8}lnfertile2 {c |}{col 20}{res}{space 2} .0034289{col 32}{space 2} .0055151{col 43}{space 1}    0.62{col 52}{space 3}0.534{col 60}{space 4}-.0073806{col 73}{space 3} .0142383
{txt}{space 8}lnmachane2 {c |}{col 20}{res}{space 2} .0037581{col 32}{space 2} .0003612{col 43}{space 1}   10.41{col 52}{space 3}0.000{col 60}{space 4} .0030502{col 73}{space 3}  .004466
{txt}{space 13}lnot2 {c |}{col 20}{res}{space 2}-.0625817{col 32}{space 2} .0169406{col 43}{space 1}   -3.69{col 52}{space 3}0.000{col 60}{space 4}-.0957847{col 73}{space 3}-.0293788
{txt}{space 2}lnlaborlnfertile {c |}{col 20}{res}{space 2}-.0050228{col 32}{space 2} .0088632{col 43}{space 1}   -0.57{col 52}{space 3}0.571{col 60}{space 4}-.0223943{col 73}{space 3} .0123487
{txt}{space 2}lnlaborlnmachane {c |}{col 20}{res}{space 2}-.0012224{col 32}{space 2} .0009794{col 43}{space 1}   -1.25{col 52}{space 3}0.212{col 60}{space 4} -.003142{col 73}{space 3} .0006971
{txt}{space 7}lnlaborlnot {c |}{col 20}{res}{space 2} .0037784{col 32}{space 2} .0099262{col 43}{space 1}    0.38{col 52}{space 3}0.703{col 60}{space 4}-.0156767{col 73}{space 3} .0232334
{txt}lnfertilelnmachane {c |}{col 20}{res}{space 2} .0000211{col 32}{space 2} .0011843{col 43}{space 1}    0.02{col 52}{space 3}0.986{col 60}{space 4}-.0023001{col 73}{space 3} .0023423
{txt}{space 5}lnfertilelnot {c |}{col 20}{res}{space 2} .0263044{col 32}{space 2} .0131981{col 43}{space 1}    1.99{col 52}{space 3}0.046{col 60}{space 4} .0004367{col 73}{space 3} .0521722
{txt}{space 5}lnmachanelnot {c |}{col 20}{res}{space 2} .0007159{col 32}{space 2}  .001691{col 43}{space 1}    0.42{col 52}{space 3}0.672{col 60}{space 4}-.0025983{col 73}{space 3} .0040301
{txt}{space 15}sex {c |}{col 20}{res}{space 2} .0064266{col 32}{space 2} .0108597{col 43}{space 1}    0.59{col 52}{space 3}0.554{col 60}{space 4} -.014858{col 73}{space 3} .0277113
{txt}{space 15}age {c |}{col 20}{res}{space 2} .0001085{col 32}{space 2} .0003215{col 43}{space 1}    0.34{col 52}{space 3}0.736{col 60}{space 4}-.0005216{col 73}{space 3} .0007387
{txt}{space 14}educ {c |}{col 20}{res}{space 2} .0014783{col 32}{space 2}  .001418{col 43}{space 1}    1.04{col 52}{space 3}0.297{col 60}{space 4} -.001301{col 73}{space 3} .0042575
{txt}{space 13}train {c |}{col 20}{res}{space 2}-.0255508{col 32}{space 2} .0104577{col 43}{space 1}   -2.44{col 52}{space 3}0.015{col 60}{space 4}-.0460475{col 73}{space 3} -.005054
{txt}{space 12}health {c |}{col 20}{res}{space 2} .0193328{col 32}{space 2} .0043319{col 43}{space 1}    4.46{col 52}{space 3}0.000{col 60}{space 4} .0108425{col 73}{space 3} .0278231
{txt}{space 12}status {c |}{col 20}{res}{space 2} .0255419{col 32}{space 2} .0057204{col 43}{space 1}    4.47{col 52}{space 3}0.000{col 60}{space 4} .0143301{col 73}{space 3} .0367538
{txt}{space 11}fstruct {c |}{col 20}{res}{space 2}-.0062159{col 32}{space 2} .0053949{col 43}{space 1}   -1.15{col 52}{space 3}0.249{col 60}{space 4}-.0167896{col 73}{space 3} .0043579
{txt}{space 13}plots {c |}{col 20}{res}{space 2} .0074098{col 32}{space 2} .0038315{col 43}{space 1}    1.93{col 52}{space 3}0.053{col 60}{space 4}-.0000997{col 73}{space 3} .0149193
{txt}{space 8}insurances {c |}{col 20}{res}{space 2}-.0307703{col 32}{space 2}  .007216{col 43}{space 1}   -4.26{col 52}{space 3}0.000{col 60}{space 4}-.0449134{col 73}{space 3}-.0166273
{txt}{space 14}loan {c |}{col 20}{res}{space 2}-.0339516{col 32}{space 2} .0090852{col 43}{space 1}   -3.74{col 52}{space 3}0.000{col 60}{space 4}-.0517582{col 73}{space 3} -.016145
{txt}{space 15}job {c |}{col 20}{res}{space 2}-.0283432{col 32}{space 2} .0106569{col 43}{space 1}   -2.66{col 52}{space 3}0.008{col 60}{space 4}-.0492304{col 73}{space 3} -.007456
{txt}{space 9}lnsubsidy {c |}{col 20}{res}{space 2} .0007095{col 32}{space 2} .0010593{col 43}{space 1}    0.67{col 52}{space 3}0.503{col 60}{space 4}-.0013667{col 73}{space 3} .0027857
{txt}{space 18} {c |}
{space 14}year {c |}
{space 13}2012  {c |}{col 20}{res}{space 2}  .084253{col 32}{space 2} .0055832{col 43}{space 1}   15.09{col 52}{space 3}0.000{col 60}{space 4} .0733102{col 73}{space 3} .0951959
{txt}{space 13}2013  {c |}{col 20}{res}{space 2} .0259209{col 32}{space 2} .0120734{col 43}{space 1}    2.15{col 52}{space 3}0.032{col 60}{space 4} .0022574{col 73}{space 3} .0495844
{txt}{space 13}2014  {c |}{col 20}{res}{space 2} .0654197{col 32}{space 2} .0068164{col 43}{space 1}    9.60{col 52}{space 3}0.000{col 60}{space 4} .0520598{col 73}{space 3} .0787796
{txt}{space 13}2015  {c |}{col 20}{res}{space 2} .0569322{col 32}{space 2}  .012292{col 43}{space 1}    4.63{col 52}{space 3}0.000{col 60}{space 4} .0328403{col 73}{space 3}  .081024
{txt}{space 18} {c |}
{space 13}_cons {c |}{col 20}{res}{space 2} 4.593048{col 32}{space 2} .3976729{col 43}{space 1}   11.55{col 52}{space 3}0.000{col 60}{space 4} 3.813624{col 73}{space 3} 5.372473
{txt}{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
           sigma_u {c |} {res} .15318752
           {txt}sigma_e {c |} {res} .17322131
               {txt}rho {c |} {res} .43885397{txt}   (fraction of variance due to u_i)
{hline 19}{c BT}{hline 64}

{com}. xtreg lnyield lnland land lnlabor lnfertile lnmachane lnot lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy i.year, fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     9,713
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     3,123

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0869{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.1475{col 63}{txt}avg{col 67}={col 69}{res}       3.1
{txt}     overall = {res}0.1241{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}32{txt},{res}3122{txt}){col 67}={col 70}{res}    20.56
{txt}corr(u_i, Xb){col 16}= {res}0.0854{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 84:(Std. Err. adjusted for {res:3,123} clusters in id)}
{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}           lnyield{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}lnland {c |}{col 20}{res}{space 2} .0285843{col 32}{space 2} .0142992{col 43}{space 1}    2.00{col 52}{space 3}0.046{col 60}{space 4} .0005476{col 73}{space 3}  .056621
{txt}{space 14}land {c |}{col 20}{res}{space 2}  .001416{col 32}{space 2} .0023106{col 43}{space 1}    0.61{col 52}{space 3}0.540{col 60}{space 4}-.0031144{col 73}{space 3} .0059465
{txt}{space 11}lnlabor {c |}{col 20}{res}{space 2}-.0818807{col 32}{space 2} .0706043{col 43}{space 1}   -1.16{col 52}{space 3}0.246{col 60}{space 4}-.2203162{col 73}{space 3} .0565549
{txt}{space 9}lnfertile {c |}{col 20}{res}{space 2} -.120342{col 32}{space 2} .0953878{col 43}{space 1}   -1.26{col 52}{space 3}0.207{col 60}{space 4}-.3073711{col 73}{space 3} .0666871
{txt}{space 9}lnmachane {c |}{col 20}{res}{space 2}   .02088{col 32}{space 2} .0097872{col 43}{space 1}    2.13{col 52}{space 3}0.033{col 60}{space 4} .0016901{col 73}{space 3} .0400699
{txt}{space 14}lnot {c |}{col 20}{res}{space 2} .1088949{col 32}{space 2}  .183492{col 43}{space 1}    0.59{col 52}{space 3}0.553{col 60}{space 4}-.2508823{col 73}{space 3} .4686721
{txt}{space 10}lnlabor2 {c |}{col 20}{res}{space 2} .0065054{col 32}{space 2}  .005419{col 43}{space 1}    1.20{col 52}{space 3}0.230{col 60}{space 4}-.0041199{col 73}{space 3} .0171306
{txt}{space 8}lnfertile2 {c |}{col 20}{res}{space 2} .0132386{col 32}{space 2} .0066329{col 43}{space 1}    2.00{col 52}{space 3}0.046{col 60}{space 4} .0002333{col 73}{space 3} .0262438
{txt}{space 8}lnmachane2 {c |}{col 20}{res}{space 2} .0024192{col 32}{space 2} .0004792{col 43}{space 1}    5.05{col 52}{space 3}0.000{col 60}{space 4} .0014796{col 73}{space 3} .0033587
{txt}{space 13}lnot2 {c |}{col 20}{res}{space 2}-.0233454{col 32}{space 2}  .020011{col 43}{space 1}   -1.17{col 52}{space 3}0.243{col 60}{space 4}-.0625814{col 73}{space 3} .0158906
{txt}{space 2}lnlaborlnfertile {c |}{col 20}{res}{space 2}-.0069005{col 32}{space 2} .0112075{col 43}{space 1}   -0.62{col 52}{space 3}0.538{col 60}{space 4}-.0288753{col 73}{space 3} .0150744
{txt}{space 2}lnlaborlnmachane {c |}{col 20}{res}{space 2} .0021798{col 32}{space 2} .0012675{col 43}{space 1}    1.72{col 52}{space 3}0.086{col 60}{space 4}-.0003054{col 73}{space 3}  .004665
{txt}{space 7}lnlaborlnot {c |}{col 20}{res}{space 2} .0174727{col 32}{space 2} .0118815{col 43}{space 1}    1.47{col 52}{space 3}0.142{col 60}{space 4}-.0058236{col 73}{space 3}  .040769
{txt}lnfertilelnmachane {c |}{col 20}{res}{space 2} .0005936{col 32}{space 2} .0013507{col 43}{space 1}    0.44{col 52}{space 3}0.660{col 60}{space 4}-.0020549{col 73}{space 3}  .003242
{txt}{space 5}lnfertilelnot {c |}{col 20}{res}{space 2} .0189256{col 32}{space 2} .0160046{col 43}{space 1}    1.18{col 52}{space 3}0.237{col 60}{space 4}-.0124551{col 73}{space 3} .0503063
{txt}{space 5}lnmachanelnot {c |}{col 20}{res}{space 2}-.0043193{col 32}{space 2} .0020088{col 43}{space 1}   -2.15{col 52}{space 3}0.032{col 60}{space 4}-.0082581{col 73}{space 3}-.0003806
{txt}{space 15}sex {c |}{col 20}{res}{space 2} .0177555{col 32}{space 2} .0122733{col 43}{space 1}    1.45{col 52}{space 3}0.148{col 60}{space 4} -.006309{col 73}{space 3} .0418201
{txt}{space 15}age {c |}{col 20}{res}{space 2}-.0003392{col 32}{space 2} .0004076{col 43}{space 1}   -0.83{col 52}{space 3}0.405{col 60}{space 4}-.0011384{col 73}{space 3} .0004599
{txt}{space 14}educ {c |}{col 20}{res}{space 2}-.0020402{col 32}{space 2} .0018207{col 43}{space 1}   -1.12{col 52}{space 3}0.263{col 60}{space 4}-.0056101{col 73}{space 3} .0015296
{txt}{space 13}train {c |}{col 20}{res}{space 2}-.0299652{col 32}{space 2} .0121968{col 43}{space 1}   -2.46{col 52}{space 3}0.014{col 60}{space 4}-.0538797{col 73}{space 3}-.0060507
{txt}{space 12}health {c |}{col 20}{res}{space 2} .0136775{col 32}{space 2}  .005212{col 43}{space 1}    2.62{col 52}{space 3}0.009{col 60}{space 4} .0034581{col 73}{space 3} .0238968
{txt}{space 12}status {c |}{col 20}{res}{space 2} .0140773{col 32}{space 2} .0066847{col 43}{space 1}    2.11{col 52}{space 3}0.035{col 60}{space 4} .0009705{col 73}{space 3} .0271841
{txt}{space 11}fstruct {c |}{col 20}{res}{space 2}-.0086068{col 32}{space 2} .0058343{col 43}{space 1}   -1.48{col 52}{space 3}0.140{col 60}{space 4}-.0200463{col 73}{space 3} .0028328
{txt}{space 13}plots {c |}{col 20}{res}{space 2}-.0087226{col 32}{space 2} .0022175{col 43}{space 1}   -3.93{col 52}{space 3}0.000{col 60}{space 4}-.0130705{col 73}{space 3}-.0043748
{txt}{space 8}insurances {c |}{col 20}{res}{space 2}-.0072028{col 32}{space 2}  .009093{col 43}{space 1}   -0.79{col 52}{space 3}0.428{col 60}{space 4}-.0250317{col 73}{space 3} .0106261
{txt}{space 14}loan {c |}{col 20}{res}{space 2}-.0345516{col 32}{space 2} .0106264{col 43}{space 1}   -3.25{col 52}{space 3}0.001{col 60}{space 4}-.0553871{col 73}{space 3}-.0137161
{txt}{space 15}job {c |}{col 20}{res}{space 2}-.0406305{col 32}{space 2} .0157017{col 43}{space 1}   -2.59{col 52}{space 3}0.010{col 60}{space 4}-.0714172{col 73}{space 3}-.0098439
{txt}{space 9}lnsubsidy {c |}{col 20}{res}{space 2} -.000561{col 32}{space 2} .0012895{col 43}{space 1}   -0.44{col 52}{space 3}0.664{col 60}{space 4}-.0030894{col 73}{space 3} .0019674
{txt}{space 18} {c |}
{space 14}year {c |}
{space 13}2012  {c |}{col 20}{res}{space 2} .0861416{col 32}{space 2} .0058543{col 43}{space 1}   14.71{col 52}{space 3}0.000{col 60}{space 4} .0746629{col 73}{space 3} .0976203
{txt}{space 13}2013  {c |}{col 20}{res}{space 2} .0309772{col 32}{space 2} .0131593{col 43}{space 1}    2.35{col 52}{space 3}0.019{col 60}{space 4} .0051754{col 73}{space 3}  .056779
{txt}{space 13}2014  {c |}{col 20}{res}{space 2} .0728031{col 32}{space 2} .0074343{col 43}{space 1}    9.79{col 52}{space 3}0.000{col 60}{space 4} .0582264{col 73}{space 3} .0873798
{txt}{space 13}2015  {c |}{col 20}{res}{space 2} .0755622{col 32}{space 2} .0133304{col 43}{space 1}    5.67{col 52}{space 3}0.000{col 60}{space 4} .0494249{col 73}{space 3} .1016995
{txt}{space 18} {c |}
{space 13}_cons {c |}{col 20}{res}{space 2} 5.881122{col 32}{space 2} .4933515{col 43}{space 1}   11.92{col 52}{space 3}0.000{col 60}{space 4} 4.913796{col 73}{space 3} 6.848448
{txt}{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
           sigma_u {c |} {res} .21142671
           {txt}sigma_e {c |} {res} .17322131
               {txt}rho {c |} {res} .59835528{txt}   (fraction of variance due to u_i)
{hline 19}{c BT}{hline 64}

{com}. 
. 
. **二次项和交叉项联合检验
. tab year, gen(y)

       {txt}year {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       2011 {c |}{res}      1,861       19.16       19.16
{txt}       2012 {c |}{res}      2,164       22.28       41.44
{txt}       2013 {c |}{res}      2,150       22.14       63.57
{txt}       2014 {c |}{res}      1,952       20.10       83.67
{txt}       2015 {c |}{res}      1,586       16.33      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      9,713      100.00
{txt}
{com}. xtreg lnyield lnland land lnlabor lnfertile lnmachane lnot lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy y2-y5, fe vce(cluster id)
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     9,713
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     3,123

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0869{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.1475{col 63}{txt}avg{col 67}={col 69}{res}       3.1
{txt}     overall = {res}0.1241{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}32{txt},{res}3122{txt}){col 67}={col 70}{res}    20.56
{txt}corr(u_i, Xb){col 16}= {res}0.0854{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 84:(Std. Err. adjusted for {res:3,123} clusters in id)}
{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}           lnyield{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}lnland {c |}{col 20}{res}{space 2} .0285843{col 32}{space 2} .0142992{col 43}{space 1}    2.00{col 52}{space 3}0.046{col 60}{space 4} .0005476{col 73}{space 3}  .056621
{txt}{space 14}land {c |}{col 20}{res}{space 2}  .001416{col 32}{space 2} .0023106{col 43}{space 1}    0.61{col 52}{space 3}0.540{col 60}{space 4}-.0031144{col 73}{space 3} .0059465
{txt}{space 11}lnlabor {c |}{col 20}{res}{space 2}-.0818807{col 32}{space 2} .0706043{col 43}{space 1}   -1.16{col 52}{space 3}0.246{col 60}{space 4}-.2203162{col 73}{space 3} .0565549
{txt}{space 9}lnfertile {c |}{col 20}{res}{space 2} -.120342{col 32}{space 2} .0953878{col 43}{space 1}   -1.26{col 52}{space 3}0.207{col 60}{space 4}-.3073711{col 73}{space 3} .0666871
{txt}{space 9}lnmachane {c |}{col 20}{res}{space 2}   .02088{col 32}{space 2} .0097872{col 43}{space 1}    2.13{col 52}{space 3}0.033{col 60}{space 4} .0016901{col 73}{space 3} .0400699
{txt}{space 14}lnot {c |}{col 20}{res}{space 2} .1088949{col 32}{space 2}  .183492{col 43}{space 1}    0.59{col 52}{space 3}0.553{col 60}{space 4}-.2508823{col 73}{space 3} .4686721
{txt}{space 10}lnlabor2 {c |}{col 20}{res}{space 2} .0065054{col 32}{space 2}  .005419{col 43}{space 1}    1.20{col 52}{space 3}0.230{col 60}{space 4}-.0041199{col 73}{space 3} .0171306
{txt}{space 8}lnfertile2 {c |}{col 20}{res}{space 2} .0132386{col 32}{space 2} .0066329{col 43}{space 1}    2.00{col 52}{space 3}0.046{col 60}{space 4} .0002333{col 73}{space 3} .0262438
{txt}{space 8}lnmachane2 {c |}{col 20}{res}{space 2} .0024192{col 32}{space 2} .0004792{col 43}{space 1}    5.05{col 52}{space 3}0.000{col 60}{space 4} .0014796{col 73}{space 3} .0033587
{txt}{space 13}lnot2 {c |}{col 20}{res}{space 2}-.0233454{col 32}{space 2}  .020011{col 43}{space 1}   -1.17{col 52}{space 3}0.243{col 60}{space 4}-.0625814{col 73}{space 3} .0158906
{txt}{space 2}lnlaborlnfertile {c |}{col 20}{res}{space 2}-.0069005{col 32}{space 2} .0112075{col 43}{space 1}   -0.62{col 52}{space 3}0.538{col 60}{space 4}-.0288753{col 73}{space 3} .0150744
{txt}{space 2}lnlaborlnmachane {c |}{col 20}{res}{space 2} .0021798{col 32}{space 2} .0012675{col 43}{space 1}    1.72{col 52}{space 3}0.086{col 60}{space 4}-.0003054{col 73}{space 3}  .004665
{txt}{space 7}lnlaborlnot {c |}{col 20}{res}{space 2} .0174727{col 32}{space 2} .0118815{col 43}{space 1}    1.47{col 52}{space 3}0.142{col 60}{space 4}-.0058236{col 73}{space 3}  .040769
{txt}lnfertilelnmachane {c |}{col 20}{res}{space 2} .0005936{col 32}{space 2} .0013507{col 43}{space 1}    0.44{col 52}{space 3}0.660{col 60}{space 4}-.0020549{col 73}{space 3}  .003242
{txt}{space 5}lnfertilelnot {c |}{col 20}{res}{space 2} .0189256{col 32}{space 2} .0160046{col 43}{space 1}    1.18{col 52}{space 3}0.237{col 60}{space 4}-.0124551{col 73}{space 3} .0503063
{txt}{space 5}lnmachanelnot {c |}{col 20}{res}{space 2}-.0043193{col 32}{space 2} .0020088{col 43}{space 1}   -2.15{col 52}{space 3}0.032{col 60}{space 4}-.0082581{col 73}{space 3}-.0003806
{txt}{space 15}sex {c |}{col 20}{res}{space 2} .0177555{col 32}{space 2} .0122733{col 43}{space 1}    1.45{col 52}{space 3}0.148{col 60}{space 4} -.006309{col 73}{space 3} .0418201
{txt}{space 15}age {c |}{col 20}{res}{space 2}-.0003392{col 32}{space 2} .0004076{col 43}{space 1}   -0.83{col 52}{space 3}0.405{col 60}{space 4}-.0011384{col 73}{space 3} .0004599
{txt}{space 14}educ {c |}{col 20}{res}{space 2}-.0020402{col 32}{space 2} .0018207{col 43}{space 1}   -1.12{col 52}{space 3}0.263{col 60}{space 4}-.0056101{col 73}{space 3} .0015296
{txt}{space 13}train {c |}{col 20}{res}{space 2}-.0299652{col 32}{space 2} .0121968{col 43}{space 1}   -2.46{col 52}{space 3}0.014{col 60}{space 4}-.0538797{col 73}{space 3}-.0060507
{txt}{space 12}health {c |}{col 20}{res}{space 2} .0136775{col 32}{space 2}  .005212{col 43}{space 1}    2.62{col 52}{space 3}0.009{col 60}{space 4} .0034581{col 73}{space 3} .0238968
{txt}{space 12}status {c |}{col 20}{res}{space 2} .0140773{col 32}{space 2} .0066847{col 43}{space 1}    2.11{col 52}{space 3}0.035{col 60}{space 4} .0009705{col 73}{space 3} .0271841
{txt}{space 11}fstruct {c |}{col 20}{res}{space 2}-.0086068{col 32}{space 2} .0058343{col 43}{space 1}   -1.48{col 52}{space 3}0.140{col 60}{space 4}-.0200463{col 73}{space 3} .0028328
{txt}{space 13}plots {c |}{col 20}{res}{space 2}-.0087226{col 32}{space 2} .0022175{col 43}{space 1}   -3.93{col 52}{space 3}0.000{col 60}{space 4}-.0130705{col 73}{space 3}-.0043748
{txt}{space 8}insurances {c |}{col 20}{res}{space 2}-.0072028{col 32}{space 2}  .009093{col 43}{space 1}   -0.79{col 52}{space 3}0.428{col 60}{space 4}-.0250317{col 73}{space 3} .0106261
{txt}{space 14}loan {c |}{col 20}{res}{space 2}-.0345516{col 32}{space 2} .0106264{col 43}{space 1}   -3.25{col 52}{space 3}0.001{col 60}{space 4}-.0553871{col 73}{space 3}-.0137161
{txt}{space 15}job {c |}{col 20}{res}{space 2}-.0406305{col 32}{space 2} .0157017{col 43}{space 1}   -2.59{col 52}{space 3}0.010{col 60}{space 4}-.0714172{col 73}{space 3}-.0098439
{txt}{space 9}lnsubsidy {c |}{col 20}{res}{space 2} -.000561{col 32}{space 2} .0012895{col 43}{space 1}   -0.44{col 52}{space 3}0.664{col 60}{space 4}-.0030894{col 73}{space 3} .0019674
{txt}{space 16}y2 {c |}{col 20}{res}{space 2} .0861416{col 32}{space 2} .0058543{col 43}{space 1}   14.71{col 52}{space 3}0.000{col 60}{space 4} .0746629{col 73}{space 3} .0976203
{txt}{space 16}y3 {c |}{col 20}{res}{space 2} .0309772{col 32}{space 2} .0131593{col 43}{space 1}    2.35{col 52}{space 3}0.019{col 60}{space 4} .0051754{col 73}{space 3}  .056779
{txt}{space 16}y4 {c |}{col 20}{res}{space 2} .0728031{col 32}{space 2} .0074343{col 43}{space 1}    9.79{col 52}{space 3}0.000{col 60}{space 4} .0582264{col 73}{space 3} .0873798
{txt}{space 16}y5 {c |}{col 20}{res}{space 2} .0755622{col 32}{space 2} .0133304{col 43}{space 1}    5.67{col 52}{space 3}0.000{col 60}{space 4} .0494249{col 73}{space 3} .1016995
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 5.881122{col 32}{space 2} .4933515{col 43}{space 1}   11.92{col 52}{space 3}0.000{col 60}{space 4} 4.913796{col 73}{space 3} 6.848448
{txt}{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
           sigma_u {c |} {res} .21142671
           {txt}sigma_e {c |} {res} .17322131
               {txt}rho {c |} {res} .59835528{txt}   (fraction of variance due to u_i)
{hline 19}{c BT}{hline 64}

{com}. test lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot

{p 0 7}{space 1}{text:( 1)}{space 1} {res}lnlabor2 = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} lnfertile2 = 0{p_end}
{p 0 7}{space 1}{text:( 3)}{space 1} lnmachane2 = 0{p_end}
{p 0 7}{space 1}{text:( 4)}{space 1} lnot2 = 0{p_end}
{p 0 7}{space 1}{text:( 5)}{space 1} lnlaborlnfertile = 0{p_end}
{p 0 7}{space 1}{text:( 6)}{space 1} lnlaborlnmachane = 0{p_end}
{p 0 7}{space 1}{text:( 7)}{space 1} lnlaborlnot = 0{p_end}
{p 0 7}{space 1}{text:( 8)}{space 1} lnfertilelnmachane = 0{p_end}
{p 0 7}{space 1}{text:( 9)}{space 1} lnfertilelnot = 0{p_end}
{p 0 7}{space 1}{text:(10)}{space 1} lnmachanelnot = 0{p_end}

{txt}       F( 10,  3122) ={res}    4.34
{txt}{col 13}Prob > F ={res}    0.0000
{txt}
{com}. test y2 y3 y4 y5

{p 0 7}{space 1}{text:( 1)}{space 1} {res}y2 = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} y3 = 0{p_end}
{p 0 7}{space 1}{text:( 3)}{space 1} y4 = 0{p_end}
{p 0 7}{space 1}{text:( 4)}{space 1} y5 = 0{p_end}

{txt}       F(  4,  3122) ={res}   59.30
{txt}{col 13}Prob > F ={res}    0.0000
{txt}
{com}. 
. 
{txt}end of do-file

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. log off
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}D:\曾翠红\Stata14\新建文件夹 - 副本 (2)\新建文件夹\double玉米log.smcl
  {txt}log type:  {res}smcl
 {txt}paused on:  {res}22 Feb 2019, 15:01:03
{txt}{.-}
{smcl}
{txt}{sf}{ul off}