{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}D:\曾翠红\Stata14\新建文件夹 - 副本 (2)\新建文件夹\single玉米log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}22 Feb 2019, 14:59:43

{com}. do "D:\曾翠红\Stata14\新建文件夹 - 副本 (2)\新建文件夹\single玉米.do"
{txt}
{com}. **以土地单产为土地生产率
. 
. use "D:\曾翠红\Stata14\新建文件夹 - 副本 (2)\新建文件夹\allnet.dta", clear
{txt}
{com}. keep if sm==13|sm==14|sm==15|sm==21|sm==22|sm==23|sm==61|sm==62|sm==64|sm==65
{txt}(62,519 observations deleted)

{com}. 
. 
. **包含的变量有（yield、income、profit、land、cland、labor、flabor、elabor、resident、machine、other、subsidy、insurance、plots、fstruct、job、concurrent、sex、age、educ、train、health、status）
. 
. **选取变量(删除收获面积、年末耕地面积、家庭常住人口、家庭全年总收入为0的农户数据，并将部分变量+0.001）
. drop if cland==0  //
{txt}(323 observations deleted)

{com}. drop if cland==.
{txt}(13,676 observations deleted)

{com}. drop if cyields==.
{txt}(29 observations deleted)

{com}. g yield = cyields/cland
{txt}
{com}. winsor yield, g (yieldo) p(0.05)
{txt}
{com}. sum yieldo

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}yieldo {c |}{res}     22,765    554.5234    187.5074        200        900
{txt}
{com}. drop if yield>900
{txt}(911 observations deleted)

{com}. drop if yield<200
{txt}(874 observations deleted)

{com}. 
. g land = cland      
{txt}
{com}. g labors= clabors   
{txt}(2,380 missing values generated)

{com}. g elabors= celabors     
{txt}(18,333 missing values generated)

{com}. g e1=ce1 
{txt}(120 missing values generated)

{com}. g e2=ce2 
{txt}(16,606 missing values generated)

{com}. g e3=ce3 
{txt}(189 missing values generated)

{com}. g e4=ce4 
{txt}(17,483 missing values generated)

{com}. g e5=ce5 
{txt}(5,511 missing values generated)

{com}. g e6=ce6 
{txt}(14,697 missing values generated)

{com}. g e7=ce7 
{txt}(15,969 missing values generated)

{com}. g e8=ce8 
{txt}(4,746 missing values generated)

{com}. g e9=ce9
{txt}(15,938 missing values generated)

{com}. g e10=ce10
{txt}(17,277 missing values generated)

{com}. g e11=ce11 
{txt}(17,929 missing values generated)

{com}. g e12=ce12   //
{txt}(15,373 missing values generated)

{com}. ren age agee
{res}{txt}
{com}. //winsor land,gen (land1) p(0.025)
. //sum land1
. //sum land
. 
. //drop if elando ==.
. //drop if elando ==0
. drop if labors ==0
{txt}(12 observations deleted)

{com}. drop if labors==.
{txt}(2,380 observations deleted)

{com}. drop if quantitys ==.
{txt}(729 observations deleted)

{com}. //drop if resident ==.
. //drop if resident ==0
. 
. replace eland=0 if eland==.
{txt}(22 real changes made)

{com}. replace elabors=0 if elabors==.
{txt}(15,319 real changes made)

{com}. replace e1=0 if e1==.
{txt}(46 real changes made)

{com}. replace e2=0 if e2==.
{txt}(13,901 real changes made)

{com}. replace e3=0 if e3==.
{txt}(136 real changes made)

{com}. replace e4=0 if e4==.
{txt}(14,917 real changes made)

{com}. replace e5=0 if e5==.
{txt}(4,272 real changes made)

{com}. replace e6=0 if e6==.
{txt}(12,711 real changes made)

{com}. replace e7=0 if e7==.
{txt}(13,250 real changes made)

{com}. replace e8=0 if e8==.
{txt}(3,805 real changes made)

{com}. replace e9=0 if e9==.
{txt}(13,370 real changes made)

{com}. replace e10=0 if e10==.
{txt}(14,446 real changes made)

{com}. replace e11=0 if e11==.
{txt}(15,011 real changes made)

{com}. replace e12=0 if e12==.
{txt}(12,844 real changes made)

{com}. 
. replace s1=0 if s1==.
{txt}(933 real changes made)

{com}. replace s2=0 if s2==.
{txt}(4,956 real changes made)

{com}. replace s3=0 if s3==.
{txt}(9,963 real changes made)

{com}. replace s4=0 if s4==.
{txt}(16,817 real changes made)

{com}. g subsidys = s1+s2+s3+s4
{txt}
{com}. 
. replace sex=0 if sex!=1
{txt}(7,602 real changes made)

{com}. 
. g health = train3
{txt}(6,632 missing values generated)

{com}. replace health=4 if health==0
{txt}(0 real changes made)

{com}. replace health=4 if health==.
{txt}(6,632 real changes made)

{com}. replace health=4 if health>5
{txt}(0 real changes made)

{com}. replace health=10 if health==1
{txt}(6,364 real changes made)

{com}. replace health=9 if health==2
{txt}(3,157 real changes made)

{com}. replace health=7 if health==2
{txt}(0 real changes made)

{com}. replace health=6 if health==5
{txt}(92 real changes made)

{com}. replace health=5 if health==10
{txt}(6,364 real changes made)

{com}. replace health=4 if health==9
{txt}(3,157 real changes made)

{com}. replace health=2 if health==7
{txt}(0 real changes made)

{com}. replace health=1 if health==6
{txt}(92 real changes made)

{com}. 
. replace resident=0 if resident==.
{txt}(8 real changes made)

{com}. 
. replace familylabor=0 if familylabor==.
{txt}(425 real changes made)

{com}. 
. replace status1=0 if status1!=1
{txt}(17,246 real changes made)

{com}. replace status2=0 if status2!=1
{txt}(17,143 real changes made)

{com}. replace status3=0 if status3!=1
{txt}(15,332 real changes made)

{com}. g status = status1+status2+status3
{txt}
{com}. replace status=1 if status!=0
{txt}(656 real changes made)

{com}. 
. replace train1=0 if train1!=1
{txt}(17,247 real changes made)

{com}. replace train2=0 if train2!=1
{txt}(16,539 real changes made)

{com}. g train = train1+train2
{txt}
{com}. replace train=1 if train!=0
{txt}(516 real changes made)

{com}. 
. replace insurances=0 if insurances==.
{txt}(13,776 real changes made)

{com}. replace insurances=1 if insurances!=0
{txt}(3,286 real changes made)

{com}. 
. replace loan1=1 if loan1>0
{txt}(17,141 real changes made)

{com}. replace loan1=0 if loan1!=1
{txt}(0 real changes made)

{com}. replace loan2=1 if loan1>0
{txt}(17,141 real changes made)

{com}. replace loan2=0 if loan2!=1
{txt}(7 real changes made)

{com}. g loan=loan1+loan2
{txt}
{com}. replace loan=1 if loan!=0
{txt}(17,141 real changes made)

{com}. 
. egen avg_agriincome = mean(agriincome)
{txt}
{com}. replace agriincome=avg_agriincome if agriincome==.
{txt}(1,107 real changes made)

{com}. egen avg_allincome = mean(allincome)
{txt}
{com}. replace allincome=avg_allincome if allincome==.
{txt}(14 real changes made)

{com}. egen avg_age = mean(agee)
{txt}
{com}. replace agee=avg_age if agee==.
{txt}(6,620 real changes made)

{com}. egen avg_educ = mean(educ)
{txt}
{com}. replace educ=avg_educ if educ==.
{txt}(6,772 real changes made)

{com}. 
. 
. g machanes = e8+e9+e10
{txt}
{com}. g fertiles = e2+e3
{txt}
{com}. g ots = e1+e4+e5+e6+e7+e12
{txt}
{com}. g flabors = labors-elabors
{txt}
{com}. 
. 
. 
. //tostring id, replace 
. //gen sm=substr(id,1,2)
. //egen yearsm = concat(year sm)
. //g wage0 = elaborpay/elabors
. //bysort yearsm:egen wageo=mean(wage0)
. //bysort yearsm:egen quantitye = mean(quantity)
. 
. winsor quantitys, gen (quantity) p(0.01)
{txt}
{com}. winsor agriincomes, gen (agriincome) p(0.001)
{txt}
{com}. winsor allincomes, gen (allincome) p(0.001)
{txt}
{com}. winsor agee, gen (age) p(0.01)
{txt}
{com}. 
. g laboro = labors/land
{txt}
{com}. winsor laboro, g (labor) p(0.01)   
{txt}
{com}. g elabor0 = elabors/land
{txt}
{com}. winsor elabor0, gen (elaboro) p(0.001) 
{txt}
{com}. g flaboro = labor - elaboro
{txt}
{com}. 
. g fertile0 = fertiles/land
{txt}
{com}. g machane0 = machanes/land
{txt}
{com}. g ot0 = ots/land
{txt}
{com}. g subsidy0 = subsidys/eland
{txt}(26 missing values generated)

{com}. winsor fertile0, gen (fertileo) p(0.01)
{txt}
{com}. winsor machane0, gen (machaneo) p(0.01)
{txt}
{com}. winsor ot0, gen (oto) p(0.1)
{txt}
{com}. winsor subsidy0, gen (subsidyo) p(0.01)
{txt}
{com}. 
. g plots = eland/quantity
{txt}
{com}. egen ave_plots = mean(plots)
{txt}
{com}. replace plots=ave_plots if plots==.
{txt}(0 real changes made)

{com}. 
. egen avg_sub = mean(subsidyo)
{txt}
{com}. replace subsidyo=avg_sub if subsidyo==.
{txt}(26 real changes made)

{com}. 
. g job = 1-agriincome/allincome
{txt}
{com}. replace job=0 if job<0
{txt}(641 real changes made)

{com}. egen avg_job = mean(job)
{txt}
{com}. replace job=avg_job if job==.
{txt}(0 real changes made)

{com}. 
. 
. g flabor = flaboro+0.001
{txt}
{com}. g elabor = elaboro+0.001    
{txt}
{com}. g fertile = fertileo+0.001
{txt}
{com}. g machane = machaneo+0.001
{txt}
{com}. g ot = oto+0.001
{txt}
{com}. g subsidy = subsidyo+0.001
{txt}
{com}. 
. 
. g fstructs = familylabor/resident
{txt}(16 missing values generated)

{com}. egen avg_fstruct = mean(fstructs)
{txt}
{com}. replace fstructs=avg_fstruct if fstruct==.
{txt}(16 real changes made)

{com}. winsor fstructs, gen (fstruct) p(0.01)
{txt}
{com}. 
. g caland = land 
{txt}
{com}. replace caland = 1 if land>=0&land<10
{txt}(10,988 real changes made)

{com}. replace caland = 2 if land>=10&land<50
{txt}(5,497 real changes made)

{com}. replace caland = 3 if land>=50
{txt}(765 real changes made)

{com}. 
. tabstat yield land labor flabor elabor fertile machane ot subsidy insurance loan plots fstruct job sex age educ train health status, statistics(mean ma mi q sk k sd n) 

{txt}   stats {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s      loan     plots   fstruct       job       sex       age
{hline 9}{c +}{hline 160}
{ralign 8:mean} {...}
{c |}{...}
 {res} 562.9005  12.04823  10.99042  10.87309   .119336  159.3768  67.42848  104.9037  80.60202  .1839969  .9597962  3.677559  .7439561  .5569459  .5743323  52.44047
{txt}{ralign 8:max} {...}
{c |}{...}
 {res}      900     241.8  57.14286  57.14386    14.001   400.001  281.8192   194.401   330.001         1         1        90         2         1         1        74
{txt}{ralign 8:min} {...}
{c |}{...}
 {res}      200        .1       .65      .001      .001    37.501      .001  48.88989      .001         0         0         0         0         0         0        30
{txt}{ralign 8:p25} {...}
{c |}{...}
 {res} 450.1018         3  4.210526  4.118647      .001   107.501  21.62262    65.001    51.001         0         1      1.36        .5  .2888244         0        50
{txt}{ralign 8:p50} {...}
{c |}{...}
 {res}      550       6.1  8.333334  8.334333      .001   150.001    55.001    90.001  72.02631         0         1  2.427778  .6666667  .6063218         1  52.46259
{txt}{ralign 8:p75} {...}
{c |}{...}
 {res}      700        13  14.87179    14.626      .001  195.4727   100.001  139.6677   100.001         0         1      4.25         1  .8360302         1        56
{txt}{ralign 8:skewness} {...}
{c |}{...}
 {res} -.047449  3.411073  2.124025  2.114693   13.1006  .9436195  1.148323  .6435823   1.87034  1.631061 -4.681362  4.085797   .916672 -.3248819 -.3006702 -.0966776
{txt}{ralign 8:kurtosis} {...}
{c |}{...}
 {res} 2.380518   19.3459  8.848446    8.7934   222.302  4.035071   4.23691  2.134584  9.545493  3.660361  22.91515  38.57624  5.505428  1.796404  1.090403  3.814584
{txt}{ralign 8:sd} {...}
{c |}{...}
 {res} 165.8127  16.58741  9.924317  9.952616  .7062047  71.59058  60.24885  47.80992  50.08042  .3874925  .1964424  4.167931  .3580124  .3065268  .4944577  8.193926
{txt}{ralign 8:N} {...}
{c |}{...}
 {res}    17859     17859     17859     17859     17859     17859     17859     17859     17859     17859     17859     17859     17859     17859     17859     17859
{txt}{hline 9}{c BT}{hline 160}

   stats {...}
{c |}{...}
      educ     train    health    status
{hline 9}{c +}{hline 40}
{ralign 8:mean} {...}
{c |}{...}
 {res} 7.157752  .0792878  4.278291  .1767176
{txt}{ralign 8:max} {...}
{c |}{...}
 {res}       16         1         5         1
{txt}{ralign 8:min} {...}
{c |}{...}
 {res}        0         0         1         0
{txt}{ralign 8:p25} {...}
{c |}{...}
 {res}        6         0         4         0
{txt}{ralign 8:p50} {...}
{c |}{...}
 {res} 7.157753         0         4         0
{txt}{ralign 8:p75} {...}
{c |}{...}
 {res}        8         0         5         0
{txt}{ralign 8:skewness} {...}
{c |}{...}
 {res}-.4087087  3.114226 -.7895204  1.695109
{txt}{ralign 8:kurtosis} {...}
{c |}{...}
 {res} 5.603368   10.6984   5.73176  3.873395
{txt}{ralign 8:sd} {...}
{c |}{...}
 {res}    1.816  .2701949  .6228061  .3814402
{txt}{ralign 8:N} {...}
{c |}{...}
 {res}    17859     17859     17859     17859
{txt}{hline 9}{c BT}{hline 40}

{com}. 
. 
. **删除面板重复值
. duplicates drop id year,force

{p 0 4}{txt}Duplicates in terms of {res} id year{p_end}

{txt}(0 observations are duplicates)

{com}. xtset id year
{res}{txt}{col 8}panel variable:  {res}id (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 2011 to 2015, but with gaps
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. 
. **分类均值、最大值、最小值、25%、50%、75%、偏度、峰度、标准差分析
. tabstat yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status, by(caland) statistics(mean ma mi q sk k sd n) 

{txt}Summary statistics: mean, max, min, p25, p50, p75, skewness, kurtosis, sd, N
  by categories of: caland 

{ralign 8:caland} {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s     plots   fstruct       job       sex       age      educ
{hline 9}{c +}{hline 160}
{ralign 8:1} {...}
{c |}{...}
 {res} 537.9482  4.291929  13.78706  13.66257  .1264916  158.5526  64.61015  108.6352  84.25358  .1260671  2.092905  .7387304  .6498217   .571096  53.20006  7.123024
{txt}{space 8} {...}
{c |}{...}
 {res}      900       9.9  57.14286  57.14386    14.001   400.001  281.8192   194.401   330.001         1        69         2         1         1        74        15
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1       .65      .001      .001    37.501      .001  48.88989      .001         0         0         0         0         0        30         0
{txt}{space 8} {...}
{c |}{...}
 {res}      400       2.2   6.31579  6.134333      .001  102.2232    12.501    66.001  55.77023         0         1        .5  .4590599         0        51         6
{txt}{space 8} {...}
{c |}{...}
 {res}      500         4        10    10.001      .001   148.001    50.001    97.001    75.501         0  1.733333  .6666667  .7465761         1  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res} 666.6666         6     18.25  18.18282      .001  197.3343   100.001   147.001  102.3694         0       2.6         1  .8889675         1        57         8
{txt}{space 8} {...}
{c |}{...}
 {res}  .109102  .3507697  1.853771  1.839183  12.32704  .9896788  1.217256  .4998718   1.98579  2.253117  7.781442  .7980411 -.8186592 -.2873032 -.0154724 -.4703083
{txt}{space 8} {...}
{c |}{...}
 {res} 2.351049  2.145424  7.104232  7.041183  190.6695  3.927485  4.357634  1.934014  9.551183  6.076537  213.9713  5.227569  2.493516  1.082543  3.703388  5.257853
{txt}{space 8} {...}
{c |}{...}
 {res} 170.2064  2.432339  10.76442  10.80618  .7902053  76.63454  62.94498  49.16261  53.27978  .3319393  1.754136  .3664343  .2897801  .4949409  8.393836  1.916199
{txt}{space 8} {...}
{c |}{...}
 {res}    11597     11597     11597     11597     11597     11597     11597     11597     11597     11597     11597     11597     11597     11597     11597     11597
{txt}{hline 9}{c +}{hline 160}
{ralign 8:2} {...}
{c |}{...}
 {res} 612.1692  19.88083  6.239442  6.134029  .1074138  164.3685  73.19915   99.0251  77.35948  .2892487  5.530876  .7550435  .4135627  .5883209  51.30534  7.223474
{txt}{space 8} {...}
{c |}{...}
 {res}      900      49.9  57.14286  57.14386    14.001   400.001  281.8192   194.401   330.001         1        45         2  .9943184         1        74        15
{txt}{space 8} {...}
{c |}{...}
 {res}      200        10       .65      .001      .001    37.501      .001  48.88989      .001         0         0         0         0         0        30         0
{txt}{space 8} {...}
{c |}{...}
 {res}      500        12       2.5     2.401      .001   121.251  31.69331    64.001  48.04787         0         3        .5  .1935278         0        48         7
{txt}{space 8} {...}
{c |}{...}
 {res}      600        16         5     5.001      .001   160.001    60.001  82.85814  69.93433         0      4.34  .6666667  .4058824         1  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      725        25     8.875  8.696652      .001  196.6112  102.2232   125.001  101.3054         1  6.576923         1  .6223233         1        53         8
{txt}{space 8} {...}
{c |}{...}
 {res} -.186507  1.158326   2.64354  2.605821  14.06577  .7178331  1.064214  .9029087  1.097511  .9296207   2.71314  1.202288  .1473163 -.3589277 -.3917521 -.2169849
{txt}{space 8} {...}
{c |}{...}
 {res} 2.571692  3.367225  19.58287  19.27928  288.2683  3.788116  3.838797  2.607817  6.295926  1.864195  14.77624  6.084499  1.970201  1.128829  3.826701  5.921309
{txt}{space 8} {...}
{c |}{...}
 {res} 147.6566  10.09297  5.084145  5.104785  .5262248   61.7417  55.98267  45.36577  43.26725  .4534548  4.033731  .3447603   .256803  .4921824  7.656608  1.642671
{txt}{space 8} {...}
{c |}{...}
 {res}     5497      5497      5497      5497      5497      5497      5497      5497      5497      5497      5497      5497      5497      5497      5497      5497
{txt}{hline 9}{c +}{hline 160}
{ralign 8:3} {...}
{c |}{...}
 {res} 587.1386  73.34771  2.733525  2.638995  .0965303   136.004  68.68713  90.57695  48.54589  .3058824  14.38286  .7435061  .1792936  .5228758  49.08203  7.211974
{txt}{space 8} {...}
{c |}{...}
 {res}      900     241.8        14    14.001     6.251  339.8744   230.001   194.401   330.001         1        90         2  .9496919         1        69        16
{txt}{space 8} {...}
{c |}{...}
 {res}      200        50       .65  .2374351      .001    37.501      .001  48.88989      .001         0  3.083333         0         0         0        30         2
{txt}{space 8} {...}
{c |}{...}
 {res}      500        60  .6666667  .6676667      .001  100.6677  31.72689  63.54939  31.13003         0  8.428572        .5  .0657439         0        45         7
{txt}{space 8} {...}
{c |}{...}
 {res} 618.6667        67  1.304348  1.229879      .001  116.6677  66.66766  80.16229    44.221         0     13.02  .6666667  .1296539         1  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res} 666.6667        90  4.010695     4.001      .001  169.5092  109.3343  117.4677  67.55656         1    19.875         1  .2547376         1  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}-.4577125  2.084347  1.501575  1.575026  8.383702  .9133167  .3885942  .9876297  2.752681  .8425608  2.451091  1.127515  1.621229 -.0915992 -.8930309  .6154117
{txt}{space 8} {...}
{c |}{...}
 {res} 3.062909   10.5394   4.35576  4.640219  93.10958  3.414514  2.728606  3.322756  26.94735  1.709909   22.0441  5.930573  5.961506   1.00839  3.542535  8.964802
{txt}{space 8} {...}
{c |}{...}
 {res} 136.3652  22.17017   2.85161  2.809648  .4306969   50.0093   42.4671  35.68676  27.63359  .4610816   8.04459  .3187517  .1600424  .4998032  6.994962  1.375023
{txt}{space 8} {...}
{c |}{...}
 {res}      765       765       765       765       765       765       765       765       765       765       765       765       765       765       765       765
{txt}{hline 9}{c +}{hline 160}
{ralign 8:Total} {...}
{c |}{...}
 {res} 562.9005  12.04823  10.99042  10.87309   .119336  159.3768  67.42848  104.9037  80.60202  .1839969  3.677559  .7439561  .5569459  .5743323  52.44047  7.157752
{txt}{space 8} {...}
{c |}{...}
 {res}      900     241.8  57.14286  57.14386    14.001   400.001  281.8192   194.401   330.001         1        90         2         1         1        74        16
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1       .65      .001      .001    37.501      .001  48.88989      .001         0         0         0         0         0        30         0
{txt}{space 8} {...}
{c |}{...}
 {res} 450.1018         3  4.210526  4.118647      .001   107.501  21.62262    65.001    51.001         0      1.36        .5  .2888244         0        50         6
{txt}{space 8} {...}
{c |}{...}
 {res}      550       6.1  8.333334  8.334333      .001   150.001    55.001    90.001  72.02631         0  2.427778  .6666667  .6063218         1  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      700        13  14.87179    14.626      .001  195.4727   100.001  139.6677   100.001         0      4.25         1  .8360302         1        56         8
{txt}{space 8} {...}
{c |}{...}
 {res} -.047449  3.411073  2.124025  2.114693   13.1006  .9436195  1.148323  .6435823   1.87034  1.631061  4.085797   .916672 -.3248819 -.3006702 -.0966776 -.4087087
{txt}{space 8} {...}
{c |}{...}
 {res} 2.380518   19.3459  8.848446    8.7934   222.302  4.035071   4.23691  2.134584  9.545493  3.660361  38.57624  5.505428  1.796404  1.090403  3.814584  5.603368
{txt}{space 8} {...}
{c |}{...}
 {res} 165.8127  16.58741  9.924317  9.952616  .7062047  71.59058  60.24885  47.80992  50.08042  .3874925  4.167931  .3580124  .3065268  .4944577  8.193926     1.816
{txt}{space 8} {...}
{c |}{...}
 {res}    17859     17859     17859     17859     17859     17859     17859     17859     17859     17859     17859     17859     17859     17859     17859     17859
{txt}{hline 9}{c BT}{hline 160}

{ralign 8:caland} {...}
{c |}{...}
     train    health    status
{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res}  .073726   4.23782  .1927223
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 3.262413 -.8882117  1.558058
{txt}{space 8} {...}
{c |}{...}
 {res} 11.64334   6.12367  3.427545
{txt}{space 8} {...}
{c |}{...}
 {res} .2613357  .6432506  .3944538
{txt}{space 8} {...}
{c |}{...}
 {res}    11597     11597     11597
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res} .0905949  4.353829  .1448063
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 2.852678 -.4931751  2.018689
{txt}{space 8} {...}
{c |}{...}
 {res} 9.137773  4.166507  5.075105
{txt}{space 8} {...}
{c |}{...}
 {res} .2870582  .5809321  .3519374
{txt}{space 8} {...}
{c |}{...}
 {res}     5497      5497      5497
{txt}{hline 9}{c +}{hline 30}
{ralign 8:3} {...}
{c |}{...}
 {res} .0823529   4.34902  .1633987
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 3.038519 -.1670273    1.8208
{txt}{space 8} {...}
{c |}{...}
 {res}  10.2326  3.807264  4.315313
{txt}{space 8} {...}
{c |}{...}
 {res} .2750815  .5363877  .3699709
{txt}{space 8} {...}
{c |}{...}
 {res}      765       765       765
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res} .0792878  4.278291  .1767176
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 3.114226 -.7895204  1.695109
{txt}{space 8} {...}
{c |}{...}
 {res}  10.6984   5.73176  3.873395
{txt}{space 8} {...}
{c |}{...}
 {res} .2701949  .6228061  .3814402
{txt}{space 8} {...}
{c |}{...}
 {res}    17859     17859     17859
{txt}{hline 9}{c BT}{hline 30}

{com}. tabstat yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status if year==2011, by(caland) statistics(mean ma mi q sk k sd n)

{txt}Summary statistics: mean, max, min, p25, p50, p75, skewness, kurtosis, sd, N
  by categories of: caland 

{ralign 8:caland} {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s     plots   fstruct       job       sex       age      educ
{hline 9}{c +}{hline 160}
{ralign 8:1} {...}
{c |}{...}
 {res} 521.7357  4.154715  14.93345  14.79884  .1366096   145.715  50.95955   100.301  74.08808  .0665399  2.124348  .7232868  .6278497  .8935361  52.83346  7.093353
{txt}{space 8} {...}
{c |}{...}
 {res}      900       9.9  57.14286  57.14386    14.001   400.001  281.8192   194.401   330.001         1  36.33333         2         1         1        74        15
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .2       .65      .001      .001    37.501      .001  48.88989      .001         0         0         0         0         0        30         0
{txt}{space 8} {...}
{c |}{...}
 {res}      400         2  7.142857     7.001      .001    97.001      .001    60.001  48.53759         0         1        .5  .4068427         1        45         6
{txt}{space 8} {...}
{c |}{...}
 {res}      500         4     11.25  11.11211      .001  131.1121    40.001  86.68877  68.55656         0  1.666667  .6666667  .7246539         1        54         7
{txt}{space 8} {...}
{c |}{...}
 {res}      625         6        20    20.001      .001   190.001    70.001   130.001  92.44544         0      2.65         1  .8778008         1        60         9
{txt}{space 8} {...}
{c |}{...}
 {res} .2792484  .4001266  1.727029   1.71258  11.18751  .8369812  1.543404  .7160468   2.08808  3.478485  4.932866  .4657799 -.7188237 -2.551863 -.0930447 -.4244858
{txt}{space 8} {...}
{c |}{...}
 {res} 2.403813  2.216861  6.077322  6.029158   161.612  3.549999  5.888743  2.277455  11.20758  13.09985   60.7808   5.45212  2.270065  7.512006  2.415093  3.448863
{txt}{space 8} {...}
{c |}{...}
 {res} 167.2262  2.390581  11.44996  11.51929  .8014226  69.32126  53.38161  46.72905  47.51946  .2492709  1.927112  .3036755  .2963499  .3084891  10.50376  2.409837
{txt}{space 8} {...}
{c |}{...}
 {res}     2630      2630      2630      2630      2630      2630      2630      2630      2630      2630      2630      2630      2630      2630      2630      2630
{txt}{hline 9}{c +}{hline 160}
{ralign 8:2} {...}
{c |}{...}
 {res} 589.0098  18.59786  6.647768  6.539942  .1098264   149.691  58.75052  91.84642  73.82567  .1973214  5.479892  .7364466  .4340976  .9642857  49.64643  7.242387
{txt}{space 8} {...}
{c |}{...}
 {res}      900      49.9  57.14286  57.14386  9.091909  356.6677  236.4825   194.401   314.877         1      31.8         2  .9811144         1        74        15
{txt}{space 8} {...}
{c |}{...}
 {res}      200        10       .65      .001      .001    37.501      .001  48.88989      .001         0         0         0         0         0        30         0
{txt}{space 8} {...}
{c |}{...}
 {res}      500        12  3.150376  3.016151      .001  105.3474  29.52373    60.001  45.37947         0         3        .5   .216336         1        43         6
{txt}{space 8} {...}
{c |}{...}
 {res}  593.623        15  5.674242  5.475101      .001  149.1677  47.15733  76.53433  66.11864         0  4.333333  .6666667  .4399555         1        50         7
{txt}{space 8} {...}
{c |}{...}
 {res} 692.3077        22  9.309524  9.195984      .001   182.001  79.65617   110.001  103.3977         0  6.816667         1  .6475396         1        57         9
{txt}{space 8} {...}
{c |}{...}
 {res} .1396126  1.395285  2.236843  2.207726   9.51852  .6627352  1.414078  1.137248  .7566467  1.521086  2.043951  1.266703  .0656326 -5.003702 -.0723802 -.2078024
{txt}{space 8} {...}
{c |}{...}
 {res} 2.541653  4.185385  17.18513   16.7934  140.2821  3.490172   5.06157  3.285804   3.74673  3.313702  9.704432  7.295618  1.897406  26.03704  2.346992  3.732215
{txt}{space 8} {...}
{c |}{...}
 {res} 142.4977  9.338065  4.692582   4.73651  .4728969  57.64357  46.00459  42.54665  41.05297  .3981548  3.648538  .2825181  .2507418  .1856598  9.661565  2.070101
{txt}{space 8} {...}
{c |}{...}
 {res}     1120      1120      1120      1120      1120      1120      1120      1120      1120      1120      1120      1120      1120      1120      1120      1120
{txt}{hline 9}{c +}{hline 160}
{ralign 8:3} {...}
{c |}{...}
 {res} 569.6184  67.20357  3.111211  2.937858  .1753533  133.0542  43.01675  79.51285   40.4688  .2380952  12.72782      .725  .2010149  .9761905  44.72619   7.15664
{txt}{space 8} {...}
{c |}{...}
 {res}      900     153.5  11.66667  11.66767  3.715286  339.8744  181.0821   194.401  109.3279         1        34         2  .8121364         1        65        12
{txt}{space 8} {...}
{c |}{...}
 {res}      300        50       .65  .3923894      .001    37.501      .001  48.88989  3.215286         0  3.888889         0         0         0        30         2
{txt}{space 8} {...}
{c |}{...}
 {res} 495.3104      53.5  1.374785  1.246968      .001  83.72771  16.00156  49.83946  27.53975         0  8.178571        .5  .0612658         1        39         6
{txt}{space 8} {...}
{c |}{...}
 {res}      530        62  1.758978  1.734389      .001  118.9849  35.16583  62.66767  39.16708         0      12.5  .6666667  .1556788         1      44.5         7
{txt}{space 8} {...}
{c |}{...}
 {res} 631.6639      72.5  2.615385  2.420048  .0622306  169.1594    68.501   108.524  48.07555         0  16.53333         1  .3094583         1        51         8
{txt}{space 8} {...}
{c |}{...}
 {res} 1.046705  1.953577   1.73624  1.819171  4.579987  .9400314  1.133914  1.505512  1.028413  1.229837  .9786788  1.185099   1.06647  -6.24695  .0809733   .521787
{txt}{space 8} {...}
{c |}{...}
 {res} 3.843936  8.382774  4.386862  4.738555  26.82122  3.454036  4.880336  4.508239  4.823605    2.5125  4.456034  7.352082  3.691095  40.02439  2.208232   4.30705
{txt}{space 8} {...}
{c |}{...}
 {res}   136.62  17.88162  3.223633  3.182269  .5355612  61.79415  33.93568  38.16628  20.78357  .4284758  5.975402  .2860606  .1687035   .153371   8.47157  1.904224
{txt}{space 8} {...}
{c |}{...}
 {res}       84        84        84        84        84        84        84        84        84        84        84        84        84        84        84        84
{txt}{hline 9}{c +}{hline 160}
{ralign 8:Total} {...}
{c |}{...}
 {res} 542.4371  9.755243  12.25399  12.12636  .1296344  146.5991  53.06145  97.37577  73.27485  .1085029  3.336894  .7271686  .5618986  .9160146  51.72483  7.138276
{txt}{space 8} {...}
{c |}{...}
 {res}      900     153.5  57.14286  57.14386    14.001   400.001  281.8192   194.401   330.001         1  36.33333         2         1         1        74        15
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .2       .65      .001      .001    37.501      .001  48.88989      .001         0         0         0         0         0        30         0
{txt}{space 8} {...}
{c |}{...}
 {res} 416.6667         3         5     5.001      .001   100.001    15.001    60.001  47.05982         0      1.25        .5   .298777         1        44         6
{txt}{space 8} {...}
{c |}{...}
 {res} 503.9278         6        10     9.501      .001  136.6213  41.76456   84.7224  66.66766         0   2.31875  .6666667  .6201254         1        52         7
{txt}{space 8} {...}
{c |}{...}
 {res}      650      11.5        15    15.001      .001  185.7153  72.22322  122.8581  92.52731         0         4         1  .8316169         1        59         9
{txt}{space 8} {...}
{c |}{...}
 {res} .1777308   3.49596  2.011139  2.000813  11.63312  .7996255  1.495583  .8436707  1.821106  2.517549  2.952444  .6769359 -.3584168 -2.999753 -.0465562 -.3813813
{txt}{space 8} {...}
{c |}{...}
 {res}  2.43936  20.74684  7.682093  7.634659  182.5877  3.595567  5.753935  2.525776  9.974316  7.338055  16.77732  5.967931  1.844093  9.998518  2.411738  3.594164
{txt}{space 8} {...}
{c |}{...}
 {res} 162.6552  12.36915  10.60736  10.66074   .715696  66.00049  51.10773  45.60171  45.54445   .311055  3.389692  .2972552  .2996976  .2774021  10.37581  2.305923
{txt}{space 8} {...}
{c |}{...}
 {res}     3834      3834      3834      3834      3834      3834      3834      3834      3834      3834      3834      3834      3834      3834      3834      3834
{txt}{hline 9}{c BT}{hline 160}

{ralign 8:caland} {...}
{c |}{...}
     train    health    status
{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res} .1205323  4.390114  .1851711
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 2.331004 -1.193859  1.621007
{txt}{space 8} {...}
{c |}{...}
 {res} 6.433581  4.858862  3.627662
{txt}{space 8} {...}
{c |}{...}
 {res} .3256449  .7389976  .3885102
{txt}{space 8} {...}
{c |}{...}
 {res}     2630      2630      2630
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res} .1357143  4.608929  .1303571
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}  2.12731 -1.630668  2.195707
{txt}{space 8} {...}
{c |}{...}
 {res} 5.525446  5.849201   5.82113
{txt}{space 8} {...}
{c |}{...}
 {res} .3426379  .6346494  .3368464
{txt}{space 8} {...}
{c |}{...}
 {res}     1120      1120      1120
{txt}{hline 9}{c +}{hline 30}
{ralign 8:3} {...}
{c |}{...}
 {res} .0952381   4.72619  .1666667
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         3         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0       4.5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 2.757764  -1.58307  1.788854
{txt}{space 8} {...}
{c |}{...}
 {res} 8.605263  4.585363       4.2
{txt}{space 8} {...}
{c |}{...}
 {res} .2953066  .4994259  .3749163
{txt}{space 8} {...}
{c |}{...}
 {res}       84        84        84
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res} .1244131  4.461398  .1687533
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 2.275923 -1.319327  1.768848
{txt}{space 8} {...}
{c |}{...}
 {res} 6.179827  5.111607  4.128824
{txt}{space 8} {...}
{c |}{...}
 {res} .3300953  .7134039  .3745827
{txt}{space 8} {...}
{c |}{...}
 {res}     3834      3834      3834
{txt}{hline 9}{c BT}{hline 30}

{com}. tabstat yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status if year==2012, by(caland) statistics(mean ma mi q sk k sd n)

{txt}Summary statistics: mean, max, min, p25, p50, p75, skewness, kurtosis, sd, N
  by categories of: caland 

{ralign 8:caland} {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s     plots   fstruct       job       sex       age      educ
{hline 9}{c +}{hline 160}
{ralign 8:1} {...}
{c |}{...}
 {res} 533.5249  4.331645  14.05657  13.92451  .1340606  158.9574  59.62349  105.5324  83.10235  .0974867  2.084921  .7604716  .6351543  .8899467  53.33605  7.113477
{txt}{space 8} {...}
{c |}{...}
 {res}      900       9.9  57.14286  57.14386    14.001   400.001  281.8192   194.401   330.001         1        16         2         1         1        74        15
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .2       .65      .001      .001    37.501      .001  48.88989      .001         0         0         0         0         0        30         0
{txt}{space 8} {...}
{c |}{...}
 {res}      400       2.4  6.666667     6.401      .001  102.2737  14.28671    65.001  54.78973         0    1.0125        .4  .4346917         1        46         6
{txt}{space 8} {...}
{c |}{...}
 {res}      500         4        10    10.001      .001   150.001  44.61128  95.49729    75.001         0       1.7  .6666667   .732797         1        54         7
{txt}{space 8} {...}
{c |}{...}
 {res}      650         6  19.56522    19.501      .001  198.5724    90.001   138.001  102.4084         0  2.666667         1  .8782095         1        61         9
{txt}{space 8} {...}
{c |}{...}
 {res} .1473467  .3422883  1.832904  1.810493  11.06854  .9100933   1.34343  .5892791  1.865094  2.714006  2.370871  .8587033 -.7646337 -2.492021 -.1233013 -.3135487
{txt}{space 8} {...}
{c |}{...}
 {res} 2.415747  2.158348  7.000524   6.90265   170.939  3.845156  4.987812  2.163012  9.355326  8.365829  12.82369  3.360694  2.377105  7.210168  2.416151   3.31962
{txt}{space 8} {...}
{c |}{...}
 {res} 163.6611   2.40454  10.91602  10.98368   .713842  75.65263  59.09088  47.18591   51.0658  .2966758   1.58386  .5094375  .2946549  .3130158  10.39236  2.363903
{txt}{space 8} {...}
{c |}{...}
 {res}     2626      2626      2626      2626      2626      2626      2626      2626      2626      2626      2626      2626      2626      2626      2626      2626
{txt}{hline 9}{c +}{hline 160}
{ralign 8:2} {...}
{c |}{...}
 {res} 614.1482  19.72782  6.582262  6.477963  .1062986  167.9666  69.03576    103.54  77.42941  .2542662  5.669492  .8070924  .4145797  .9547782  50.32765  7.246272
{txt}{space 8} {...}
{c |}{...}
 {res}      900      49.6  57.14286  57.14386    10.001   400.001  265.4877   194.401   330.001         1        30         2  .9943184         1        74        15
{txt}{space 8} {...}
{c |}{...}
 {res}      200        10       .65      .001      .001    37.501      .001  48.88989      .001         0         0         0         0         0        30         0
{txt}{space 8} {...}
{c |}{...}
 {res} 517.4985        12         3  2.810256      .001  126.3866  28.51748    65.001  49.52446         0         3        .5  .2006141         1        43         6
{txt}{space 8} {...}
{c |}{...}
 {res}      600        16  5.164251     5.001      .001  164.1928  54.76668   83.0635  68.82453         0  4.472222  .6666667  .4032456         1        51         7
{txt}{space 8} {...}
{c |}{...}
 {res} 705.5162        25        10    10.001      .001  202.4635   100.001  135.3271   100.001         1         7         1  .6103173         1        58         9
{txt}{space 8} {...}
{c |}{...}
 {res}-.0385319  1.147379  2.393134  2.358194  12.19364  .6753913  .9678124   .743407  1.316703  1.128648  2.351858  .9331824  .2115999 -4.377279 -.0966704 -.1901011
{txt}{space 8} {...}
{c |}{...}
 {res}  2.94434  3.344031   16.0078  15.72218  252.6623  3.610741  3.315879   2.15112  7.011651  2.273847  10.76346  3.514293   2.06833  20.16057  2.354798  3.510602
{txt}{space 8} {...}
{c |}{...}
 {res} 141.0659  10.04462  5.133465  5.170339  .4269037  62.89643  54.37304  49.48985  44.56499  .4356338  4.074637  .4855594  .2483453  .2078791  9.826774  2.096929
{txt}{space 8} {...}
{c |}{...}
 {res}     1172      1172      1172      1172      1172      1172      1172      1172      1172      1172      1172      1172      1172      1172      1172      1172
{txt}{hline 9}{c +}{hline 160}
{ralign 8:3} {...}
{c |}{...}
 {res} 570.0956  67.88468  2.902638  2.764466   .140172  127.6886  53.56884  83.33409  46.54653  .3423423  13.58316  .8399292  .2313755   .981982  46.13514  7.199619
{txt}{space 8} {...}
{c |}{...}
 {res}      900     241.8        14    14.001  4.527316   272.001  184.5039   194.401  111.6936         1        90         2  .9496919         1        66        12
{txt}{space 8} {...}
{c |}{...}
 {res} 317.4603        50       .65  .2374351      .001    37.501      .001  48.88989      .601         0     3.125         0  .0292849         0        30         2
{txt}{space 8} {...}
{c |}{...}
 {res}      500        55   1.09375  1.038037      .001    90.001  20.37137  56.97885  34.67871         0  8.571428        .5  .0645976         1        40         6
{txt}{space 8} {...}
{c |}{...}
 {res} 541.6667        60  1.583333  1.539462      .001   120.001    32.501  73.66766   45.4974         0     13.02        .8  .1389229         1        46         7
{txt}{space 8} {...}
{c |}{...}
 {res}      600      74.5  2.388535  2.348418      .001   140.001  88.83434  91.66766  56.15786         1    16.275         1  .3437126         1        52         9
{txt}{space 8} {...}
{c |}{...}
 {res} 1.429134  4.313312  1.893084  2.009827   6.48467  1.306759  .8395091  1.494479  .4005832  .6645303  5.132522  .4803572  1.343621 -7.246954  .0265323 -.0403223
{txt}{space 8} {...}
{c |}{...}
 {res} 5.187233  31.13824  5.357862  5.823445  53.22312  4.007001  2.935088  4.734038  3.670985  1.441601  42.21163  2.652024   4.03234  53.51835  2.372315  4.251384
{txt}{space 8} {...}
{c |}{...}
 {res}    112.3  22.94018   3.15043   3.12041  .5059559  56.59346  41.85613  36.38531  21.64821  .4766454  9.307704  .4256943  .2210392  .1336197  7.860704  1.837987
{txt}{space 8} {...}
{c |}{...}
 {res}      111       111       111       111       111       111       111       111       111       111       111       111       111       111       111       111
{txt}{hline 9}{c +}{hline 160}
{ralign 8:Total} {...}
{c |}{...}
 {res} 558.7359  10.75239  11.49889  11.37498  .1259105  160.7707  62.27356  104.3047  80.36344  .1514454  3.486155  .7767058  .5575557   .911998  52.22959  7.155738
{txt}{space 8} {...}
{c |}{...}
 {res}      900     241.8  57.14286  57.14386    14.001   400.001  281.8192   194.401   330.001         1        90         2         1         1        74        15
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .2       .65      .001      .001    37.501      .001  48.88989      .001         0         0         0         0         0        30         0
{txt}{space 8} {...}
{c |}{...}
 {res}      475         3  4.651163  4.527316      .001   108.001    20.001  64.10356  50.78531         0  1.333333        .4  .3004822         1        45         6
{txt}{space 8} {...}
{c |}{...}
 {res} 546.6667         6         9     8.751      .001  155.3856  48.18282  91.42957   71.7657         0       2.4  .6666667  .6044763         1        53         7
{txt}{space 8} {...}
{c |}{...}
 {res} 666.6667        12        15    15.001      .001   200.001    95.001  136.2801   100.001         0  4.066667         1   .833191         1        60         9
{txt}{space 8} {...}
{c |}{...}
 {res} .0342999  3.873303  2.086437   2.07022  11.73944  .8516139  1.226352  .6594535  1.773881  1.944612  5.297124  .8624877 -.3260378 -2.908585 -.0765386 -.2908871
{txt}{space 8} {...}
{c |}{...}
 {res} 2.535712  32.27155  8.589533  8.496225  198.7977  3.832348   4.52988  2.186429   9.14436  4.781515  77.32245  3.389785  1.822836  9.459866  2.407051  3.430362
{txt}{space 8} {...}
{c |}{...}
 {res} 160.1898  13.91045  10.09748  10.14812  .6358128  71.89364  57.45572  47.75337  48.98975  .3585283  3.839667  .5006376  .3022786  .2833341  10.30441  2.273728
{txt}{space 8} {...}
{c |}{...}
 {res}     3909      3909      3909      3909      3909      3909      3909      3909      3909      3909      3909      3909      3909      3909      3909      3909
{txt}{hline 9}{c BT}{hline 160}

{ralign 8:caland} {...}
{c |}{...}
     train    health    status
{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res} .1169078  4.355293  .2060168
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 2.384561 -1.319362   1.45377
{txt}{space 8} {...}
{c |}{...}
 {res} 6.686131  5.369427  3.113447
{txt}{space 8} {...}
{c |}{...}
 {res} .3213716  .7859508  .4045197
{txt}{space 8} {...}
{c |}{...}
 {res}     2626      2626      2626
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res}  .144198  4.574232  .1595563
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 2.025686 -1.625445  1.859362
{txt}{space 8} {...}
{c |}{...}
 {res} 5.103406  6.267428  4.457227
{txt}{space 8} {...}
{c |}{...}
 {res} .3514403  .6564024  .3663504
{txt}{space 8} {...}
{c |}{...}
 {res}     1172      1172      1172
{txt}{hline 9}{c +}{hline 30}
{ralign 8:3} {...}
{c |}{...}
 {res} .1981982  4.702703  .0900901
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         3         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 1.514148 -1.679622  2.863391
{txt}{space 8} {...}
{c |}{...}
 {res} 3.292646  4.865479   9.19901
{txt}{space 8} {...}
{c |}{...}
 {res} .4004502  .5492904  .2876093
{txt}{space 8} {...}
{c |}{...}
 {res}      111       111       111
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res} .1273983  4.430801  .1887951
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 2.235038 -1.428554  1.590435
{txt}{space 8} {...}
{c |}{...}
 {res} 5.995396  5.688576  3.529482
{txt}{space 8} {...}
{c |}{...}
 {res} .3334613  .7514114  .3913958
{txt}{space 8} {...}
{c |}{...}
 {res}     3909      3909      3909
{txt}{hline 9}{c BT}{hline 30}

{com}. tabstat yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status if year==2013, by(caland) statistics(mean ma mi q sk k sd n)

{txt}Summary statistics: mean, max, min, p25, p50, p75, skewness, kurtosis, sd, N
  by categories of: caland 

{ralign 8:caland} {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s     plots   fstruct       job       sex       age      educ
{hline 9}{c +}{hline 160}
{ralign 8:1} {...}
{c |}{...}
 {res} 533.6399  4.380755  13.43805   13.3057  .1343504  163.6727  67.28154  110.7984  89.97041  .1492662  2.133842  .7295755  .6661242         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      900       9.9  57.14286  57.14386    14.001   400.001  281.8192   194.401   330.001         1        30         2         1         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1       .65      .001      .001    37.501      .001  48.88989      .001         0         0         0         0         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      400       2.4         6     6.001      .001  106.6677    15.001  67.30869    60.001         0      1.05        .5  .4853275         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      504         4        10    10.001      .001   150.001    55.001   100.001    80.001         0      1.75  .6666667  .7649254         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      650         6        18    18.001      .001   200.001  102.2232   152.001  110.4177         0  2.666667         1  .8962731         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res} .0256657  .2958596  1.848323  1.829147  12.56177  .9772818  1.078011  .4334999  1.940837  1.968475  3.811493  .3781989 -.8933029         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 2.422384  2.127307  7.260202  7.177584  190.9077  3.789982   4.07469  1.835507  9.100911  4.874894  42.44957  5.492255  2.669736         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 161.8441   2.40984  10.51871  10.53604  .8438284  80.40715  62.53005  49.88457  54.40709  .3564254  1.649695   .307524  .2819018         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}     2385      2385      2385      2385      2385      2385      2385      2385      2385      2385      2385      2385      2385      2385      2385      2385
{txt}{hline 9}{c +}{hline 160}
{ralign 8:2} {...}
{c |}{...}
 {res} 627.1087   20.1755   6.23401  6.103232  .1327786  170.2267  76.71547  101.7073  80.78554  .3273056  5.686949  .7417101  .4098932         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      900      49.7  57.14286  57.14386    14.001   400.001  281.8192   194.401   330.001         1        45         2  .9758186         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      200        10       .65      .001      .001    37.501      .001  48.88989      .001         0         0         0         0         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      520        12  2.380953  2.286714      .001   128.001  33.33433  65.77878  52.28671         0         3        .5  .1976374         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}  635.255        16  4.545455  4.413879      .001  163.9128  64.06906    85.001  79.27183         0  4.436508  .6666667  .3964658         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res} 744.2953      26.4         9     9.001      .001   200.001   105.001   130.001   106.001         1         7         1  .6159744         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}-.2567087  1.056577  3.470021  3.455383  13.32321   .738788  .9048014  .8311677  .9273699  .7360759  2.925021   1.01987  .1896339         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}  2.53436  3.001624  26.49567  26.85403  207.8537  3.669495  3.232667  2.411193  5.872636  1.541808  16.92407  6.732877   1.96797         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 147.5091  10.51705  5.693273  5.661089  .7992185  63.58677  55.93387    46.473  41.45749  .4694421  4.398451  .2971381  .2505146         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}     1106      1106      1106      1106      1106      1106      1106      1106      1106      1106      1106      1106      1106      1106      1106      1106
{txt}{hline 9}{c +}{hline 160}
{ralign 8:3} {...}
{c |}{...}
 {res} 477.6098  70.09073  2.206883  2.098167  .1107159   126.213  79.35876  97.02588  57.35916  .2847682  16.23989  .7504573  .1917097         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      900       132      12.4    12.401  4.412765   307.001   199.542   194.401  150.9677         1        90         2  .8443719         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res} 244.4444        50       .65   .370748      .001    37.501     5.001  48.88989      .001         0     3.125         0         0         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      300        60  .6666667  .6676667      .001   100.001    30.001  66.66766  40.18562         0        10        .5   .089934         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      500      63.5  1.018519     1.001      .001  113.3343  84.66766   88.8431  60.85509         0        15  .6666667  .1597759         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res} 591.9048        81  2.016667     2.001      .001   140.001  133.3343   130.001  79.86767         1      22.5         1  .2436423         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res} .4356671  1.194699  2.207403  2.385464  6.344902  2.026766 -.0675462  .2907216 -.1598852  .9538218  3.089576  1.524678  1.860439         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 2.417747  3.945286  6.684267  7.607427  50.17511  8.604053  1.485264  2.050182  3.080057  1.909776  24.85941  7.191649  7.449249         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 158.8502  17.17026  2.756077  2.671947  .4776055  42.32472  49.71873  36.00415  25.94981  .4528058  9.528322  .3421602  .1436383         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}      151       151       151       151       151       151       151       151       151       151       151       151       151       151       151       151
{txt}{hline 9}{c +}{hline 160}
{ralign 8:Total} {...}
{c |}{...}
 {res} 559.7014  11.90167  10.78468  10.65378  .1328931  164.1099  70.64716  107.4666  85.82907  .2089511  3.797694  .7341263  .5686426         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      900       132  57.14286  57.14386    14.001   400.001  281.8192   194.401   330.001         1        90         2         1         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1       .65      .001      .001    37.501      .001  48.88989      .001         0         0         0         0         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res} 444.4445       3.1         4  3.867666      .001  112.6771    24.501  66.66766  58.33434         0       1.4        .5  .3035108         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res} 553.4476      6.05  8.410526  8.276862      .001  153.2695    60.001    92.501  79.68433         0       2.4  .6666667  .6250127         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res} 694.4445      12.5  14.28571    14.001      .001   200.001   105.001  142.8582  107.1084         0       4.3         1  .8437722         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}-.0702921  2.963147  2.104354  2.093023  12.84204  .9602128  .9791262    .56088  1.854794  1.431766   4.66188  .6227406 -.3462623         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}  2.37327  13.62128  8.882721  8.824493  199.0526   3.94399  3.788754  1.998458  9.448952  3.049953    49.207  5.985088  1.802259         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 164.0071  15.74122  9.825939  9.830414   .818227  74.86788   60.2762  48.58076  50.39962  .4066152  4.550985  .3059122  .3028227         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}     3642      3642      3642      3642      3642      3642      3642      3642      3642      3642      3642      3642      3642      3642      3642      3642
{txt}{hline 9}{c BT}{hline 160}

{ralign 8:caland} {...}
{c |}{...}
     train    health    status
{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res}        0         4  .1949686
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  1.539877
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .   3.37122
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0  .3962596
{txt}{space 8} {...}
{c |}{...}
 {res}     2385      2385      2385
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res}        0         4  .1437613
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  2.030732
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  5.123873
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0  .3510062
{txt}{space 8} {...}
{c |}{...}
 {res}     1106      1106      1106
{txt}{hline 9}{c +}{hline 30}
{ralign 8:3} {...}
{c |}{...}
 {res}        0         4  .1721854
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  1.736575
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  4.015692
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0  .3787979
{txt}{space 8} {...}
{c |}{...}
 {res}      151       151       151
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res}        0         4  .1784734
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  1.679382
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  3.820323
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0  .3829633
{txt}{space 8} {...}
{c |}{...}
 {res}     3642      3642      3642
{txt}{hline 9}{c BT}{hline 30}

{com}. tabstat yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status if year==2014, by(caland) statistics(mean ma mi q sk k sd n)

{txt}Summary statistics: mean, max, min, p25, p50, p75, skewness, kurtosis, sd, N
  by categories of: caland 

{ralign 8:caland} {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s     plots   fstruct       job       sex       age      educ
{hline 9}{c +}{hline 160}
{ralign 8:1} {...}
{c |}{...}
 {res} 546.2818  4.371305  13.50916  13.40741  .1037472  161.3423  74.15673  114.0388  94.10624  .1884124  2.060151  .7352519   .658815  .8832117   54.8729  7.104324
{txt}{space 8} {...}
{c |}{...}
 {res}      900       9.9  57.14286  57.14386    14.001   400.001  281.8192   194.401   330.001         1        20         2         1         1        74        15
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1       .65      .001      .001    37.501      .001  48.88989      .001         0         0         0         0         0        30         0
{txt}{space 8} {...}
{c |}{...}
 {res} 423.6111       2.3         6  5.834333      .001  109.7564  14.64386    70.001  60.93578         0  1.033333        .5  .4843703         1        47         6
{txt}{space 8} {...}
{c |}{...}
 {res} 523.0385         4        10    10.001      .001  147.9389    60.001   100.001    85.001         0      1.75  .6666667  .7539416         1        55         7
{txt}{space 8} {...}
{c |}{...}
 {res}      700       6.1  18.18182  18.12805      .001  197.2592  114.8694  161.6677   112.001         0   2.56125         1  .8893554         1        62         9
{txt}{space 8} {...}
{c |}{...}
 {res}-.0035394  .3187171  1.901573  1.897304  14.09433  1.086758  1.052385  .3825217  1.922488  1.593631  2.647151  .5139583 -.8586967 -2.386364 -.1821491 -.3098258
{txt}{space 8} {...}
{c |}{...}
 {res} 2.221095  2.079637  7.292758  7.273431    238.28  4.180051  3.531812  1.725651  8.662002  3.539659  18.79075  5.581797  2.610519  6.694731  2.407174  3.312127
{txt}{space 8} {...}
{c |}{...}
 {res} 178.3976  2.489341  10.77735  10.81421  .7500709  76.10756  71.26809  51.07637  57.69286  .3911304  1.493235  .3231162  .2843006  .3212412  10.34906  2.401319
{txt}{space 8} {...}
{c |}{...}
 {res}     2192      2192      2192      2192      2192      2192      2192      2192      2192      2192      2192      2192      2192      2192      2192      2192
{txt}{hline 9}{c +}{hline 160}
{ralign 8:2} {...}
{c |}{...}
 {res}  633.092  20.42436  6.056122  5.956053  .1020692  163.7909  83.73691  97.76598  82.01558  .3562271   5.49657  .7344711  .4080647  .9478022  51.81685  7.306777
{txt}{space 8} {...}
{c |}{...}
 {res}      900      49.7  50.22222    50.001  8.572429   400.001  281.8192   194.401   330.001         1        40         2  .9736009         1        74        15
{txt}{space 8} {...}
{c |}{...}
 {res}      204        10       .65      .001      .001    37.501      .001  48.88989      .001         0         0         0         0         0        30         0
{txt}{space 8} {...}
{c |}{...}
 {res}      500        12   2.11943  2.028027      .001   120.001    40.001   63.0635   49.8195         0         3        .5  .1897159         1        45         6
{txt}{space 8} {...}
{c |}{...}
 {res} 652.5385        17         5  4.762583      .001  155.4464    70.001  79.93156    80.001         0      4.25  .6666667  .4025396         1        52         8
{txt}{space 8} {...}
{c |}{...}
 {res} 733.3333        26  8.392943  8.233232      .001   195.001  116.8343  125.7621  102.8343         1  6.414286         1  .6028944         1        59         9
{txt}{space 8} {...}
{c |}{...}
 {res}-.3253833   1.09834  2.217307  2.178208   10.7838  .8301176  .8385328  .9006866  1.157649  .6004505     2.833  1.074851  .1695594 -4.026533 -.0881678 -.2931163
{txt}{space 8} {...}
{c |}{...}
 {res} 2.353039  3.224331  14.18113  13.75125  168.5212  4.048584  3.505541  2.585367  6.525349  1.360541    15.195  6.813667  2.030595  17.21297  2.354734  3.777799
{txt}{space 8} {...}
{c |}{...}
 {res} 145.2916  10.24396  5.020148  5.059623  .4503224  63.92065  58.35214  45.03619  45.81473  .4791029  4.190495  .3024792  .2561829  .2225276  9.445942  2.112385
{txt}{space 8} {...}
{c |}{...}
 {res}     1092      1092      1092      1092      1092      1092      1092      1092      1092      1092      1092      1092      1092      1092      1092      1092
{txt}{hline 9}{c +}{hline 160}
{ralign 8:3} {...}
{c |}{...}
 {res} 635.9068  74.71296  2.972406  2.885677  .0887289   144.302  71.67381  84.35839  50.14189  .3564815   14.2974  .7209766  .1555763  .9675926     46.75  7.328704
{txt}{space 8} {...}
{c |}{...}
 {res}      900     184.5        12    12.001     6.251   280.001   230.001   194.401   330.001         1        31         2  .8548383         1        69        16
{txt}{space 8} {...}
{c |}{...}
 {res}      200        50       .65  .5843333      .001  55.55656      .001  48.88989      .001         0  3.083333         0         0         0        30         2
{txt}{space 8} {...}
{c |}{...}
 {res}      600        60  .6666667  .6676667      .001  100.6677  44.41767  65.41691  30.83433         0       7.5        .5  .0696593         1        40         6
{txt}{space 8} {...}
{c |}{...}
 {res} 666.6667      67.5  1.096212  1.081128      .001   139.251  67.68309  82.21244    41.926         0     13.01  .6666667  .1019859         1        47         7
{txt}{space 8} {...}
{c |}{...}
 {res} 669.6429        90  5.711494     5.551      .001  192.2801  109.3343    88.001  79.86767         1  22.33333  .9166667  .2158508         1        53         9
{txt}{space 8} {...}
{c |}{...}
 {res}-1.266622  1.932527  .8902064  .9394472  10.75686  .3517242   .593933  1.695315  3.318644  .5992926  .2663997  1.126935  1.637237 -5.281159   .106344  .5157057
{txt}{space 8} {...}
{c |}{...}
 {res} 6.888827  8.353749  2.559004  2.676282   136.431  2.022472  4.319969  7.290056   28.3622  1.359152  2.044743  7.141437  6.361081  28.89064  2.367911  5.192143
{txt}{space 8} {...}
{c |}{...}
 {res} 98.68603   21.8689  2.849835  2.795685  .4724152  48.41792  39.66022  27.73014  32.04194  .4800723  7.195967  .2751845  .1400299  .1774909  8.852933  1.889582
{txt}{space 8} {...}
{c |}{...}
 {res}      216       216       216       216       216       216       216       216       216       216       216       216       216       216       216       216
{txt}{hline 9}{c +}{hline 160}
{ralign 8:Total} {...}
{c |}{...}
 {res} 578.8977  13.72094  10.53354  10.43324  .1022968  161.0547  76.99251    107.13  87.62073  .2511429  3.887527  .7341273  .5495239  .9085714  53.41811  7.181337
{txt}{space 8} {...}
{c |}{...}
 {res}      900     184.5  57.14286  57.14386    14.001   400.001  281.8192   194.401   330.001         1        40         2         1         1        74        16
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1       .65      .001      .001    37.501      .001  48.88989      .001         0         0         0         0         0        30         0
{txt}{space 8} {...}
{c |}{...}
 {res} 480.7693       3.2         4     4.001      .001   110.001  25.93203  66.91269  56.79606         0  1.466667        .5  .2781986         1        46         6
{txt}{space 8} {...}
{c |}{...}
 {res} 598.2182         7  7.993507  7.778778      .001   150.001  64.28671    90.001    80.001         0       2.5  .6666667  .5906725         1        54         7
{txt}{space 8} {...}
{c |}{...}
 {res} 709.6168        15        14  13.85721      .001  195.2552  111.1816   145.797  107.7085         1  4.444445         1  .8348514         1        61         9
{txt}{space 8} {...}
{c |}{...}
 {res}-.2314149  3.037066  2.189898  2.186342  14.58392  1.043316  .9923791  .6102444  1.845325  1.147678  3.007987  .6990915 -.2890961 -2.835159 -.0934979 -.2964483
{txt}{space 8} {...}
{c |}{...}
 {res} 2.337524  14.81202   9.24061  9.218421  270.3449  4.318265  3.654805  2.012875  8.930563  2.317166  14.00051  6.006973  1.764545  9.038129  2.377847  3.553348
{txt}{space 8} {...}
{c |}{...}
 {res} 169.9787  19.08974  9.819429   9.84917  .6551709  71.16739   66.0285  49.01549  54.07995  .4337325  4.432035  .3139558  .3091745  .2882588  10.22611  2.287234
{txt}{space 8} {...}
{c |}{...}
 {res}     3500      3500      3500      3500      3500      3500      3500      3500      3500      3500      3500      3500      3500      3500      3500      3500
{txt}{hline 9}{c BT}{hline 160}

{ralign 8:caland} {...}
{c |}{...}
     train    health    status
{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res} .1053832  4.364507  .1879562
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 2.570404  -1.38422  1.597451
{txt}{space 8} {...}
{c |}{...}
 {res} 7.606975  5.591539  3.551849
{txt}{space 8} {...}
{c |}{...}
 {res} .3071166  .7918338  .3907663
{txt}{space 8} {...}
{c |}{...}
 {res}     2192      2192      2192
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res} .1620879  4.540293  .1446886
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}  1.83383 -1.346608  2.020039
{txt}{space 8} {...}
{c |}{...}
 {res} 4.362934  4.902349  5.080557
{txt}{space 8} {...}
{c |}{...}
 {res} .3687003  .6544126  .3519478
{txt}{space 8} {...}
{c |}{...}
 {res}     1092      1092      1092
{txt}{hline 9}{c +}{hline 30}
{ralign 8:3} {...}
{c |}{...}
 {res} .1527778  4.592593  .1759259
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 1.930229 -1.723968  1.702261
{txt}{space 8} {...}
{c |}{...}
 {res} 4.725782  7.403181  3.897694
{txt}{space 8} {...}
{c |}{...}
 {res} .3606089  .6256091  .3816416
{txt}{space 8} {...}
{c |}{...}
 {res}      216       216       216
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res}     .126  4.433429  .1737143
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 2.254035 -1.438974  1.722444
{txt}{space 8} {...}
{c |}{...}
 {res} 6.080673   5.78043  3.966814
{txt}{space 8} {...}
{c |}{...}
 {res} .3318968  .7471942  .3789177
{txt}{space 8} {...}
{c |}{...}
 {res}     3500      3500      3500
{txt}{hline 9}{c BT}{hline 30}

{com}. tabstat yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status if year==2015, by(caland) statistics(mean ma mi q sk k sd n)

{txt}Summary statistics: mean, max, min, p25, p50, p75, skewness, kurtosis, sd, N
  by categories of: caland 

{ralign 8:caland} {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s     plots   fstruct       job       sex       age      educ
{hline 9}{c +}{hline 160}
{ralign 8:1} {...}
{c |}{...}
 {res} 564.1739  4.218651   12.4939  12.37813   .117776  166.7006  76.91098  116.0407  81.15084  .1485261  2.043263  .7460906  .6711982         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      900       9.9  57.14286  57.14386    14.001   400.001  281.8192   194.401   330.001         1        69         2         1         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1       .65      .001      .001    37.501      .001  48.88989      .001         0         0         0         0         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      450         2     5.625  5.556555      .001   108.001  23.90576  73.33434   55.4545         0         1        .5  .4864085         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res} 545.4545         4        10    10.001      .001   150.001    65.001  106.8584    70.001         0      1.75       .75  .7703018         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res} 704.2866         6  16.66667  16.66767      .001   200.001  118.0663  159.2718  93.46671         0       2.5         1  .9054475         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}-.0095579  .4025566  1.999789  1.980593  12.62064   1.02803  .9207201  .2877833  2.140654  1.976679  18.35457  .5409469 -.9058945         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 2.310461  2.144667  8.822561  8.716626  187.2866  3.695958  3.557532  1.735255  9.834428  4.907259  563.5361  5.693756  2.696031         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 181.0372  2.484869  9.552781  9.549165  .8529517  81.49715  66.50607  50.03441   54.3281  .3557215  2.122904  .3168053  .2867413         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}     1764      1764      1764      1764      1764      1764      1764      1764      1764      1764      1764      1764      1764      1764      1764      1764
{txt}{hline 9}{c +}{hline 160}
{ralign 8:2} {...}
{c |}{...}
 {res} 596.5268  20.57279  5.591064  5.509099  .0839656  170.6974  78.82546  100.1742  72.39645  .3177756  5.292038  .7521032  .3995324         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      900        49  57.14286  57.14386     6.401   400.001  281.8192   194.401   330.001         1        40         2  .9863532         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      200        10       .65      .001      .001    37.501      .001  48.88989      .001         0      1.02         0         0         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      500      12.5         2  1.905762      .001   130.001    37.401    68.001  41.46767         0         3        .5  .1442179         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      600      17.4  4.368932  4.286714      .001  166.6677    65.001  87.11211  67.59029         0  4.285714  .6666667  .3972313         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res} 708.5714      25.1       7.5  7.369421      .001  202.5247  109.3343  124.5465  91.66766         1    6.0375         1  .6228137         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}-.3836697  1.112922  2.413881  2.400457  8.555931   .655585  1.126917  .9274571  1.224781  .7827313  3.210864  .9634747  .1391694         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 2.551694   3.26092  17.71212  17.49767  114.2001  4.006991  4.023856  2.874984  7.679557  1.612668  19.01557  6.436961   1.85899         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 158.1176  10.19985   4.72583  4.752005  .3593254  57.61792  61.47353  41.41379  42.44774  .4658431  3.788731  .2927938  .2788168         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}     1007      1007      1007      1007      1007      1007      1007      1007      1007      1007      1007      1007      1007      1007      1007      1007
{txt}{hline 9}{c +}{hline 160}
{ralign 8:3} {...}
{c |}{...}
 {res} 633.2883  79.84729  2.622331  2.586531  .0377999   140.225  76.46006  100.9354  44.72748  .2758621  14.21456  .7172414  .1578277         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res} 818.1818       197  12.22222  12.22322  1.561062  277.8354  212.6326   194.401  314.1519         1        45         2  .6278055         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      300        50       .65  .3518772      .001  56.66767      .001  48.88989      .001         0  3.194444         0         0         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      600        60       .65      .651      .001  109.0973  58.33433  70.21377  29.81052         0  7.692307        .5  .0653202         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res} 666.6667        72   .954955  .9343333      .001   111.001  69.84227  82.54068    37.401         0      12.8  .6666667  .1121566         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res} 692.9825        90       4.8  4.572429      .001  189.1677  113.3343  143.3343  67.55656         1      22.5         1  .2222354         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}-1.517956  1.397312  1.044942  1.063176  5.874636  .6647522  .2130204   .625079  4.590208  1.002972  .6200906  .8801812  1.286945         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 4.647202  5.530545  3.176358  3.204059   41.7607  2.324147  3.490922  2.243413   46.1599  2.005952  3.143735  6.296863  4.103389         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 112.9278  25.07232  2.537744  2.537923  .1734944  45.99621   36.4553  38.16108  27.52946  .4480526  7.502069  .2791319  .1397036         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}      203       203       203       203       203       203       203       203       203       203       203       203       203       203       203       203
{txt}{hline 9}{c +}{hline 160}
{ralign 8:Total} {...}
{c |}{...}
 {res} 579.8463  14.91846  9.482778  9.383909  .1008687  166.2467  77.52845  109.6372   75.7004  .2145259  3.974093  .7461573  .5441701         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      900       197  57.14286  57.14386    14.001   400.001  281.8192   194.401   330.001         1        69         2         1         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      200        .1       .65      .001      .001    37.501      .001  48.88989      .001         0         0         0         0         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res} 487.8049         3  3.555556  3.429571      .001  112.6326    35.001    70.001  48.14915         0       1.5        .5   .255467         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      600         7      6.75  6.667666      .001  154.1264    66.001  97.21211  67.55656         0  2.528175  .6666667  .5899139         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}      700      16.2  12.66667    12.501      .001   200.001  113.3343  143.3343    90.001         0      4.65         1  .8405104         0  52.46259  7.157753
{txt}{space 8} {...}
{c |}{...}
 {res}-.2078114    3.0273  2.251549  2.236972  14.53606   1.00882  .9895945   .527349  2.062576  1.390884  3.780369   .685522 -.2870397         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 2.412215  14.28016  10.72339  10.61555  261.7157  4.120481  3.838208  2.017778  10.40522  2.934558  27.06566  5.973938  1.722007         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 170.8705  21.17054   8.70822    8.7013  .6911576  72.51742  63.18855  47.15593  49.98291  .4105621  4.616772  .3064127  .3213101         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}     2974      2974      2974      2974      2974      2974      2974      2974      2974      2974      2974      2974      2974      2974      2974      2974
{txt}{hline 9}{c BT}{hline 160}

{ralign 8:caland} {...}
{c |}{...}
     train    health    status
{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res}        0         4  .1870748
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  1.604861
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .   3.57558
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0  .3900822
{txt}{space 8} {...}
{c |}{...}
 {res}     1764      1764      1764
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res}        0         4  .1449851
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  2.016638
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  5.066831
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0  .3522608
{txt}{space 8} {...}
{c |}{...}
 {res}     1007      1007      1007
{txt}{hline 9}{c +}{hline 30}
{ralign 8:3} {...}
{c |}{...}
 {res}        0         4   .182266
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  1.646019
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  3.709378
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0   .387018
{txt}{space 8} {...}
{c |}{...}
 {res}      203       203       203
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res}        0         4   .172495
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  1.733702
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  4.005723
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0  .3778736
{txt}{space 8} {...}
{c |}{...}
 {res}     2974      2974      2974
{txt}{hline 9}{c BT}{hline 30}

{com}. xtsum yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status

{txt}Variable         {c |}      Mean   Std. Dev.       Min        Max {c |}    Observations
{hline 17}{c +}{hline 44}{c +}{hline 16}
yield{col 10}overall {c |} {res} 562.9005   165.8127        200        900{txt} {c |}{col 69}N =   17859
{col 10}between {c |}{col 31}{res} 151.5504        200        900{txt} {c |}{col 69}n =    5294
{col 10}within  {c |}{col 31}{res} 83.03461   98.48251   1047.012{txt} {c |} T-bar = 3.37344
{col 18}{c |}{col 63}{c |}
land{col 10}overall {c |} {res} 12.04823   16.58741         .1      241.8{txt} {c |}{col 69}N =   17859
{col 10}between {c |}{col 31}{res} 15.98215         .1      112.5{txt} {c |}{col 69}n =    5294
{col 10}within  {c |}{col 31}{res} 5.499721  -51.20177   145.1682{txt} {c |} T-bar = 3.37344
{col 18}{c |}{col 63}{c |}
labor{col 10}overall {c |} {res} 10.99042   9.924317        .65   57.14286{txt} {c |}{col 69}N =   17859
{col 10}between {c |}{col 31}{res} 9.736148        .65   57.14286{txt} {c |}{col 69}n =    5294
{col 10}within  {c |}{col 31}{res} 3.863001  -20.56513   51.45626{txt} {c |} T-bar = 3.37344
{col 18}{c |}{col 63}{c |}
flabor{col 10}overall {c |} {res} 10.87309   9.952616       .001   57.14386{txt} {c |}{col 69}N =   17859
{col 10}between {c |}{col 31}{res}   9.7599       .001   57.14386{txt} {c |}{col 69}n =    5294
{col 10}within  {c |}{col 31}{res} 3.888854  -21.57136   51.33892{txt} {c |} T-bar = 3.37344
{col 18}{c |}{col 63}{c |}
elabor{col 10}overall {c |} {res}  .119336   .7062047       .001     14.001{txt} {c |}{col 69}N =   17859
{col 10}between {c |}{col 31}{res} .5183804       .001     10.001{txt} {c |}{col 69}n =    5294
{col 10}within  {c |}{col 31}{res} .5360988  -6.880664   11.31934{txt} {c |} T-bar = 3.37344
{col 18}{c |}{col 63}{c |}
fertile{col 10}overall {c |} {res} 159.3768   71.59058     37.501    400.001{txt} {c |}{col 69}N =   17859
{col 10}between {c |}{col 31}{res} 62.84721     37.501    400.001{txt} {c |}{col 69}n =    5294
{col 10}within  {c |}{col 31}{res} 37.84331  -65.62317   418.4602{txt} {c |} T-bar = 3.37344
{col 18}{c |}{col 63}{c |}
machane{col 10}overall {c |} {res} 67.42848   60.24885       .001   281.8192{txt} {c |}{col 69}N =   17859
{col 10}between {c |}{col 31}{res} 53.05736       .001   281.8192{txt} {c |}{col 69}n =    5294
{col 10}within  {c |}{col 31}{res} 31.14754  -108.0261    292.883{txt} {c |} T-bar = 3.37344
{col 18}{c |}{col 63}{c |}
ot{col 10}overall {c |} {res} 104.9037   47.80992   48.88989    194.401{txt} {c |}{col 69}N =   17859
{col 10}between {c |}{col 31}{res} 42.11371   48.88989    194.401{txt} {c |}{col 69}n =    5294
{col 10}within  {c |}{col 31}{res} 24.51335  -6.437523   219.6618{txt} {c |} T-bar = 3.37344
{col 18}{c |}{col 63}{c |}
subsidy{col 10}overall {c |} {res} 80.60202   50.08042       .001    330.001{txt} {c |}{col 69}N =   17859
{col 10}between {c |}{col 31}{res} 45.99557       .001    330.001{txt} {c |}{col 69}n =    5294
{col 10}within  {c |}{col 31}{res} 25.74152   -143.898    328.102{txt} {c |} T-bar = 3.37344
{col 18}{c |}{col 63}{c |}
insura~s{col 10}overall {c |} {res} .1839969   .3874925          0          1{txt} {c |}{col 69}N =   17859
{col 10}between {c |}{col 31}{res} .3152912          0          1{txt} {c |}{col 69}n =    5294
{col 10}within  {c |}{col 31}{res} .2221664  -.6160031   .9839969{txt} {c |} T-bar = 3.37344
{col 18}{c |}{col 63}{c |}
plots{col 10}overall {c |} {res} 3.677559   4.167931          0         90{txt} {c |}{col 69}N =   17859
{col 10}between {c |}{col 31}{res}   4.1838          0       67.5{txt} {c |}{col 69}n =    5294
{col 10}within  {c |}{col 31}{res} 1.125214  -41.32244   54.13756{txt} {c |} T-bar = 3.37344
{col 18}{c |}{col 63}{c |}
fstruct{col 10}overall {c |} {res} .7439561   .3580124          0          2{txt} {c |}{col 69}N =   17859
{col 10}between {c |}{col 31}{res} .2690951          0          2{txt} {c |}{col 69}n =    5294
{col 10}within  {c |}{col 31}{res} .2555624  -.6274724   2.343956{txt} {c |} T-bar = 3.37344
{col 18}{c |}{col 63}{c |}
job{col 10}overall {c |} {res} .5569459   .3065268          0          1{txt} {c |}{col 69}N =   17859
{col 10}between {c |}{col 31}{res}  .277239          0          1{txt} {c |}{col 69}n =    5294
{col 10}within  {c |}{col 31}{res} .1502358  -.2121856   1.347729{txt} {c |} T-bar = 3.37344
{col 18}{c |}{col 63}{c |}
sex{col 10}overall {c |} {res} .5743323   .4944577          0          1{txt} {c |}{col 69}N =   17859
{col 10}between {c |}{col 31}{res} .2756696          0          1{txt} {c |}{col 69}n =    5294
{col 10}within  {c |}{col 31}{res} .4392097  -.1756677   1.374332{txt} {c |} T-bar = 3.37344
{col 18}{c |}{col 63}{c |}
age{col 10}overall {c |} {res} 52.44047   8.193926         30         74{txt} {c |}{col 69}N =   17859
{col 10}between {c |}{col 31}{res} 6.985611         30         74{txt} {c |}{col 69}n =    5294
{col 10}within  {c |}{col 31}{res} 5.039114   25.07482   77.85543{txt} {c |} T-bar = 3.37344
{col 18}{c |}{col 63}{c |}
educ{col 10}overall {c |} {res} 7.157752      1.816          0         16{txt} {c |}{col 69}N =   17859
{col 10}between {c |}{col 31}{res} 1.536784          0         16{txt} {c |}{col 69}n =    5294
{col 10}within  {c |}{col 31}{res} 1.117296  -.1316857   14.11831{txt} {c |} T-bar = 3.37344
{col 18}{c |}{col 63}{c |}
train{col 10}overall {c |} {res} .0792878   .2701949          0          1{txt} {c |}{col 69}N =   17859
{col 10}between {c |}{col 31}{res} .2231042          0          1{txt} {c |}{col 69}n =    5294
{col 10}within  {c |}{col 31}{res} .1766004  -.6707122   .8792878{txt} {c |} T-bar = 3.37344
{col 18}{c |}{col 63}{c |}
health{col 10}overall {c |} {res} 4.278291   .6228061          1          5{txt} {c |}{col 69}N =   17859
{col 10}between {c |}{col 31}{res} .4899427          1          5{txt} {c |}{col 69}n =    5294
{col 10}within  {c |}{col 31}{res} .4301751   1.528291   6.528291{txt} {c |} T-bar = 3.37344
{col 18}{c |}{col 63}{c |}
status{col 10}overall {c |} {res} .1767176   .3814402          0          1{txt} {c |}{col 69}N =   17859
{col 10}between {c |}{col 31}{res} .3196505          0          1{txt} {c |}{col 69}n =    5294
{col 10}within  {c |}{col 31}{res} .2214743  -.6232824   .9767176{txt} {c |} T-bar = 3.37344

{com}. 
. **方差分析
. oneway yield caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}    yield
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 537.94818
  {txt}        2 {c |}  {res} 612.16917
  {txt}        3 {c |}  {res} 587.13861
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res}  562.9005

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 21013360.4      2   10506680.2    399.19     0.0000
{txt} Within groups     {res}  469972135  17856    26320.124
{txt}{hline 72}
    Total          {res}  490985495  17858    27493.868

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}187.8696{txt}  Prob>chi2 = {res}0.000

                        {txt}Comparison of yield by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}  74.221
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res} 49.1904   -25.0306
         {txt}{c |}  {res}    0.000      0.000
{txt}
{com}. //oneway income cland, mean bonferroni 
. //oneway profit cland, mean bonferroni 
. oneway labor caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   laboro,
            {c |} Winsorized
            {c |}  fraction
            {c |}     .01
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 13.787063
  {txt}        2 {c |}  {res} 6.2394423
  {txt}        3 {c |}  {res}  2.733525
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 10.990421

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 266934.604      2   133467.302   1597.38     0.0000
{txt} Within groups     {res} 1491936.72  17856   83.5538035
{txt}{hline 72}
    Total          {res} 1758871.32  17858   98.4920663

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 4.4e+03{txt}  Prob>chi2 = {res}0.000

           {txt}Comparison of laboro, Winsorized fraction .01 by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-7.54762
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res}-11.0535   -3.50592
         {txt}{c |}  {res}    0.000      0.000
{txt}
{com}. oneway flabor caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   flabor
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 13.662571
  {txt}        2 {c |}  {res} 6.1340285
  {txt}        3 {c |}  {res} 2.6389947
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 10.873085

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 265561.391      2   132780.696   1577.09     0.0000
{txt} Within groups     {res} 1503355.08  17856    84.193273
{txt}{hline 72}
    Total          {res} 1768916.47  17858   99.0545679

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 4.5e+03{txt}  Prob>chi2 = {res}0.000

                        {txt}Comparison of flabor by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-7.52854
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res}-11.0236   -3.49503
         {txt}{c |}  {res}    0.000      0.000
{txt}
{com}. oneway elabor caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   elabor
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .12649158
  {txt}        2 {c |}  {res} .10741376
  {txt}        3 {c |}  {res} .09653029
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} .11933602

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 1.77301185      2   .886505924      1.78     0.1691
{txt} Within groups     {res}  8904.4587  17856   .498681603
{txt}{hline 72}
    Total          {res} 8906.23171  17858   .498725037

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 1.4e+03{txt}  Prob>chi2 = {res}0.000

                        {txt}Comparison of elabor by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-.019078
         {txt}{c |}  {res}    0.297
         {txt}{c |}
       3 {c |}   {res}-.029961   -.010883
         {txt}{c |}  {res}    0.767      1.000
{txt}
{com}. oneway machane caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   machane
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 64.610149
  {txt}        2 {c |}  {res} 73.199153
  {txt}        3 {c |}  {res}  68.68713
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 67.428484

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 276380.524      2   138190.262     38.23     0.0000
{txt} Within groups     {res} 64546793.9  17856   3614.85181
{txt}{hline 72}
    Total          {res} 64823174.4  17858   3629.92353

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}252.0440{txt}  Prob>chi2 = {res}0.000

                       {txt}Comparison of machane by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}   8.589
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res} 4.07698   -4.51202
         {txt}{c |}  {res}    0.208      0.155
{txt}
{com}. oneway ot caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}     ot
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res}  108.6352
  {txt}        2 {c |}  {res} 99.025099
  {txt}        3 {c |}  {res} 90.576948
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 104.90368

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 508463.509      2   254231.755    112.61     0.0000
{txt} Within groups     {res}   40311147  17856   2257.56872
{txt}{hline 72}
    Total          {res} 40819610.5  17858   2285.78847

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}154.7564{txt}  Prob>chi2 = {res}0.000

                          {txt}Comparison of ot by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} -9.6101
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res}-18.0583   -8.44815
         {txt}{c |}  {res}    0.000      0.000
{txt}
{com}. oneway subsidy caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   subsidy
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 84.253582
  {txt}        2 {c |}  {res} 77.359482
  {txt}        3 {c |}  {res} 48.545887
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 80.602019

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 998539.765      2   499269.882    203.58     0.0000
{txt} Within groups     {res} 43790181.7  17856   2452.40713
{txt}{hline 72}
    Total          {res} 44788721.4  17858   2508.04801

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}678.9769{txt}  Prob>chi2 = {res}0.000

                       {txt}Comparison of subsidy by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} -6.8941
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res}-35.7077   -28.8136
         {txt}{c |}  {res}    0.000      0.000
{txt}
{com}. oneway insurance caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |} insurances
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .12606709
  {txt}        2 {c |}  {res} .28924868
  {txt}        3 {c |}  {res} .30588235
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} .18399686

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 111.178258      2   55.5891288    386.19     0.0000
{txt} Within groups     {res} 2570.20805  17856   .143940863
{txt}{hline 72}
    Total          {res}  2681.3863  17858   .150150426

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}840.8497{txt}  Prob>chi2 = {res}0.000

                      {txt}Comparison of insurances by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} .163182
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res} .179815    .016634
         {txt}{c |}  {res}    0.000      0.768
{txt}
{com}. oneway plots caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}    plots
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 2.0929051
  {txt}        2 {c |}  {res} 5.5308759
  {txt}        3 {c |}  {res} 14.382857
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 3.6775593

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 135674.153      2   67837.0763   6939.60     0.0000
{txt} Within groups     {res} 174548.737  17856   9.77535488
{txt}{hline 72}
    Total          {res} 310222.889  17858    17.371648

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 9.2e+03{txt}  Prob>chi2 = {res}0.000

                        {txt}Comparison of plots by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} 3.43797
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res}   12.29    8.85198
         {txt}{c |}  {res}    0.000      0.000
{txt}
{com}. oneway fstruct caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}  fstructs,
            {c |} Winsorized
            {c |}  fraction
            {c |}     .01
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .73873038
  {txt}        2 {c |}  {res} .75504353
  {txt}        3 {c |}  {res} .74350608
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} .74395613

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} .992599536      2   .496299768      3.87     0.0208
{txt} Within groups     {res}  2287.9192  17856   .128131675
{txt}{hline 72}
    Total          {res}  2288.9118  17858   .128172908

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 47.0823{txt}  Prob>chi2 = {res}0.000

          {txt}Comparison of fstructs, Winsorized fraction .01 by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} .016313
         {txt}{c |}  {res}    0.016
         {txt}{c |}
       3 {c |}   {res} .004776   -.011537
         {txt}{c |}  {res}    1.000      1.000
{txt}
{com}. oneway job caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}     job
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .64982171
  {txt}        2 {c |}  {res} .41356274
  {txt}        3 {c |}  {res} .17929358
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} .55694587

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 322.151363      2   161.075682   2121.44     0.0000
{txt} Within groups     {res} 1355.76298  17856   .075927586
{txt}{hline 72}
    Total          {res} 1677.91434  17858   .093958693

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}436.7492{txt}  Prob>chi2 = {res}0.000

                         {txt}Comparison of job by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-.236259
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res}-.470528   -.234269
         {txt}{c |}  {res}    0.000      0.000
{txt}
{com}. oneway sex caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}     sex
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .57109597
  {txt}        2 {c |}  {res}  .5883209
  {txt}        3 {c |}  {res} .52287582
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} .57433227

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res}   3.222667      2    1.6113335      6.59     0.0014
{txt} Within groups     {res} 4362.85125  17856   .244335307
{txt}{hline 72}
    Total          {res} 4366.07391  17858   .244488404

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}  0.4296{txt}  Prob>chi2 = {res}0.807

                         {txt}Comparison of sex by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} .017225
         {txt}{c |}  {res}    0.100
         {txt}{c |}
       3 {c |}   {res} -.04822   -.065445
         {txt}{c |}  {res}    0.027      0.002
{txt}
{com}. oneway age caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}    agee,
            {c |} Winsorized
            {c |}  fraction
            {c |}     .01
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 53.200062
  {txt}        2 {c |}  {res} 51.305338
  {txt}        3 {c |}  {res} 49.082033
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 52.440468

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 22402.7653      2   11201.3826    169.99     0.0000
{txt} Within groups     {res} 1176590.96  17856   65.8933108
{txt}{hline 72}
    Total          {res} 1198993.72  17858   67.1404258

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 93.4146{txt}  Prob>chi2 = {res}0.000

            {txt}Comparison of agee, Winsorized fraction .01 by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-1.89472
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res}-4.11803   -2.22331
         {txt}{c |}  {res}    0.000      0.000
{txt}
{com}. oneway educ caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}    educ
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 7.1230236
  {txt}        2 {c |}  {res} 7.2234738
  {txt}        3 {c |}  {res} 7.2119737
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 7.1577524

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 39.9792615      2   19.9896307      6.06     0.0023
{txt} Within groups     {res} 58853.1119  17856   3.29598521
{txt}{hline 72}
    Total          {res} 58893.0912  17858   3.29785481

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}271.8980{txt}  Prob>chi2 = {res}0.000

                         {txt}Comparison of educ by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}  .10045
         {txt}{c |}  {res}    0.002
         {txt}{c |}
       3 {c |}   {res}  .08895     -.0115
         {txt}{c |}  {res}    0.568      1.000
{txt}
{com}. oneway train caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}    train
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .07372596
  {txt}        2 {c |}  {res} .09059487
  {txt}        3 {c |}  {res} .08235294
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} .07928775

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 1.06871964      2   .534359819      7.32     0.0007
{txt} Within groups     {res} 1302.65982  17856   .072953619
{txt}{hline 72}
    Total          {res} 1303.72854  17858   .073005294

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 67.6529{txt}  Prob>chi2 = {res}0.000

                        {txt}Comparison of train by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} .016869
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res} .008627   -.008242
         {txt}{c |}  {res}    1.000      1.000
{txt}
{com}. oneway health caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   health
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 4.2378201
  {txt}        2 {c |}  {res} 4.3538294
  {txt}        3 {c |}  {res} 4.3490196
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 4.2782911

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 54.1876937      2   27.0938468     70.39     0.0000
{txt} Within groups     {res} 6872.70575  17856   .384896155
{txt}{hline 72}
    Total          {res} 6926.89344  17858   .387887414

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}105.9647{txt}  Prob>chi2 = {res}0.000

                        {txt}Comparison of health by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} .116009
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res} .111199    -.00481
         {txt}{c |}  {res}    0.000      1.000
{txt}
{com}. oneway status caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   status
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .19272226
  {txt}        2 {c |}  {res} .14480626
  {txt}        3 {c |}  {res} .16339869
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} .17671762

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 8.70404652      2   4.35202326     30.01     0.0000
{txt} Within groups     {res} 2589.57514  17856   .145025489
{txt}{hline 72}
    Total          {res} 2598.27919  17858   .145496651

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 95.5315{txt}  Prob>chi2 = {res}0.000

                        {txt}Comparison of status by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-.047916
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res}-.029324    .018592
         {txt}{c |}  {res}    0.117      0.617
{txt}
{com}. 
. ***生成交叉项
. g lnyield = ln(yield)
{txt}
{com}. g lnland = ln(land)
{txt}
{com}. g lnlabor = ln(labor)
{txt}
{com}. g lnflabor = ln(flabor)
{txt}
{com}. g lnelabor = ln(elabor)
{txt}
{com}. g lnfertile = ln(fertile)
{txt}
{com}. g lnmachane = ln(machane)
{txt}
{com}. g lnot = ln(ot)
{txt}
{com}. g lnsubsidy = ln(subsidy)
{txt}
{com}. g lninsurance = ln(insurance)
{txt}(14,573 missing values generated)

{com}. g lnland2 = lnland^2
{txt}
{com}. g lnlabor2 = lnlabor^2
{txt}
{com}. g lnflabor2 = lnflabor^2
{txt}
{com}. g lnelabor2 = lnelabor^2
{txt}
{com}. g lnfertile2 = lnfertile^2
{txt}
{com}. g lnmachane2 = lnmachane^2
{txt}
{com}. g lnot2 = lnot^2
{txt}
{com}. g lnlaborlnfertile = lnlabor*lnfertile
{txt}
{com}. g lnlaborlnmachane = lnlabor*lnmachane
{txt}
{com}. g lnlaborlnot = lnlabor*lnot
{txt}
{com}. g lnflaborlnelabor = lnflabor*lnelabor
{txt}
{com}. g lnflaborlnfertile = lnflabor*lnfertile
{txt}
{com}. g lnflaborlnmachane = lnflabor*lnmachane
{txt}
{com}. g lnflaborlnot = lnflabor*lnot
{txt}
{com}. g lnelaborlnfertile = lnelabor*lnfertile
{txt}
{com}. g lnelaborlnmachane = lnelabor*lnmachane
{txt}
{com}. g lnelaborlnot = lnelabor*lnot
{txt}
{com}. g lnfertilelnmachane = lnfertile*lnmachane
{txt}
{com}. g lnfertilelnot = lnfertile*lnot
{txt}
{com}. g lnmachanelnot = lnmachane*lnot
{txt}
{com}. 
. **简单的相关性检验
. //reg lnprofit lnland
. pwcorr lnyield lnland,sig

             {txt}{c |}  lnyield   lnland
{hline 13}{c +}{hline 18}
     lnyield {c |} {res}  1.0000 
             {txt}{c |}
             {c |}
      lnland {c |} {res}  0.2535   1.0000 
             {txt}{c |}{res}   0.0000
             {txt}{c |}

{com}. //pwcorr lnprofit lnland,sig
. qui reg lnyield lnland land lnlabor lnfertile lnmachane lnot lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy
{txt}
{com}. estat vif

{txt}    Variable {c |}       VIF       1/VIF  
{hline 13}{c +}{hline 22}
{space 7}lnot2 {c |} {res}   619.43    0.001614
{txt}{space 8}lnot {c |} {res}   576.29    0.001735
{txt}lnfertilel~t {c |} {res}   350.28    0.002855
{txt}{space 2}lnfertile2 {c |} {res}   268.97    0.003718
{txt}{space 3}lnfertile {c |} {res}   261.15    0.003829
{txt}{space 5}lnlabor {c |} {res}   189.28    0.005283
{txt}{space 3}lnmachane {c |} {res}   174.91    0.005717
{txt}lnlaborlnf~e {c |} {res}   163.92    0.006100
{txt}{space 1}lnlaborlnot {c |} {res}   144.99    0.006897
{txt}lnmachanel~t {c |} {res}   114.00    0.008772
{txt}lnfertilel~e {c |} {res}   111.31    0.008984
{txt}{space 4}lnlabor2 {c |} {res}    14.91    0.067056
{txt}lnlaborlnm~e {c |} {res}     9.98    0.100182
{txt}{space 8}land {c |} {res}     4.26    0.234827
{txt}{space 6}lnland {c |} {res}     4.20    0.238207
{txt}{space 2}lnmachane2 {c |} {res}     3.25    0.307937
{txt}{space 7}plots {c |} {res}     2.63    0.380432
{txt}{space 9}job {c |} {res}     1.31    0.763209
{txt}{space 6}health {c |} {res}     1.31    0.764943
{txt}{space 9}age {c |} {res}     1.23    0.812008
{txt}{space 9}sex {c |} {res}     1.22    0.821682
{txt}{space 8}educ {c |} {res}     1.12    0.890042
{txt}{space 2}insurances {c |} {res}     1.12    0.895807
{txt}{space 7}train {c |} {res}     1.08    0.925892
{txt}{space 8}loan {c |} {res}     1.07    0.932451
{txt}{space 3}lnsubsidy {c |} {res}     1.06    0.946896
{txt}{space 6}status {c |} {res}     1.02    0.976877
{txt}{space 5}fstruct {c |} {res}     1.01    0.989931
{txt}{hline 13}{c +}{hline 22}
    Mean VIF {c |} {res}   108.08
{txt}
{com}. qui reg lnyield lnland land lnlabor lnfertile lnmachane lnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy
{txt}
{com}. estat vif

{txt}    Variable {c |}       VIF       1/VIF  
{hline 13}{c +}{hline 22}
{space 8}land {c |} {res}     3.64    0.274621
{txt}{space 6}lnland {c |} {res}     3.58    0.279219
{txt}{space 7}plots {c |} {res}     2.43    0.411028
{txt}{space 5}lnlabor {c |} {res}     1.85    0.540757
{txt}{space 6}health {c |} {res}     1.29    0.772764
{txt}{space 9}job {c |} {res}     1.29    0.772847
{txt}{space 9}age {c |} {res}     1.23    0.814559
{txt}{space 9}sex {c |} {res}     1.21    0.825213
{txt}{space 3}lnmachane {c |} {res}     1.21    0.827760
{txt}{space 3}lnfertile {c |} {res}     1.19    0.837956
{txt}{space 8}lnot {c |} {res}     1.18    0.848063
{txt}{space 8}educ {c |} {res}     1.12    0.893945
{txt}{space 2}insurances {c |} {res}     1.09    0.913617
{txt}{space 7}train {c |} {res}     1.07    0.932841
{txt}{space 8}loan {c |} {res}     1.04    0.958770
{txt}{space 3}lnsubsidy {c |} {res}     1.04    0.963459
{txt}{space 6}status {c |} {res}     1.02    0.979237
{txt}{space 5}fstruct {c |} {res}     1.01    0.991996
{txt}{hline 13}{c +}{hline 22}
    Mean VIF {c |} {res}     1.53
{txt}
{com}. pwcorr lnlabor lnfertile lnmachane lnot  lnlabor2 lnfertile2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot

             {txt}{c |}  lnlabor lnfer~le lnmach~e     lnot lnlabor2 lnfert~2    lnot2
{hline 13}{c +}{hline 63}
     lnlabor {c |} {res}  1.0000 
   {txt}lnfertile {c |} {res}  0.0421   1.0000 
   {txt}lnmachane {c |} {res} -0.2455   0.1338   1.0000 
        {txt}lnot {c |} {res}  0.1169   0.3137   0.0279   1.0000 
    {txt}lnlabor2 {c |} {res}  0.9472   0.0148  -0.2650   0.1031   1.0000 
  {txt}lnfertile2 {c |} {res}  0.0519   0.9976   0.1285   0.3155   0.0247   1.0000 
       {txt}lnot2 {c |} {res}  0.1208   0.3109   0.0243   0.9990   0.1074   0.3131   1.0000 
{txt}lnlaborlnf~e {c |} {res}  0.9718   0.2590  -0.2033   0.1814   0.9213   0.2683   0.1846 
{txt}lnlaborlnm~e {c |} {res} -0.0132   0.1541   0.9136   0.0909  -0.0778   0.1519   0.0886 
 {txt}lnlaborlnot {c |} {res}  0.9717   0.1102  -0.2172   0.3288   0.9225   0.1201   0.3327 
{txt}lnfertilel~e {c |} {res} -0.2348   0.1701   0.9938   0.0411  -0.2576   0.1661   0.0373 
{txt}lnfertilel~t {c |} {res}  0.1025   0.7947   0.0962   0.8227   0.0778   0.7960   0.8212 
{txt}lnmachanel~t {c |} {res} -0.2265   0.1472   0.9936   0.0744  -0.2454   0.1425   0.0711 

             {txt}{c |} lnlab~le lnlab~ne lnlabo~t lnfer~ne lnfert~t lnmach~t
{hline 13}{c +}{hline 54}
lnlaborlnf~e {c |} {res}  1.0000 
{txt}lnlaborlnm~e {c |} {res}  0.0246   1.0000 
 {txt}lnlaborlnot {c |} {res}  0.9622   0.0173   1.0000 
{txt}lnfertilel~e {c |} {res} -0.1870   0.9098  -0.2045   1.0000 
{txt}lnfertilel~t {c |} {res}  0.2732   0.1500   0.2777   0.1267   1.0000 
{txt}lnmachanel~t {c |} {res} -0.1824   0.9107  -0.1912   0.9911   0.1344   1.0000 
{txt}
{com}. 
. xtreg lnlabor lnland lnland2,fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    17,859
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     5,294

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.1139{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.4355{col 63}{txt}avg{col 67}={col 69}{res}       3.4
{txt}     overall = {res}0.3972{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}5293{txt}){col 67}={col 70}{res}   436.18
{txt}corr(u_i, Xb){col 16}= {res}0.2459{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:5,294} clusters in id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     lnlabor{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}lnland {c |}{col 14}{res}{space 2}-.3027926{col 26}{space 2} .0228847{col 37}{space 1}  -13.23{col 46}{space 3}0.000{col 54}{space 4} -.347656{col 67}{space 3}-.2579291
{txt}{space 5}lnland2 {c |}{col 14}{res}{space 2}-.0181285{col 26}{space 2} .0052874{col 37}{space 1}   -3.43{col 46}{space 3}0.001{col 54}{space 4}-.0284941{col 67}{space 3} -.007763
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.674699{col 26}{space 2} .0258443{col 37}{space 1}  103.49{col 46}{space 3}0.000{col 54}{space 4} 2.624033{col 67}{space 3} 2.725364
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .69475142
     {txt}sigma_e {c |} {res} .33949956
         {txt}rho {c |} {res}  .8072381{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. xtreg lnflabor lnland lnland2,fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    17,859
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     5,294

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0541{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.3038{col 63}{txt}avg{col 67}={col 69}{res}       3.4
{txt}     overall = {res}0.2998{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}5293{txt}){col 67}={col 70}{res}   250.47
{txt}corr(u_i, Xb){col 16}= {res}0.1817{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:5,294} clusters in id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    lnflabor{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}lnland {c |}{col 14}{res}{space 2}-.2900351{col 26}{space 2} .0315287{col 37}{space 1}   -9.20{col 46}{space 3}0.000{col 54}{space 4}-.3518444{col 67}{space 3}-.2282258
{txt}{space 5}lnland2 {c |}{col 14}{res}{space 2}-.0280861{col 26}{space 2} .0065889{col 37}{space 1}   -4.26{col 46}{space 3}0.000{col 54}{space 4}-.0410031{col 67}{space 3}-.0151691
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.648188{col 26}{space 2} .0380491{col 37}{space 1}   69.60{col 46}{space 3}0.000{col 54}{space 4} 2.573596{col 67}{space 3}  2.72278
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .89665096
     {txt}sigma_e {c |} {res} .54147791
         {txt}rho {c |} {res}  .7327713{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. xtreg lnelabor lnland lnland2,fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    17,859
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     5,294

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0119{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.0022{col 63}{txt}avg{col 67}={col 69}{res}       3.4
{txt}     overall = {res}0.0058{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}5293{txt}){col 67}={col 70}{res}    43.58
{txt}corr(u_i, Xb){col 16}= {res}-0.2415{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:5,294} clusters in id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    lnelabor{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}lnland {c |}{col 14}{res}{space 2} .1757998{col 26}{space 2} .0638966{col 37}{space 1}    2.75{col 46}{space 3}0.006{col 54}{space 4} .0505361{col 67}{space 3} .3010635
{txt}{space 5}lnland2 {c |}{col 14}{res}{space 2}   .07382{col 26}{space 2}  .017413{col 37}{space 1}    4.24{col 46}{space 3}0.000{col 54}{space 4} .0396834{col 67}{space 3} .1079566
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-7.007794{col 26}{space 2} .0834112{col 37}{space 1}  -84.01{col 46}{space 3}0.000{col 54}{space 4}-7.171314{col 67}{space 3}-6.844273
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 1.6574087
     {txt}sigma_e {c |} {res} 1.3803059
         {txt}rho {c |} {res} .59046801{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. xtreg lnfertile lnland lnland2,fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    17,859
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     5,294

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0308{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.0031{col 63}{txt}avg{col 67}={col 69}{res}       3.4
{txt}     overall = {res}0.0022{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}5293{txt}){col 67}={col 70}{res}    83.94
{txt}corr(u_i, Xb){col 16}= {res}-0.3877{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:5,294} clusters in id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   lnfertile{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}lnland {c |}{col 14}{res}{space 2}-.2349774{col 26}{space 2} .0214704{col 37}{space 1}  -10.94{col 46}{space 3}0.000{col 54}{space 4}-.2770682{col 67}{space 3}-.1928866
{txt}{space 5}lnland2 {c |}{col 14}{res}{space 2}    .0302{col 26}{space 2} .0046339{col 37}{space 1}    6.52{col 46}{space 3}0.000{col 54}{space 4} .0211155{col 67}{space 3} .0392844
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.265496{col 26}{space 2}  .023029{col 37}{space 1}  228.65{col 46}{space 3}0.000{col 54}{space 4}  5.22035{col 67}{space 3} 5.310643
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .45427855
     {txt}sigma_e {c |} {res} .28332455
         {txt}rho {c |} {res} .71995432{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. xtreg lnmachane lnland lnland2,fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    17,859
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     5,294

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0006{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.2076{col 63}{txt}avg{col 67}={col 69}{res}       3.4
{txt}     overall = {res}0.1508{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}5293{txt}){col 67}={col 70}{res}     2.00
{txt}corr(u_i, Xb){col 16}= {res}0.4082{txt}{col 49}Prob > F{col 67}={col 73}{res}0.1358

{txt}{ralign 78:(Std. Err. adjusted for {res:5,294} clusters in id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   lnmachane{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}lnland {c |}{col 14}{res}{space 2} .2724517{col 26}{space 2} .1489106{col 37}{space 1}    1.83{col 46}{space 3}0.067{col 54}{space 4}-.0194745{col 67}{space 3} .5643779
{txt}{space 5}lnland2 {c |}{col 14}{res}{space 2}-.0342617{col 26}{space 2} .0309815{col 37}{space 1}   -1.11{col 46}{space 3}0.269{col 54}{space 4}-.0949983{col 67}{space 3} .0264748
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.917121{col 26}{space 2} .1741776{col 37}{space 1}   11.01{col 46}{space 3}0.000{col 54}{space 4} 1.575661{col 67}{space 3} 2.258581
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res}  3.754885
     {txt}sigma_e {c |} {res} 2.4811671
         {txt}rho {c |} {res} .69607093{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. xtreg lnot lnland lnland2,fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    17,859
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     5,294

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0159{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.0024{col 63}{txt}avg{col 67}={col 69}{res}       3.4
{txt}     overall = {res}0.0040{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}5293{txt}){col 67}={col 70}{res}    50.21
{txt}corr(u_i, Xb){col 16}= {res}-0.1875{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:5,294} clusters in id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        lnot{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}lnland {c |}{col 14}{res}{space 2}-.1593844{col 26}{space 2} .0184957{col 37}{space 1}   -8.62{col 46}{space 3}0.000{col 54}{space 4}-.1956437{col 67}{space 3}-.1231251
{txt}{space 5}lnland2 {c |}{col 14}{res}{space 2} .0194209{col 26}{space 2} .0043069{col 37}{space 1}    4.51{col 46}{space 3}0.000{col 54}{space 4} .0109775{col 67}{space 3} .0278642
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   4.7572{col 26}{space 2} .0205902{col 37}{space 1}  231.04{col 46}{space 3}0.000{col 54}{space 4} 4.716835{col 67}{space 3} 4.797565
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .40783432
     {txt}sigma_e {c |} {res} .27476248
         {txt}rho {c |} {res} .68781158{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. 
. **混合回归、固定效应回归or随机效应回归？
. qui xtreg lnyield lnland land lnlabor lnfertile lnmachane lnot lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy, re r
{txt}
{com}. xtoverid

{txt}Test of overidentifying restrictions: fixed vs random effects
Cross-section time-series model: xtreg re  robust cluster(id)
Sargan-Hansen statistic{res}{col 25}1154.721{txt}  Chi-sq({res}28{txt}){col 47}P-value = {res}0.0000
{txt}
{com}. reg lnyield lnland land lnlabor lnfertile lnmachane lnot lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy i.sm i.year, vce(cluster id)

{txt}Linear regression                               Number of obs     = {res}    17,859
                                                {txt}F(41, 5293)       =  {res}   131.46
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.3401
                                                {txt}Root MSE          =    {res} .26761

{txt}{ralign 84:(Std. Err. adjusted for {res:5,294} clusters in id)}
{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}           lnyield{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}lnland {c |}{col 20}{res}{space 2} .0315184{col 32}{space 2} .0054859{col 43}{space 1}    5.75{col 52}{space 3}0.000{col 60}{space 4} .0207638{col 73}{space 3}  .042273
{txt}{space 14}land {c |}{col 20}{res}{space 2}-.0012529{col 32}{space 2} .0003047{col 43}{space 1}   -4.11{col 52}{space 3}0.000{col 60}{space 4}-.0018503{col 73}{space 3}-.0006556
{txt}{space 11}lnlabor {c |}{col 20}{res}{space 2}-.1554038{col 32}{space 2}  .043307{col 43}{space 1}   -3.59{col 52}{space 3}0.000{col 60}{space 4}-.2403033{col 73}{space 3}-.0705043
{txt}{space 9}lnfertile {c |}{col 20}{res}{space 2}-.0483671{col 32}{space 2} .0962971{col 43}{space 1}   -0.50{col 52}{space 3}0.615{col 60}{space 4}-.2371491{col 73}{space 3}  .140415
{txt}{space 9}lnmachane {c |}{col 20}{res}{space 2}-.0122652{col 32}{space 2} .0087228{col 43}{space 1}   -1.41{col 52}{space 3}0.160{col 60}{space 4}-.0293656{col 73}{space 3} .0048351
{txt}{space 14}lnot {c |}{col 20}{res}{space 2}  .128369{col 32}{space 2} .1336304{col 43}{space 1}    0.96{col 52}{space 3}0.337{col 60}{space 4}-.1336018{col 73}{space 3} .3903397
{txt}{space 10}lnlabor2 {c |}{col 20}{res}{space 2} .0064884{col 32}{space 2} .0032869{col 43}{space 1}    1.97{col 52}{space 3}0.048{col 60}{space 4} .0000447{col 73}{space 3} .0129321
{txt}{space 8}lnfertile2 {c |}{col 20}{res}{space 2} .0075851{col 32}{space 2} .0096835{col 43}{space 1}    0.78{col 52}{space 3}0.433{col 60}{space 4}-.0113986{col 73}{space 3} .0265688
{txt}{space 8}lnmachane2 {c |}{col 20}{res}{space 2}  .006636{col 32}{space 2} .0003465{col 43}{space 1}   19.15{col 52}{space 3}0.000{col 60}{space 4} .0059566{col 73}{space 3} .0073153
{txt}{space 13}lnot2 {c |}{col 20}{res}{space 2} -.019129{col 32}{space 2} .0148716{col 43}{space 1}   -1.29{col 52}{space 3}0.198{col 60}{space 4}-.0482835{col 73}{space 3} .0100256
{txt}{space 2}lnlaborlnfertile {c |}{col 20}{res}{space 2} .0198301{col 32}{space 2} .0076097{col 43}{space 1}    2.61{col 52}{space 3}0.009{col 60}{space 4} .0049119{col 73}{space 3} .0347484
{txt}{space 2}lnlaborlnmachane {c |}{col 20}{res}{space 2}-.0021033{col 32}{space 2} .0008474{col 43}{space 1}   -2.48{col 52}{space 3}0.013{col 60}{space 4}-.0037645{col 73}{space 3}-.0004421
{txt}{space 7}lnlaborlnot {c |}{col 20}{res}{space 2} .0028232{col 32}{space 2} .0074499{col 43}{space 1}    0.38{col 52}{space 3}0.705{col 60}{space 4}-.0117817{col 73}{space 3} .0174282
{txt}lnfertilelnmachane {c |}{col 20}{res}{space 2} .0020532{col 32}{space 2} .0013667{col 43}{space 1}    1.50{col 52}{space 3}0.133{col 60}{space 4}-.0006261{col 73}{space 3} .0047324
{txt}{space 5}lnfertilelnot {c |}{col 20}{res}{space 2} .0206843{col 32}{space 2} .0142104{col 43}{space 1}    1.46{col 52}{space 3}0.146{col 60}{space 4} -.007174{col 73}{space 3} .0485427
{txt}{space 5}lnmachanelnot {c |}{col 20}{res}{space 2} .0078422{col 32}{space 2} .0015023{col 43}{space 1}    5.22{col 52}{space 3}0.000{col 60}{space 4}  .004897{col 73}{space 3} .0107873
{txt}{space 15}sex {c |}{col 20}{res}{space 2}-.0233455{col 32}{space 2} .0106195{col 43}{space 1}   -2.20{col 52}{space 3}0.028{col 60}{space 4}-.0441641{col 73}{space 3}-.0025268
{txt}{space 15}age {c |}{col 20}{res}{space 2}  .000508{col 32}{space 2} .0003241{col 43}{space 1}    1.57{col 52}{space 3}0.117{col 60}{space 4}-.0001273{col 73}{space 3} .0011434
{txt}{space 14}educ {c |}{col 20}{res}{space 2} .0000689{col 32}{space 2} .0014251{col 43}{space 1}    0.05{col 52}{space 3}0.961{col 60}{space 4}-.0027249{col 73}{space 3} .0028627
{txt}{space 13}train {c |}{col 20}{res}{space 2} .0121367{col 32}{space 2} .0102277{col 43}{space 1}    1.19{col 52}{space 3}0.235{col 60}{space 4}-.0079137{col 73}{space 3} .0321872
{txt}{space 12}health {c |}{col 20}{res}{space 2} .0375575{col 32}{space 2} .0046079{col 43}{space 1}    8.15{col 52}{space 3}0.000{col 60}{space 4} .0285242{col 73}{space 3} .0465909
{txt}{space 12}status {c |}{col 20}{res}{space 2}-.0051103{col 32}{space 2} .0070077{col 43}{space 1}   -0.73{col 52}{space 3}0.466{col 60}{space 4}-.0188483{col 73}{space 3} .0086278
{txt}{space 11}fstruct {c |}{col 20}{res}{space 2} .0289707{col 32}{space 2} .0064383{col 43}{space 1}    4.50{col 52}{space 3}0.000{col 60}{space 4} .0163489{col 73}{space 3} .0415925
{txt}{space 13}plots {c |}{col 20}{res}{space 2} -.001029{col 32}{space 2} .0010888{col 43}{space 1}   -0.95{col 52}{space 3}0.345{col 60}{space 4}-.0031634{col 73}{space 3} .0011055
{txt}{space 8}insurances {c |}{col 20}{res}{space 2}-.0398956{col 32}{space 2} .0074812{col 43}{space 1}   -5.33{col 52}{space 3}0.000{col 60}{space 4}-.0545618{col 73}{space 3}-.0252294
{txt}{space 14}loan {c |}{col 20}{res}{space 2} .0103213{col 32}{space 2} .0109946{col 43}{space 1}    0.94{col 52}{space 3}0.348{col 60}{space 4}-.0112326{col 73}{space 3} .0318753
{txt}{space 15}job {c |}{col 20}{res}{space 2}-.0040546{col 32}{space 2} .0103969{col 43}{space 1}   -0.39{col 52}{space 3}0.697{col 60}{space 4}-.0244368{col 73}{space 3} .0163276
{txt}{space 9}lnsubsidy {c |}{col 20}{res}{space 2}-.0041673{col 32}{space 2} .0015468{col 43}{space 1}   -2.69{col 52}{space 3}0.007{col 60}{space 4}-.0071998{col 73}{space 3}-.0011349
{txt}{space 18} {c |}
{space 16}sm {c |}
{space 15}14  {c |}{col 20}{res}{space 2} .0865377{col 32}{space 2} .0125542{col 43}{space 1}    6.89{col 52}{space 3}0.000{col 60}{space 4} .0619263{col 73}{space 3} .1111491
{txt}{space 15}15  {c |}{col 20}{res}{space 2}  .270745{col 32}{space 2}  .017983{col 43}{space 1}   15.06{col 52}{space 3}0.000{col 60}{space 4}  .235491{col 73}{space 3}  .305999
{txt}{space 15}21  {c |}{col 20}{res}{space 2} .1626861{col 32}{space 2} .0096037{col 43}{space 1}   16.94{col 52}{space 3}0.000{col 60}{space 4}  .143859{col 73}{space 3} .1815133
{txt}{space 15}22  {c |}{col 20}{res}{space 2} .2087317{col 32}{space 2} .0116167{col 43}{space 1}   17.97{col 52}{space 3}0.000{col 60}{space 4} .1859581{col 73}{space 3} .2315053
{txt}{space 15}23  {c |}{col 20}{res}{space 2} .1024846{col 32}{space 2} .0120983{col 43}{space 1}    8.47{col 52}{space 3}0.000{col 60}{space 4} .0787669{col 73}{space 3} .1262022
{txt}{space 15}61  {c |}{col 20}{res}{space 2}-.0708681{col 32}{space 2} .0132463{col 43}{space 1}   -5.35{col 52}{space 3}0.000{col 60}{space 4}-.0968363{col 73}{space 3}   -.0449
{txt}{space 15}62  {c |}{col 20}{res}{space 2} .0449502{col 32}{space 2} .0168462{col 43}{space 1}    2.67{col 52}{space 3}0.008{col 60}{space 4} .0119248{col 73}{space 3} .0779756
{txt}{space 15}64  {c |}{col 20}{res}{space 2} .1492344{col 32}{space 2} .0179324{col 43}{space 1}    8.32{col 52}{space 3}0.000{col 60}{space 4} .1140795{col 73}{space 3} .1843893
{txt}{space 15}65  {c |}{col 20}{res}{space 2}-.2180624{col 32}{space 2} .0299348{col 43}{space 1}   -7.28{col 52}{space 3}0.000{col 60}{space 4} -.276747{col 73}{space 3}-.1593778
{txt}{space 18} {c |}
{space 14}year {c |}
{space 13}2012  {c |}{col 20}{res}{space 2} .0070295{col 32}{space 2} .0043862{col 43}{space 1}    1.60{col 52}{space 3}0.109{col 60}{space 4}-.0015692{col 73}{space 3} .0156282
{txt}{space 13}2013  {c |}{col 20}{res}{space 2}-.0177631{col 32}{space 2} .0112231{col 43}{space 1}   -1.58{col 52}{space 3}0.114{col 60}{space 4}-.0397651{col 73}{space 3} .0042388
{txt}{space 13}2014  {c |}{col 20}{res}{space 2} .0090734{col 32}{space 2} .0059204{col 43}{space 1}    1.53{col 52}{space 3}0.125{col 60}{space 4} -.002533{col 73}{space 3} .0206798
{txt}{space 13}2015  {c |}{col 20}{res}{space 2} -.014294{col 32}{space 2}  .011805{col 43}{space 1}   -1.21{col 52}{space 3}0.226{col 60}{space 4}-.0374368{col 73}{space 3} .0088487
{txt}{space 18} {c |}
{space 13}_cons {c |}{col 20}{res}{space 2} 5.209002{col 32}{space 2} .3970443{col 43}{space 1}   13.12{col 52}{space 3}0.000{col 60}{space 4} 4.430632{col 73}{space 3} 5.987373
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. xtreg lnyield lnland land lnlabor lnfertile lnmachane lnot lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy i.year, re r
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}    17,859
{txt}Group variable: {res}id                              {txt}Number of groups  = {res}     5,294

{txt}R-sq:                                           Obs per group:
     within  = {res}0.0259                                         {txt}min = {res}         1
{txt}     between = {res}0.3515                                         {txt}avg = {res}       3.4
{txt}     overall = {res}0.2569                                         {txt}max = {res}         5

                                                {txt}Wald chi2({res}32{txt})     =  {res}  2179.59
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2       =     {res}0.0000

{txt}{ralign 84:(Std. Err. adjusted for {res:5,294} clusters in id)}
{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}           lnyield{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}lnland {c |}{col 20}{res}{space 2} .0728279{col 32}{space 2} .0051433{col 43}{space 1}   14.16{col 52}{space 3}0.000{col 60}{space 4} .0627473{col 73}{space 3} .0829085
{txt}{space 14}land {c |}{col 20}{res}{space 2}-.0014172{col 32}{space 2} .0002881{col 43}{space 1}   -4.92{col 52}{space 3}0.000{col 60}{space 4}-.0019818{col 73}{space 3}-.0008525
{txt}{space 11}lnlabor {c |}{col 20}{res}{space 2}-.0603109{col 32}{space 2} .0381313{col 43}{space 1}   -1.58{col 52}{space 3}0.114{col 60}{space 4}-.1350469{col 73}{space 3} .0144251
{txt}{space 9}lnfertile {c |}{col 20}{res}{space 2} .1753339{col 32}{space 2}   .08437{col 43}{space 1}    2.08{col 52}{space 3}0.038{col 60}{space 4} .0099717{col 73}{space 3} .3406961
{txt}{space 9}lnmachane {c |}{col 20}{res}{space 2} .0101118{col 32}{space 2} .0077457{col 43}{space 1}    1.31{col 52}{space 3}0.192{col 60}{space 4}-.0050696{col 73}{space 3} .0252932
{txt}{space 14}lnot {c |}{col 20}{res}{space 2}  .168343{col 32}{space 2} .1114067{col 43}{space 1}    1.51{col 52}{space 3}0.131{col 60}{space 4}-.0500101{col 73}{space 3} .3866961
{txt}{space 10}lnlabor2 {c |}{col 20}{res}{space 2}  .008315{col 32}{space 2} .0027661{col 43}{space 1}    3.01{col 52}{space 3}0.003{col 60}{space 4} .0028936{col 73}{space 3} .0137364
{txt}{space 8}lnfertile2 {c |}{col 20}{res}{space 2} .0154555{col 32}{space 2} .0086133{col 43}{space 1}    1.79{col 52}{space 3}0.073{col 60}{space 4}-.0014262{col 73}{space 3} .0323373
{txt}{space 8}lnmachane2 {c |}{col 20}{res}{space 2} .0044911{col 32}{space 2} .0003237{col 43}{space 1}   13.87{col 52}{space 3}0.000{col 60}{space 4} .0038566{col 73}{space 3} .0051256
{txt}{space 13}lnot2 {c |}{col 20}{res}{space 2} .0107924{col 32}{space 2} .0123229{col 43}{space 1}    0.88{col 52}{space 3}0.381{col 60}{space 4}-.0133601{col 73}{space 3} .0349449
{txt}{space 2}lnlaborlnfertile {c |}{col 20}{res}{space 2} .0056144{col 32}{space 2}  .006773{col 43}{space 1}    0.83{col 52}{space 3}0.407{col 60}{space 4}-.0076605{col 73}{space 3} .0188893
{txt}{space 2}lnlaborlnmachane {c |}{col 20}{res}{space 2} .0001606{col 32}{space 2} .0007661{col 43}{space 1}    0.21{col 52}{space 3}0.834{col 60}{space 4}-.0013409{col 73}{space 3} .0016621
{txt}{space 7}lnlaborlnot {c |}{col 20}{res}{space 2}-.0026225{col 32}{space 2} .0067631{col 43}{space 1}   -0.39{col 52}{space 3}0.698{col 60}{space 4}-.0158779{col 73}{space 3} .0106328
{txt}lnfertilelnmachane {c |}{col 20}{res}{space 2}-.0000553{col 32}{space 2} .0012741{col 43}{space 1}   -0.04{col 52}{space 3}0.965{col 60}{space 4}-.0025525{col 73}{space 3}  .002442
{txt}{space 5}lnfertilelnot {c |}{col 20}{res}{space 2}-.0402638{col 32}{space 2} .0123877{col 43}{space 1}   -3.25{col 52}{space 3}0.001{col 60}{space 4}-.0645433{col 73}{space 3}-.0159843
{txt}{space 5}lnmachanelnot {c |}{col 20}{res}{space 2} .0017682{col 32}{space 2} .0013389{col 43}{space 1}    1.32{col 52}{space 3}0.187{col 60}{space 4} -.000856{col 73}{space 3} .0043923
{txt}{space 15}sex {c |}{col 20}{res}{space 2}-.0089606{col 32}{space 2} .0084333{col 43}{space 1}   -1.06{col 52}{space 3}0.288{col 60}{space 4}-.0254896{col 73}{space 3} .0075685
{txt}{space 15}age {c |}{col 20}{res}{space 2} .0004975{col 32}{space 2} .0002731{col 43}{space 1}    1.82{col 52}{space 3}0.069{col 60}{space 4}-.0000378{col 73}{space 3} .0010327
{txt}{space 14}educ {c |}{col 20}{res}{space 2} .0023194{col 32}{space 2} .0011899{col 43}{space 1}    1.95{col 52}{space 3}0.051{col 60}{space 4}-.0000127{col 73}{space 3} .0046515
{txt}{space 13}train {c |}{col 20}{res}{space 2}-.0178154{col 32}{space 2}  .007945{col 43}{space 1}   -2.24{col 52}{space 3}0.025{col 60}{space 4}-.0333873{col 73}{space 3}-.0022435
{txt}{space 12}health {c |}{col 20}{res}{space 2} .0337986{col 32}{space 2} .0040297{col 43}{space 1}    8.39{col 52}{space 3}0.000{col 60}{space 4} .0259006{col 73}{space 3} .0416966
{txt}{space 12}status {c |}{col 20}{res}{space 2}-.0070889{col 32}{space 2} .0056885{col 43}{space 1}   -1.25{col 52}{space 3}0.213{col 60}{space 4} -.018238{col 73}{space 3} .0040603
{txt}{space 11}fstruct {c |}{col 20}{res}{space 2} .0114247{col 32}{space 2} .0051657{col 43}{space 1}    2.21{col 52}{space 3}0.027{col 60}{space 4} .0013002{col 73}{space 3} .0215492
{txt}{space 13}plots {c |}{col 20}{res}{space 2}-.0014666{col 32}{space 2} .0009601{col 43}{space 1}   -1.53{col 52}{space 3}0.127{col 60}{space 4}-.0033483{col 73}{space 3} .0004152
{txt}{space 8}insurances {c |}{col 20}{res}{space 2}-.0378617{col 32}{space 2} .0071422{col 43}{space 1}   -5.30{col 52}{space 3}0.000{col 60}{space 4}-.0518603{col 73}{space 3}-.0238632
{txt}{space 14}loan {c |}{col 20}{res}{space 2} .0168435{col 32}{space 2} .0094732{col 43}{space 1}    1.78{col 52}{space 3}0.075{col 60}{space 4}-.0017237{col 73}{space 3} .0354106
{txt}{space 15}job {c |}{col 20}{res}{space 2}-.0219195{col 32}{space 2} .0092399{col 43}{space 1}   -2.37{col 52}{space 3}0.018{col 60}{space 4}-.0400294{col 73}{space 3}-.0038096
{txt}{space 9}lnsubsidy {c |}{col 20}{res}{space 2}-.0019391{col 32}{space 2} .0012223{col 43}{space 1}   -1.59{col 52}{space 3}0.113{col 60}{space 4}-.0043348{col 73}{space 3} .0004566
{txt}{space 18} {c |}
{space 14}year {c |}
{space 13}2012  {c |}{col 20}{res}{space 2} .0061392{col 32}{space 2} .0038444{col 43}{space 1}    1.60{col 52}{space 3}0.110{col 60}{space 4}-.0013958{col 73}{space 3} .0136742
{txt}{space 13}2013  {c |}{col 20}{res}{space 2}-.0156646{col 32}{space 2} .0091392{col 43}{space 1}   -1.71{col 52}{space 3}0.087{col 60}{space 4}-.0335771{col 73}{space 3} .0022479
{txt}{space 13}2014  {c |}{col 20}{res}{space 2} .0043475{col 32}{space 2}  .005415{col 43}{space 1}    0.80{col 52}{space 3}0.422{col 60}{space 4}-.0062656{col 73}{space 3} .0149606
{txt}{space 13}2015  {c |}{col 20}{res}{space 2}-.0172138{col 32}{space 2} .0099849{col 43}{space 1}   -1.72{col 52}{space 3}0.085{col 60}{space 4}-.0367839{col 73}{space 3} .0023562
{txt}{space 18} {c |}
{space 13}_cons {c |}{col 20}{res}{space 2}  4.56009{col 32}{space 2} .3326455{col 43}{space 1}   13.71{col 52}{space 3}0.000{col 60}{space 4} 3.908117{col 73}{space 3} 5.212063
{txt}{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
           sigma_u {c |} {res} .19951271
           {txt}sigma_e {c |} {res} .19524607
               {txt}rho {c |} {res} .51080698{txt}   (fraction of variance due to u_i)
{hline 19}{c BT}{hline 64}

{com}. xtreg lnyield lnland land lnlabor lnfertile lnmachane lnot lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy i.year, fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    17,859
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     5,294

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0483{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.0232{col 63}{txt}avg{col 67}={col 69}{res}       3.4
{txt}     overall = {res}0.0176{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}32{txt},{res}5293{txt}){col 67}={col 70}{res}    15.97
{txt}corr(u_i, Xb){col 16}= {res}-0.0857{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 84:(Std. Err. adjusted for {res:5,294} clusters in id)}
{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}           lnyield{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}lnland {c |}{col 20}{res}{space 2} .0135129{col 32}{space 2} .0084238{col 43}{space 1}    1.60{col 52}{space 3}0.109{col 60}{space 4}-.0030012{col 73}{space 3} .0300269
{txt}{space 14}land {c |}{col 20}{res}{space 2} -.000075{col 32}{space 2} .0003642{col 43}{space 1}   -0.21{col 52}{space 3}0.837{col 60}{space 4} -.000789{col 73}{space 3}  .000639
{txt}{space 11}lnlabor {c |}{col 20}{res}{space 2}-.0255621{col 32}{space 2} .0480108{col 43}{space 1}   -0.53{col 52}{space 3}0.594{col 60}{space 4} -.119683{col 73}{space 3} .0685589
{txt}{space 9}lnfertile {c |}{col 20}{res}{space 2} .3642138{col 32}{space 2} .0980229{col 43}{space 1}    3.72{col 52}{space 3}0.000{col 60}{space 4} .1720485{col 73}{space 3} .5563791
{txt}{space 9}lnmachane {c |}{col 20}{res}{space 2} .0245535{col 32}{space 2}  .009152{col 43}{space 1}    2.68{col 52}{space 3}0.007{col 60}{space 4} .0066118{col 73}{space 3} .0424953
{txt}{space 14}lnot {c |}{col 20}{res}{space 2} -.039995{col 32}{space 2}  .126596{col 43}{space 1}   -0.32{col 52}{space 3}0.752{col 60}{space 4}-.2881754{col 73}{space 3} .2081853
{txt}{space 10}lnlabor2 {c |}{col 20}{res}{space 2} .0146658{col 32}{space 2} .0036614{col 43}{space 1}    4.01{col 52}{space 3}0.000{col 60}{space 4} .0074879{col 73}{space 3} .0218438
{txt}{space 8}lnfertile2 {c |}{col 20}{res}{space 2}-.0128428{col 32}{space 2} .0097205{col 43}{space 1}   -1.32{col 52}{space 3}0.186{col 60}{space 4}-.0318989{col 73}{space 3} .0062133
{txt}{space 8}lnmachane2 {c |}{col 20}{res}{space 2} .0023506{col 32}{space 2} .0003812{col 43}{space 1}    6.17{col 52}{space 3}0.000{col 60}{space 4} .0016034{col 73}{space 3} .0030978
{txt}{space 13}lnot2 {c |}{col 20}{res}{space 2} .0347892{col 32}{space 2}  .013561{col 43}{space 1}    2.57{col 52}{space 3}0.010{col 60}{space 4}  .008204{col 73}{space 3} .0613743
{txt}{space 2}lnlaborlnfertile {c |}{col 20}{res}{space 2} .0147087{col 32}{space 2}  .007859{col 43}{space 1}    1.87{col 52}{space 3}0.061{col 60}{space 4}-.0006982{col 73}{space 3} .0301155
{txt}{space 2}lnlaborlnmachane {c |}{col 20}{res}{space 2}-.0001589{col 32}{space 2} .0009859{col 43}{space 1}   -0.16{col 52}{space 3}0.872{col 60}{space 4}-.0020916{col 73}{space 3} .0017738
{txt}{space 7}lnlaborlnot {c |}{col 20}{res}{space 2} -.015905{col 32}{space 2} .0084533{col 43}{space 1}   -1.88{col 52}{space 3}0.060{col 60}{space 4}-.0324768{col 73}{space 3} .0006669
{txt}lnfertilelnmachane {c |}{col 20}{res}{space 2}-.0019397{col 32}{space 2} .0014404{col 43}{space 1}   -1.35{col 52}{space 3}0.178{col 60}{space 4}-.0047635{col 73}{space 3} .0008842
{txt}{space 5}lnfertilelnot {c |}{col 20}{res}{space 2}-.0443899{col 32}{space 2} .0138048{col 43}{space 1}   -3.22{col 52}{space 3}0.001{col 60}{space 4}-.0714531{col 73}{space 3}-.0173268
{txt}{space 5}lnmachanelnot {c |}{col 20}{res}{space 2}-.0015807{col 32}{space 2} .0015216{col 43}{space 1}   -1.04{col 52}{space 3}0.299{col 60}{space 4}-.0045636{col 73}{space 3} .0014023
{txt}{space 15}sex {c |}{col 20}{res}{space 2}-.0036582{col 32}{space 2}  .009471{col 43}{space 1}   -0.39{col 52}{space 3}0.699{col 60}{space 4}-.0222253{col 73}{space 3} .0149089
{txt}{space 15}age {c |}{col 20}{res}{space 2} .0008439{col 32}{space 2}  .000322{col 43}{space 1}    2.62{col 52}{space 3}0.009{col 60}{space 4} .0002126{col 73}{space 3} .0014752
{txt}{space 14}educ {c |}{col 20}{res}{space 2} .0028022{col 32}{space 2} .0014182{col 43}{space 1}    1.98{col 52}{space 3}0.048{col 60}{space 4}  .000022{col 73}{space 3} .0055825
{txt}{space 13}train {c |}{col 20}{res}{space 2}-.0144487{col 32}{space 2}  .008204{col 43}{space 1}   -1.76{col 52}{space 3}0.078{col 60}{space 4}-.0305319{col 73}{space 3} .0016345
{txt}{space 12}health {c |}{col 20}{res}{space 2}  .022779{col 32}{space 2} .0045101{col 43}{space 1}    5.05{col 52}{space 3}0.000{col 60}{space 4} .0139373{col 73}{space 3} .0316208
{txt}{space 12}status {c |}{col 20}{res}{space 2} .0006822{col 32}{space 2} .0063163{col 43}{space 1}    0.11{col 52}{space 3}0.914{col 60}{space 4}-.0117004{col 73}{space 3} .0130649
{txt}{space 11}fstruct {c |}{col 20}{res}{space 2} -.011635{col 32}{space 2}  .005368{col 43}{space 1}   -2.17{col 52}{space 3}0.030{col 60}{space 4}-.0221585{col 73}{space 3}-.0011115
{txt}{space 13}plots {c |}{col 20}{res}{space 2}-.0049349{col 32}{space 2} .0011677{col 43}{space 1}   -4.23{col 52}{space 3}0.000{col 60}{space 4}-.0072241{col 73}{space 3}-.0026456
{txt}{space 8}insurances {c |}{col 20}{res}{space 2}-.0821274{col 32}{space 2} .0083478{col 43}{space 1}   -9.84{col 52}{space 3}0.000{col 60}{space 4}-.0984925{col 73}{space 3}-.0657623
{txt}{space 14}loan {c |}{col 20}{res}{space 2} .0045275{col 32}{space 2} .0093638{col 43}{space 1}    0.48{col 52}{space 3}0.629{col 60}{space 4}-.0138295{col 73}{space 3} .0228845
{txt}{space 15}job {c |}{col 20}{res}{space 2} .0150279{col 32}{space 2} .0113173{col 43}{space 1}    1.33{col 52}{space 3}0.184{col 60}{space 4}-.0071587{col 73}{space 3} .0372146
{txt}{space 9}lnsubsidy {c |}{col 20}{res}{space 2}-.0037803{col 32}{space 2}   .00155{col 43}{space 1}   -2.44{col 52}{space 3}0.015{col 60}{space 4} -.006819{col 73}{space 3}-.0007417
{txt}{space 18} {c |}
{space 14}year {c |}
{space 13}2012  {c |}{col 20}{res}{space 2} .0315488{col 32}{space 2} .0038413{col 43}{space 1}    8.21{col 52}{space 3}0.000{col 60}{space 4} .0240182{col 73}{space 3} .0390793
{txt}{space 13}2013  {c |}{col 20}{res}{space 2} .0141018{col 32}{space 2} .0099748{col 43}{space 1}    1.41{col 52}{space 3}0.157{col 60}{space 4}-.0054528{col 73}{space 3} .0336565
{txt}{space 13}2014  {c |}{col 20}{res}{space 2} .0336376{col 32}{space 2} .0056397{col 43}{space 1}    5.96{col 52}{space 3}0.000{col 60}{space 4} .0225814{col 73}{space 3} .0446937
{txt}{space 13}2015  {c |}{col 20}{res}{space 2} .0132679{col 32}{space 2} .0109568{col 43}{space 1}    1.21{col 52}{space 3}0.226{col 60}{space 4}-.0082119{col 73}{space 3} .0347477
{txt}{space 18} {c |}
{space 13}_cons {c |}{col 20}{res}{space 2} 5.005697{col 32}{space 2} .3927301{col 43}{space 1}   12.75{col 52}{space 3}0.000{col 60}{space 4} 4.235784{col 73}{space 3}  5.77561
{txt}{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
           sigma_u {c |} {res} .29920293
           {txt}sigma_e {c |} {res} .19524607
               {txt}rho {c |} {res}  .7013475{txt}   (fraction of variance due to u_i)
{hline 19}{c BT}{hline 64}

{com}. 
. 
. **二次项和交叉项联合检验
. tab year, gen(y)

       {txt}year {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       2011 {c |}{res}      3,834       21.47       21.47
{txt}       2012 {c |}{res}      3,909       21.89       43.36
{txt}       2013 {c |}{res}      3,642       20.39       63.75
{txt}       2014 {c |}{res}      3,500       19.60       83.35
{txt}       2015 {c |}{res}      2,974       16.65      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     17,859      100.00
{txt}
{com}. xtreg lnyield lnland land lnlabor lnfertile lnmachane lnot lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy y2-y5, fe vce(cluster id)
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    17,859
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     5,294

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0483{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.0232{col 63}{txt}avg{col 67}={col 69}{res}       3.4
{txt}     overall = {res}0.0176{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}32{txt},{res}5293{txt}){col 67}={col 70}{res}    15.97
{txt}corr(u_i, Xb){col 16}= {res}-0.0857{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 84:(Std. Err. adjusted for {res:5,294} clusters in id)}
{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}           lnyield{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}lnland {c |}{col 20}{res}{space 2} .0135129{col 32}{space 2} .0084238{col 43}{space 1}    1.60{col 52}{space 3}0.109{col 60}{space 4}-.0030012{col 73}{space 3} .0300269
{txt}{space 14}land {c |}{col 20}{res}{space 2} -.000075{col 32}{space 2} .0003642{col 43}{space 1}   -0.21{col 52}{space 3}0.837{col 60}{space 4} -.000789{col 73}{space 3}  .000639
{txt}{space 11}lnlabor {c |}{col 20}{res}{space 2}-.0255621{col 32}{space 2} .0480108{col 43}{space 1}   -0.53{col 52}{space 3}0.594{col 60}{space 4} -.119683{col 73}{space 3} .0685589
{txt}{space 9}lnfertile {c |}{col 20}{res}{space 2} .3642138{col 32}{space 2} .0980229{col 43}{space 1}    3.72{col 52}{space 3}0.000{col 60}{space 4} .1720485{col 73}{space 3} .5563791
{txt}{space 9}lnmachane {c |}{col 20}{res}{space 2} .0245535{col 32}{space 2}  .009152{col 43}{space 1}    2.68{col 52}{space 3}0.007{col 60}{space 4} .0066118{col 73}{space 3} .0424953
{txt}{space 14}lnot {c |}{col 20}{res}{space 2} -.039995{col 32}{space 2}  .126596{col 43}{space 1}   -0.32{col 52}{space 3}0.752{col 60}{space 4}-.2881754{col 73}{space 3} .2081853
{txt}{space 10}lnlabor2 {c |}{col 20}{res}{space 2} .0146658{col 32}{space 2} .0036614{col 43}{space 1}    4.01{col 52}{space 3}0.000{col 60}{space 4} .0074879{col 73}{space 3} .0218438
{txt}{space 8}lnfertile2 {c |}{col 20}{res}{space 2}-.0128428{col 32}{space 2} .0097205{col 43}{space 1}   -1.32{col 52}{space 3}0.186{col 60}{space 4}-.0318989{col 73}{space 3} .0062133
{txt}{space 8}lnmachane2 {c |}{col 20}{res}{space 2} .0023506{col 32}{space 2} .0003812{col 43}{space 1}    6.17{col 52}{space 3}0.000{col 60}{space 4} .0016034{col 73}{space 3} .0030978
{txt}{space 13}lnot2 {c |}{col 20}{res}{space 2} .0347892{col 32}{space 2}  .013561{col 43}{space 1}    2.57{col 52}{space 3}0.010{col 60}{space 4}  .008204{col 73}{space 3} .0613743
{txt}{space 2}lnlaborlnfertile {c |}{col 20}{res}{space 2} .0147087{col 32}{space 2}  .007859{col 43}{space 1}    1.87{col 52}{space 3}0.061{col 60}{space 4}-.0006982{col 73}{space 3} .0301155
{txt}{space 2}lnlaborlnmachane {c |}{col 20}{res}{space 2}-.0001589{col 32}{space 2} .0009859{col 43}{space 1}   -0.16{col 52}{space 3}0.872{col 60}{space 4}-.0020916{col 73}{space 3} .0017738
{txt}{space 7}lnlaborlnot {c |}{col 20}{res}{space 2} -.015905{col 32}{space 2} .0084533{col 43}{space 1}   -1.88{col 52}{space 3}0.060{col 60}{space 4}-.0324768{col 73}{space 3} .0006669
{txt}lnfertilelnmachane {c |}{col 20}{res}{space 2}-.0019397{col 32}{space 2} .0014404{col 43}{space 1}   -1.35{col 52}{space 3}0.178{col 60}{space 4}-.0047635{col 73}{space 3} .0008842
{txt}{space 5}lnfertilelnot {c |}{col 20}{res}{space 2}-.0443899{col 32}{space 2} .0138048{col 43}{space 1}   -3.22{col 52}{space 3}0.001{col 60}{space 4}-.0714531{col 73}{space 3}-.0173268
{txt}{space 5}lnmachanelnot {c |}{col 20}{res}{space 2}-.0015807{col 32}{space 2} .0015216{col 43}{space 1}   -1.04{col 52}{space 3}0.299{col 60}{space 4}-.0045636{col 73}{space 3} .0014023
{txt}{space 15}sex {c |}{col 20}{res}{space 2}-.0036582{col 32}{space 2}  .009471{col 43}{space 1}   -0.39{col 52}{space 3}0.699{col 60}{space 4}-.0222253{col 73}{space 3} .0149089
{txt}{space 15}age {c |}{col 20}{res}{space 2} .0008439{col 32}{space 2}  .000322{col 43}{space 1}    2.62{col 52}{space 3}0.009{col 60}{space 4} .0002126{col 73}{space 3} .0014752
{txt}{space 14}educ {c |}{col 20}{res}{space 2} .0028022{col 32}{space 2} .0014182{col 43}{space 1}    1.98{col 52}{space 3}0.048{col 60}{space 4}  .000022{col 73}{space 3} .0055825
{txt}{space 13}train {c |}{col 20}{res}{space 2}-.0144487{col 32}{space 2}  .008204{col 43}{space 1}   -1.76{col 52}{space 3}0.078{col 60}{space 4}-.0305319{col 73}{space 3} .0016345
{txt}{space 12}health {c |}{col 20}{res}{space 2}  .022779{col 32}{space 2} .0045101{col 43}{space 1}    5.05{col 52}{space 3}0.000{col 60}{space 4} .0139373{col 73}{space 3} .0316208
{txt}{space 12}status {c |}{col 20}{res}{space 2} .0006822{col 32}{space 2} .0063163{col 43}{space 1}    0.11{col 52}{space 3}0.914{col 60}{space 4}-.0117004{col 73}{space 3} .0130649
{txt}{space 11}fstruct {c |}{col 20}{res}{space 2} -.011635{col 32}{space 2}  .005368{col 43}{space 1}   -2.17{col 52}{space 3}0.030{col 60}{space 4}-.0221585{col 73}{space 3}-.0011115
{txt}{space 13}plots {c |}{col 20}{res}{space 2}-.0049349{col 32}{space 2} .0011677{col 43}{space 1}   -4.23{col 52}{space 3}0.000{col 60}{space 4}-.0072241{col 73}{space 3}-.0026456
{txt}{space 8}insurances {c |}{col 20}{res}{space 2}-.0821274{col 32}{space 2} .0083478{col 43}{space 1}   -9.84{col 52}{space 3}0.000{col 60}{space 4}-.0984925{col 73}{space 3}-.0657623
{txt}{space 14}loan {c |}{col 20}{res}{space 2} .0045275{col 32}{space 2} .0093638{col 43}{space 1}    0.48{col 52}{space 3}0.629{col 60}{space 4}-.0138295{col 73}{space 3} .0228845
{txt}{space 15}job {c |}{col 20}{res}{space 2} .0150279{col 32}{space 2} .0113173{col 43}{space 1}    1.33{col 52}{space 3}0.184{col 60}{space 4}-.0071587{col 73}{space 3} .0372146
{txt}{space 9}lnsubsidy {c |}{col 20}{res}{space 2}-.0037803{col 32}{space 2}   .00155{col 43}{space 1}   -2.44{col 52}{space 3}0.015{col 60}{space 4} -.006819{col 73}{space 3}-.0007417
{txt}{space 16}y2 {c |}{col 20}{res}{space 2} .0315488{col 32}{space 2} .0038413{col 43}{space 1}    8.21{col 52}{space 3}0.000{col 60}{space 4} .0240182{col 73}{space 3} .0390793
{txt}{space 16}y3 {c |}{col 20}{res}{space 2} .0141018{col 32}{space 2} .0099748{col 43}{space 1}    1.41{col 52}{space 3}0.157{col 60}{space 4}-.0054528{col 73}{space 3} .0336565
{txt}{space 16}y4 {c |}{col 20}{res}{space 2} .0336376{col 32}{space 2} .0056397{col 43}{space 1}    5.96{col 52}{space 3}0.000{col 60}{space 4} .0225814{col 73}{space 3} .0446937
{txt}{space 16}y5 {c |}{col 20}{res}{space 2} .0132679{col 32}{space 2} .0109568{col 43}{space 1}    1.21{col 52}{space 3}0.226{col 60}{space 4}-.0082119{col 73}{space 3} .0347477
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 5.005697{col 32}{space 2} .3927301{col 43}{space 1}   12.75{col 52}{space 3}0.000{col 60}{space 4} 4.235784{col 73}{space 3}  5.77561
{txt}{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
           sigma_u {c |} {res} .29920293
           {txt}sigma_e {c |} {res} .19524607
               {txt}rho {c |} {res}  .7013475{txt}   (fraction of variance due to u_i)
{hline 19}{c BT}{hline 64}

{com}. test lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot

{p 0 7}{space 1}{text:( 1)}{space 1} {res}lnlabor2 = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} lnfertile2 = 0{p_end}
{p 0 7}{space 1}{text:( 3)}{space 1} lnmachane2 = 0{p_end}
{p 0 7}{space 1}{text:( 4)}{space 1} lnot2 = 0{p_end}
{p 0 7}{space 1}{text:( 5)}{space 1} lnlaborlnfertile = 0{p_end}
{p 0 7}{space 1}{text:( 6)}{space 1} lnlaborlnmachane = 0{p_end}
{p 0 7}{space 1}{text:( 7)}{space 1} lnlaborlnot = 0{p_end}
{p 0 7}{space 1}{text:( 8)}{space 1} lnfertilelnmachane = 0{p_end}
{p 0 7}{space 1}{text:( 9)}{space 1} lnfertilelnot = 0{p_end}
{p 0 7}{space 1}{text:(10)}{space 1} lnmachanelnot = 0{p_end}

{txt}       F( 10,  5293) ={res}    8.12
{txt}{col 13}Prob > F ={res}    0.0000
{txt}
{com}. test y2 y3 y4 y5

{p 0 7}{space 1}{text:( 1)}{space 1} {res}y2 = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} y3 = 0{p_end}
{p 0 7}{space 1}{text:( 3)}{space 1} y4 = 0{p_end}
{p 0 7}{space 1}{text:( 4)}{space 1} y5 = 0{p_end}

{txt}       F(  4,  5293) ={res}   19.42
{txt}{col 13}Prob > F ={res}    0.0000
{txt}
{com}. 
. 
{txt}end of do-file

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. log off
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}D:\曾翠红\Stata14\新建文件夹 - 副本 (2)\新建文件夹\single玉米log.smcl
  {txt}log type:  {res}smcl
 {txt}paused on:  {res}22 Feb 2019, 15:00:10
{txt}{.-}
{smcl}
{txt}{sf}{ul off}