{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}D:\曾翠红\Stata14\新建文件夹 - 副本 (2)\新建文件夹\double小麦log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}22 Feb 2019, 15:01:12

{com}. do "D:\曾翠红\Stata14\新建文件夹 - 副本 (2)\新建文件夹\double小麦.do"
{txt}
{com}. **以土地单产为土地生产率
. 
. use "D:\曾翠红\Stata14\新建文件夹 - 副本 (2)\新建文件夹\allnet.dta", clear
{txt}
{com}. keep if sm==11|sm==12|sm==13|sm==32|sm==34|sm==37|sm==41
{txt}(72,970 observations deleted)

{com}. 
. **包含的变量有（yield、income、profit、land、cland、labor、flabor、elabor、resident、machine、other、subsidy、insurance、plots、fstruct、job、concurrent、sex、age、educ、train、health、status）
. 
. **选取变量(删除收获面积、年末耕地面积、家庭常住人口、家庭全年总收入为0的农户数据，并将部分变量+0.001）
. drop if wland==0  //
{txt}(366 observations deleted)

{com}. drop if wland==.
{txt}(13,706 observations deleted)

{com}. drop if wyields==.
{txt}(5 observations deleted)

{com}. g yield = wyields/wland
{txt}
{com}. winsor yield, g (yieldo) p(0.05)
{txt}
{com}. sum yieldo

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 6}yieldo {c |}{res}     12,265    415.3858    102.1365   181.8182   564.1025
{txt}
{com}. drop if yield>564.1025
{txt}(614 observations deleted)

{com}. drop if yield<181.8182
{txt}(619 observations deleted)

{com}. 
. g land = wland      
{txt}
{com}. g labors= wlabors   
{txt}(1,279 missing values generated)

{com}. g elabors= welabors     
{txt}(10,586 missing values generated)

{com}. g e1=we1 
{txt}(433 missing values generated)

{com}. g e2=we2 
{txt}(8,991 missing values generated)

{com}. g e3=we3 
{txt}(67 missing values generated)

{com}. g e4=we4 
{txt}(10,562 missing values generated)

{com}. g e5=we5 
{txt}(486 missing values generated)

{com}. g e6=we6 
{txt}(4,885 missing values generated)

{com}. g e7=we7 
{txt}(10,313 missing values generated)

{com}. g e8=we8 
{txt}(352 missing values generated)

{com}. g e9=we9
{txt}(7,045 missing values generated)

{com}. g e10=we10
{txt}(8,275 missing values generated)

{com}. g e11=we11 
{txt}(10,285 missing values generated)

{com}. g e12=we12   //
{txt}(8,083 missing values generated)

{com}. ren age agee
{res}{txt}
{com}. //winsor land,gen (land1) p(0.025)
. //sum land1
. //sum land
. 
. //drop if elando ==.
. //drop if elando ==0
. drop if labors ==0
{txt}(2 observations deleted)

{com}. drop if labors==.
{txt}(1,279 observations deleted)

{com}. drop if quantitys ==.
{txt}(476 observations deleted)

{com}. //drop if resident ==.
. //drop if resident ==0
. 
. replace eland=0 if eland==.
{txt}(6 real changes made)

{com}. replace elabors=0 if elabors==.
{txt}(8,832 real changes made)

{com}. 
. replace e1=0 if e1==.
{txt}(338 real changes made)

{com}. replace e2=0 if e2==.
{txt}(7,353 real changes made)

{com}. replace e3=0 if e3==.
{txt}(41 real changes made)

{com}. replace e4=0 if e4==.
{txt}(8,830 real changes made)

{com}. replace e5=0 if e5==.
{txt}(421 real changes made)

{com}. replace e6=0 if e6==.
{txt}(3,978 real changes made)

{com}. replace e7=0 if e7==.
{txt}(8,608 real changes made)

{com}. replace e8=0 if e8==.
{txt}(295 real changes made)

{com}. replace e9=0 if e9==.
{txt}(5,625 real changes made)

{com}. replace e10=0 if e10==.
{txt}(6,684 real changes made)

{com}. replace e11=0 if e11==.
{txt}(8,591 real changes made)

{com}. replace e12=0 if e12==.
{txt}(6,614 real changes made)

{com}. 
. replace s1=0 if s1==.
{txt}(627 real changes made)

{com}. replace s2=0 if s2==.
{txt}(1,822 real changes made)

{com}. replace s3=0 if s3==.
{txt}(3,238 real changes made)

{com}. replace s4=0 if s4==.
{txt}(8,865 real changes made)

{com}. g subsidys = s1+s2+s3+s4
{txt}
{com}. 
. replace sex=0 if sex!=1
{txt}(4,273 real changes made)

{com}. 
. g health = train3
{txt}(3,671 missing values generated)

{com}. replace health=4 if health==0
{txt}(0 real changes made)

{com}. replace health=4 if health==.
{txt}(3,671 real changes made)

{com}. replace health=4 if health>5
{txt}(0 real changes made)

{com}. replace health=10 if health==1
{txt}(3,552 real changes made)

{com}. replace health=9 if health==2
{txt}(1,227 real changes made)

{com}. replace health=7 if health==2
{txt}(0 real changes made)

{com}. replace health=6 if health==5
{txt}(40 real changes made)

{com}. replace health=5 if health==10
{txt}(3,552 real changes made)

{com}. replace health=4 if health==9
{txt}(1,227 real changes made)

{com}. replace health=2 if health==7
{txt}(0 real changes made)

{com}. replace health=1 if health==6
{txt}(40 real changes made)

{com}. 
. replace resident=0 if resident==.
{txt}(7 real changes made)

{com}. 
. replace familylabor=0 if familylabor==.
{txt}(208 real changes made)

{com}. 
. replace status1=0 if status1!=1
{txt}(8,939 real changes made)

{com}. replace status2=0 if status2!=1
{txt}(8,887 real changes made)

{com}. replace status3=0 if status3!=1
{txt}(7,576 real changes made)

{com}. g status = status1+status2+status3
{txt}
{com}. replace status=1 if status!=0
{txt}(383 real changes made)

{com}. 
. replace train1=0 if train1!=1
{txt}(9,071 real changes made)

{com}. replace train2=0 if train2!=1
{txt}(8,951 real changes made)

{com}. g train = train1+train2
{txt}
{com}. replace train=1 if train!=0
{txt}(159 real changes made)

{com}. 
. replace insurances=0 if insurances==.
{txt}(7,138 real changes made)

{com}. replace insurances=1 if insurances!=0
{txt}(1,813 real changes made)

{com}. 
. replace loan1=1 if loan1>0
{txt}(8,916 real changes made)

{com}. replace loan1=0 if loan1!=1
{txt}(0 real changes made)

{com}. replace loan2=1 if loan1>0
{txt}(8,916 real changes made)

{com}. replace loan2=0 if loan2!=1
{txt}(1 real change made)

{com}. g loan=loan1+loan2
{txt}
{com}. replace loan=1 if loan!=0
{txt}(8,916 real changes made)

{com}. 
. egen avg_agriincome = mean(agriincome)
{txt}
{com}. replace agriincome=avg_agriincome if agriincome==.
{txt}(375 real changes made)

{com}. egen avg_allincome = mean(allincome)
{txt}
{com}. replace allincome=avg_allincome if allincome==.
{txt}(6 real changes made)

{com}. egen avg_age = mean(agee)
{txt}
{com}. replace agee=avg_age if agee==.
{txt}(3,658 real changes made)

{com}. egen avg_educ = mean(educ)
{txt}
{com}. replace educ=avg_educ if educ==.
{txt}(3,798 real changes made)

{com}. 
. 
. g machanes = e8+e9+e10
{txt}
{com}. g fertiles = e2+e3
{txt}
{com}. g ots = e1+e4+e5+e6+e7+e12
{txt}
{com}. g flabors = labors-elabors
{txt}
{com}. 
. 
. 
. //tostring id, replace 
. //gen sm=substr(id,1,2)
. //egen yearsm = concat(year sm)
. //g wage0 = elaborpay/elabors
. //bysort yearsm:egen wageo=mean(wage0)
. //bysort yearsm:egen quantitye = mean(quantity)
. 
. winsor quantitys, gen (quantity) p(0.01)
{txt}
{com}. winsor agriincomes, gen (agriincome) p(0.001)
{txt}
{com}. winsor allincomes, gen (allincome) p(0.001)
{txt}
{com}. winsor agee, gen (age) p(0.01)
{txt}
{com}. 
. g laboro = labors/land
{txt}
{com}. winsor laboro, g (labor) p(0.01)   
{txt}
{com}. g elabor0 = elabors/land
{txt}
{com}. winsor elabor0, gen (elaboro) p(0.001) 
{txt}
{com}. g flaboro = labor - elaboro
{txt}
{com}. 
. g fertile0 = fertiles/land
{txt}
{com}. g machane0 = machanes/land
{txt}
{com}. g ot0 = ots/land
{txt}
{com}. g subsidy0 = subsidys/eland
{txt}(10 missing values generated)

{com}. winsor fertile0, gen (fertileo) p(0.01)
{txt}
{com}. winsor machane0, gen (machaneo) p(0.01)
{txt}
{com}. winsor ot0, gen (oto) p(0.1)
{txt}
{com}. winsor subsidy0, gen (subsidyo) p(0.01)
{txt}
{com}. 
. g plots = eland/quantity
{txt}
{com}. egen ave_plots = mean(plots)
{txt}
{com}. replace plots=ave_plots if plots==.
{txt}(0 real changes made)

{com}. 
. egen avg_sub = mean(subsidy0)
{txt}
{com}. replace subsidyo=avg_sub if subsidyo==.
{txt}(10 real changes made)

{com}. 
. g job = 1-agriincome/allincome
{txt}
{com}. replace job=0 if job<0
{txt}(55 real changes made)

{com}. egen avg_job = mean(job)
{txt}
{com}. replace job=avg_job if job==.
{txt}(0 real changes made)

{com}. 
. 
. g flabor = flaboro+0.001
{txt}
{com}. g elabor = elaboro+0.001    
{txt}
{com}. g fertile = fertileo+0.001
{txt}
{com}. g machane = machaneo+0.001
{txt}
{com}. g ot = oto+0.001
{txt}
{com}. g subsidy = subsidyo+0.001
{txt}
{com}. 
. 
. g fstructs = familylabor/resident
{txt}(11 missing values generated)

{com}. egen avg_fstruct = mean(fstructs)
{txt}
{com}. replace fstructs=avg_fstruct if fstruct==.
{txt}(11 real changes made)

{com}. winsor fstructs, gen (fstruct) p(0.01)
{txt}
{com}. 
. g caland = land 
{txt}
{com}. replace caland = 1 if land>=0&land<10
{txt}(8,097 real changes made)

{com}. replace caland = 2 if land>=10&land<50
{txt}(784 real changes made)

{com}. replace caland = 3 if land>=50
{txt}(4 real changes made)

{com}. 
. tabstat yield land labor flabor elabor fertile machane ot subsidy insurance loan plots fstruct job sex age educ train health status, statistics(mean ma mi q sk k sd n) 

{txt}   stats {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s      loan     plots   fstruct       job       sex       age
{hline 9}{c +}{hline 160}
{ralign 8:mean} {...}
{c |}{...}
 {res} 420.7463  4.539245   10.3465  10.33773  .0107704  175.0597  129.5269  116.6928  118.9255  .1954717  .9612938  1.814923  .7254904  .7178392  .5392992  54.40057
{txt}{ralign 8:max} {...}
{c |}{...}
 {res}    562.5        95  33.33333  33.33433  2.858143   345.001   306.251   200.001  524.5464         1         1        15         3         1         1        75
{txt}{ralign 8:min} {...}
{c |}{...}
 {res} 182.2222        .2         1      .001      .001    62.501      .001    50.001      .001         0         0         0         0         0         0        31
{txt}{ralign 8:p25} {...}
{c |}{...}
 {res}      375         2         5     5.001      .001  139.3253  91.66766    75.001  89.52481         0         1        .9        .5  .5889543         0        53
{txt}{ralign 8:p50} {...}
{c |}{...}
 {res}      438       3.5  9.411764     9.376      .001  168.4221  126.6677  112.2232  111.3343         0         1       1.5  .6666667  .7852609         1  54.39701
{txt}{ralign 8:p75} {...}
{c |}{...}
 {res}      500         6  13.33333  13.33433      .001  203.3343  166.6677  152.6326  135.0919         0         1  2.233333         1  .9059771         1        58
{txt}{ralign 8:skewness} {...}
{c |}{...}
 {res}-.8030303  4.719355  1.331921    1.3311  17.01465  .6369238  .3791438  .2943512  2.810218  1.535837 -4.782878  2.778482  2.004103  -1.03959 -.1576846 -.2885417
{txt}{ralign 8:kurtosis} {...}
{c |}{...}
 {res} 3.054092  64.88195  4.600906  4.598849  323.1401  3.590792  3.366976   1.92752  15.62613  3.358794  23.87592  15.19742  11.23472  3.319116  1.024864  3.871996
{txt}{ralign 8:sd} {...}
{c |}{...}
 {res} 87.17527  4.118386  7.001067  7.001432  .1306761  53.72627  59.25646  48.22432  72.44478  .3965848  .1929042  1.433942  .4279602  .2372968  .4984801  8.183333
{txt}{ralign 8:N} {...}
{c |}{...}
 {res}     9275      9275      9275      9275      9275      9275      9275      9275      9275      9275      9275      9275      9275      9275      9275      9275
{txt}{hline 9}{c BT}{hline 160}

   stats {...}
{c |}{...}
      educ     train    health    status
{hline 9}{c +}{hline 40}
{ralign 8:mean} {...}
{c |}{...}
 {res} 6.975917  .0397844   4.30717  .2168194
{txt}{ralign 8:max} {...}
{c |}{...}
 {res}       17         1         5         1
{txt}{ralign 8:min} {...}
{c |}{...}
 {res}        0         0         1         0
{txt}{ralign 8:p25} {...}
{c |}{...}
 {res} 6.975917         0         4         0
{txt}{ralign 8:p50} {...}
{c |}{...}
 {res} 6.975917         0         4         0
{txt}{ralign 8:p75} {...}
{c |}{...}
 {res}        8         0         5         0
{txt}{ralign 8:skewness} {...}
{c |}{...}
 {res}-.4687649  4.709239 -.7586174  1.374401
{txt}{ralign 8:kurtosis} {...}
{c |}{...}
 {res} 5.690709  23.17693  5.203251  2.888978
{txt}{ralign 8:sd} {...}
{c |}{...}
 {res} 2.004035  .1954628  .6247599  .4121008
{txt}{ralign 8:N} {...}
{c |}{...}
 {res}     9275      9275      9275      9275
{txt}{hline 9}{c BT}{hline 40}

{com}. 
. 
. **删除面板重复值
. duplicates drop id year,force

{p 0 4}{txt}Duplicates in terms of {res} id year{p_end}

{txt}(0 observations are duplicates)

{com}. xtset id year
{res}{txt}{col 8}panel variable:  {res}id (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}year, 2011 to 2015, but with gaps
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. 
. **分类均值、最大值、最小值、25%、50%、75%、偏度、峰度、标准差分析
. tabstat yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status, by(caland) statistics(mean ma mi q sk k sd n) 

{txt}Summary statistics: mean, max, min, p25, p50, p75, skewness, kurtosis, sd, N
  by categories of: caland 

{ralign 8:caland} {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s     plots   fstruct       job       sex       age      educ
{hline 9}{c +}{hline 160}
{ralign 8:1} {...}
{c |}{...}
 {res} 419.7224   3.64805   10.6927   10.6869  .0078013  175.2803  129.1519  116.5575  120.7651  .1818075  1.662113  .7220395  .7370571  .5383528   54.5611  6.978871
{txt}{space 8} {...}
{c |}{...}
 {res}    562.5       9.9  33.33333  33.33433  2.858143   345.001   306.251   200.001  524.5464         1      14.1         3         1         1        75        17
{txt}{space 8} {...}
{c |}{...}
 {res} 182.2222        .2         1      .001      .001    62.501      .001    50.001      .001         0         0         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res}      375       1.8  5.113636  5.112111      .001  138.4626    90.001    73.751  91.39635         0  .8714285        .5  .6277353         0        53  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}    437.5         3        10    10.001      .001  167.8582   125.001   112.001   113.001         0  1.333333  .6666667  .8059707         1  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}      500         5  13.81818  13.77878      .001   205.001  166.6677  153.8472  136.0475         0         2         1  .9157115         1        58         8
{txt}{space 8} {...}
{c |}{...}
 {res}-.7830483  .6333894  1.282615  1.282293  21.15546   .632588  .4021994  .2871991  2.808347  1.650009  2.593077  1.979504 -1.196154 -.1538644 -.3013931 -.4445631
{txt}{space 8} {...}
{c |}{...}
 {res} 2.985872  2.482423  4.382185  4.382184   487.055  3.517618  3.345784  1.901413  15.39232   3.72253  13.72663  11.05029  3.785762  1.023674  3.885913  5.646931
{txt}{space 8} {...}
{c |}{...}
 {res} 88.31113  2.249228  7.110419  7.109155  .1157278  54.72405   60.3614  48.62451  72.91866  .3857085   1.23372  .4308087  .2302597  .4985563  8.230054    2.0124
{txt}{space 8} {...}
{c |}{...}
 {res}     8487      8487      8487      8487      8487      8487      8487      8487      8487      8487      8487      8487      8487      8487      8487      8487
{txt}{hline 9}{c +}{hline 160}
{ralign 8:2} {...}
{c |}{...}
 {res} 432.1972  13.79668  6.627376  6.594866  .0345101  172.8048  133.5161  117.9817  99.54142  .3418367   3.42814  .7614468  .5132081  .5497449   52.6536  6.954092
{txt}{space 8} {...}
{c |}{...}
 {res}      560        47  33.33333   32.9088     2.001   345.001  258.5195   200.001  524.5464         1        15         3  .9725278         1        75        14
{txt}{space 8} {...}
{c |}{...}
 {res}    182.5        10         1     1.001      .001    65.001      .001    50.001      .001         0        .1         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res}      400        10       3.5  3.481769      .001  145.3283  103.1828  84.75394  75.55045         0  2.208333        .5   .364179         0        48  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}      450     12.35  5.313725  5.295117      .001   170.001   133.001  112.9091  92.96803         0       2.9  .6666667  .5266462         1  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res} 496.1241      15.6        10    10.001      .001  197.6839  165.6015  144.6087  116.6078         1    3.9325         1  .6750159         1  54.39701         8
{txt}{space 8} {...}
{c |}{...}
 {res} -.975146  2.171465  1.282133  1.280294  7.809704  .5131121 -.0589872  .4287146  3.031911   .666898  2.221972  2.420235 -.2467006 -.1999717 -.2607833 -.7806343
{txt}{space 8} {...}
{c |}{...}
 {res} 3.873159  10.15955  6.517155  6.445352  68.44844  3.957604  2.689843  2.260513  20.85815  1.444753  9.217878  13.95384  2.303007  1.039989  3.779802  6.267271
{txt}{space 8} {...}
{c |}{...}
 {res} 72.88577  4.624424  4.158635  4.152167  .2053593  41.50578  45.52756  43.71363  63.77339   .474628  2.160866   .394968  .2100432  .4978369  7.464104  1.907019
{txt}{space 8} {...}
{c |}{...}
 {res}      784       784       784       784       784       784       784       784       784       784       784       784       784       784       784       784
{txt}{hline 9}{c +}{hline 160}
{ralign 8:3} {...}
{c |}{...}
 {res} 348.8522    80.975   4.74138  3.085924  1.657456  149.0465  143.3354  151.2115  14.94516        .5      9.85         1   .049971        .5  56.19851  4.987959
{txt}{space 8} {...}
{c |}{...}
 {res}      400        95         5     3.576  2.143857  157.1439  217.2867  174.2867  16.88425         1      9.85         1  .0593591         1        59  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}      300        70  4.285714  2.143857     1.426  134.3168  105.1974    133.58  12.71166         0      9.85         1  .0322488         0  54.39701         3
{txt}{space 8} {...}
{c |}{...}
 {res}   323.75     74.45  4.511278  2.704007  1.450342  143.2214  108.6519  134.2905  13.32587         0      9.85         1  .0411977         0  54.39701         3
{txt}{space 8} {...}
{c |}{...}
 {res} 347.7044     79.45  4.839904   3.31192  1.529984  152.3626  125.4286  148.4896  15.09237        .5      9.85         1  .0541381        .5  55.69851  4.987959
{txt}{space 8} {...}
{c |}{...}
 {res} 373.9544      87.5  4.971483  3.467841   1.86457  154.8715  178.0189  168.1325  16.56445         1      9.85         1  .0587443         1        58  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res} .0972372  .4929714 -.7813051 -1.009455  1.020556 -.9745292  .9035489   .177625 -.1379607         0         .         .  -.826688         0  .3728034         0
{txt}{space 8} {...}
{c |}{...}
 {res} 2.002036  2.047934  1.982635  2.236552  2.219823   2.22498  2.103005   1.23921  1.309349         1         .         .  2.017353         1  1.480526         1
{txt}{space 8} {...}
{c |}{...}
 {res} 40.84668  10.36673   .324126  .6414502  .3310449  10.07698  51.37956  20.18283  1.953411  .5773503         0         0  .0125007  .5773503  2.234691  2.295497
{txt}{space 8} {...}
{c |}{...}
 {res}        4         4         4         4         4         4         4         4         4         4         4         4         4         4         4         4
{txt}{hline 9}{c +}{hline 160}
{ralign 8:Total} {...}
{c |}{...}
 {res} 420.7463  4.539245   10.3465  10.33773  .0107704  175.0597  129.5269  116.6928  118.9255  .1954717  1.814923  .7254904  .7178392  .5392992  54.40057  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}    562.5        95  33.33333  33.33433  2.858143   345.001   306.251   200.001  524.5464         1        15         3         1         1        75        17
{txt}{space 8} {...}
{c |}{...}
 {res} 182.2222        .2         1      .001      .001    62.501      .001    50.001      .001         0         0         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res}      375         2         5     5.001      .001  139.3253  91.66766    75.001  89.52481         0        .9        .5  .5889543         0        53  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}      438       3.5  9.411764     9.376      .001  168.4221  126.6677  112.2232  111.3343         0       1.5  .6666667  .7852609         1  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}      500         6  13.33333  13.33433      .001  203.3343  166.6677  152.6326  135.0919         0  2.233333         1  .9059771         1        58         8
{txt}{space 8} {...}
{c |}{...}
 {res}-.8030303  4.719355  1.331921    1.3311  17.01465  .6369238  .3791438  .2943512  2.810218  1.535837  2.778482  2.004103  -1.03959 -.1576846 -.2885417 -.4687649
{txt}{space 8} {...}
{c |}{...}
 {res} 3.054092  64.88195  4.600906  4.598849  323.1401  3.590792  3.366976   1.92752  15.62613  3.358794  15.19742  11.23472  3.319116  1.024864  3.871996  5.690709
{txt}{space 8} {...}
{c |}{...}
 {res} 87.17527  4.118386  7.001067  7.001432  .1306761  53.72627  59.25646  48.22432  72.44478  .3965848  1.433942  .4279602  .2372968  .4984801  8.183333  2.004035
{txt}{space 8} {...}
{c |}{...}
 {res}     9275      9275      9275      9275      9275      9275      9275      9275      9275      9275      9275      9275      9275      9275      9275      9275
{txt}{hline 9}{c BT}{hline 160}

{ralign 8:caland} {...}
{c |}{...}
     train    health    status
{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res} .0397078   4.30258  .2166843
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 4.714374 -.7946981  1.375366
{txt}{space 8} {...}
{c |}{...}
 {res} 23.22533  5.321829  2.891633
{txt}{space 8} {...}
{c |}{...}
 {res} .1952833  .6310167    .41201
{txt}{space 8} {...}
{c |}{...}
 {res}     8487      8487      8487
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res} .0382653  4.357143  .2193878
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         3         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 4.813847 -.0817064  1.356166
{txt}{space 8} {...}
{c |}{...}
 {res} 24.17312  2.192501  2.839185
{txt}{space 8} {...}
{c |}{...}
 {res} .1919585  .5513249   .414096
{txt}{space 8} {...}
{c |}{...}
 {res}      784       784       784
{txt}{hline 9}{c +}{hline 30}
{ralign 8:3} {...}
{c |}{...}
 {res}       .5      4.25         0
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}       .5         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        1       4.5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0  1.154701         .
{txt}{space 8} {...}
{c |}{...}
 {res}        1  2.333333         .
{txt}{space 8} {...}
{c |}{...}
 {res} .5773503        .5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        4         4         4
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res} .0397844   4.30717  .2168194
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 4.709239 -.7586174  1.374401
{txt}{space 8} {...}
{c |}{...}
 {res} 23.17693  5.203251  2.888978
{txt}{space 8} {...}
{c |}{...}
 {res} .1954628  .6247599  .4121008
{txt}{space 8} {...}
{c |}{...}
 {res}     9275      9275      9275
{txt}{hline 9}{c BT}{hline 30}

{com}. tabstat yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status if year==2011, by(caland) statistics(mean ma mi q sk k sd n)

{txt}Summary statistics: mean, max, min, p25, p50, p75, skewness, kurtosis, sd, N
  by categories of: caland 

{ralign 8:caland} {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s     plots   fstruct       job       sex       age      educ
{hline 9}{c +}{hline 160}
{ralign 8:1} {...}
{c |}{...}
 {res} 413.2454  3.733979  10.96789  10.96546  .0044309  164.9466  107.0343  105.2652  107.9372  .1461268  1.621183  .6976183  .7317854  .8808685  54.31361  6.933636
{txt}{space 8} {...}
{c |}{...}
 {res}    562.5       9.8  33.33333  33.33433  2.858143   345.001   306.251   200.001  524.5464         1      14.1         3         1         1        75        17
{txt}{space 8} {...}
{c |}{...}
 {res} 183.3333        .2         1     1.001      .001    62.501      .001    50.001      .001         0         0         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res} 367.2414         2         6     6.001      .001   125.001  78.36122    67.001   86.8443         0       .85        .5  .6279592         1        47         5
{txt}{space 8} {...}
{c |}{...}
 {res} 428.5714       3.2        10    10.001      .001   160.001   105.001   102.501  102.6903         0  1.266667  .6666667   .800076         1        56         7
{txt}{space 8} {...}
{c |}{...}
 {res} 476.3305         5        14    14.001      .001   200.001  128.6617   136.331    120.32         0         2         1  .9061761         1        62         9
{txt}{space 8} {...}
{c |}{...}
 {res} -.777566  .6888181  1.246406  1.247808  30.30894  .6740137  .8151239  .4359911  3.066215  2.003624  3.087358  1.416376 -1.185653 -2.351453 -.2452367 -.2814688
{txt}{space 8} {...}
{c |}{...}
 {res} 3.054693  2.685202  4.519032  4.521198  1017.513  3.516442  4.832143  2.321276  21.58126  5.014508  18.24465  12.70627   3.77794  6.529332  2.397868  3.380831
{txt}{space 8} {...}
{c |}{...}
 {res} 85.60415  2.168182  6.576812  6.576973  .0795736  55.05486  45.27934   42.1627  58.37722  .3533369  1.266897  .3267784  .2272888  .3240382  10.48911  2.595733
{txt}{space 8} {...}
{c |}{...}
 {res}     1704      1704      1704      1704      1704      1704      1704      1704      1704      1704      1704      1704      1704      1704      1704      1704
{txt}{hline 9}{c +}{hline 160}
{ralign 8:2} {...}
{c |}{...}
 {res} 410.1628  13.61517  6.242687  6.212953  .0317346  164.6264  104.1474  94.49054  81.78359  .2551724  3.171894   .713618  .4951034   .937931  51.44828  6.765543
{txt}{space 8} {...}
{c |}{...}
 {res}      554        28  20.33898  20.33998   1.74013   345.001  241.7867  189.5465  524.5464         1        15         1  .9626168         1        75        12
{txt}{space 8} {...}
{c |}{...}
 {res}    182.5        10         1     1.001      .001    65.001      .001    50.001      .001         0       .85  .1666667  .0578264         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res} 366.6667        10  3.089431  3.090431      .001  127.4677  68.06551    70.001  62.54817         0         2  .5714286  .3331201         1        45         5
{txt}{space 8} {...}
{c |}{...}
 {res} 444.4445      12.5    4.8125  4.706882      .001  163.2153   108.001  89.28671  81.90852         0       2.7  .6666667  .4888645         1        49         8
{txt}{space 8} {...}
{c |}{...}
 {res} 454.5454        15        10  9.530412      .001  191.5465   125.001  116.1677   101.452         1      3.46         1  .6459627         1        59         8
{txt}{space 8} {...}
{c |}{...}
 {res} -1.03937  1.390867  1.200289  1.213098  7.638862  .5677027  .3048453  .5856261  2.860018   1.12317  2.495772 -.2136997  .0466681 -3.630053  .3114835 -.5534691
{txt}{space 8} {...}
{c |}{...}
 {res} 3.444779  4.438053  3.914755   3.94214  67.47522  3.454044  3.301369  2.875837  23.83565  2.261512  10.88104  2.176695  2.295668  14.17729  2.463548  3.525009
{txt}{space 8} {...}
{c |}{...}
 {res} 76.71574  4.039911  4.166281  4.167504  .1769971   51.0868  43.75115   31.6745  58.56892  .4374692   2.19849  .2209837  .2038477  .2421171  9.564061  2.490317
{txt}{space 8} {...}
{c |}{...}
 {res}      145       145       145       145       145       145       145       145       145       145       145       145       145       145       145       145
{txt}{hline 9}{c +}{hline 160}
{ralign 8:Total} {...}
{c |}{...}
 {res} 413.0036   4.50887  10.59734  10.59276  .0065721  164.9215  106.8079  104.4203  105.8862  .1546782  1.742791   .698873  .7132246  .8853434  54.08891  6.920454
{txt}{space 8} {...}
{c |}{...}
 {res}    562.5        28  33.33333  33.33433  2.858143   345.001   306.251   200.001  524.5464         1        15         3         1         1        75        17
{txt}{space 8} {...}
{c |}{...}
 {res}    182.5        .2         1     1.001      .001    62.501      .001    50.001      .001         0         0         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res} 366.6667         2  5.555555  5.556555      .001   125.001    77.501  67.77878  84.63868         0      .875        .5  .5909091         1        46         5
{txt}{space 8} {...}
{c |}{...}
 {res} 429.7959       3.6        10    10.001      .001   160.001   105.001  100.7153   101.001         0  1.357143  .6666667  .7802569         1        55         7
{txt}{space 8} {...}
{c |}{...}
 {res}      475         6  13.84615  13.84715      .001   200.001   128.001   134.501   120.001         0         2         1  .8985046         1        62         9
{txt}{space 8} {...}
{c |}{...}
 {res} -.791747  2.154757  1.261976  1.262821  23.03178  .6678827  .7798229   .464985  2.979434  1.909978  3.163764  1.381752 -1.016549 -2.418926 -.2010857  -.299041
{txt}{space 8} {...}
{c |}{...}
 {res} 3.083596  9.817855  4.614795  4.615348  618.8148   3.51858  4.738467  2.380725   21.2527  4.648016  18.70045  12.79151  3.258469  6.851203   2.37023  3.395695
{txt}{space 8} {...}
{c |}{...}
 {res} 84.92567  3.558668  6.544284  6.545923  .0912698  54.74108  45.15651  41.53049   58.7985  .3616955  1.424641  .3197331  .2342977  .3186932  10.44558  2.587363
{txt}{space 8} {...}
{c |}{...}
 {res}     1849      1849      1849      1849      1849      1849      1849      1849      1849      1849      1849      1849      1849      1849      1849      1849
{txt}{hline 9}{c BT}{hline 160}

{ralign 8:caland} {...}
{c |}{...}
     train    health    status
{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res} .0434272  4.502934   .209507
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 4.480226 -1.352819  1.427635
{txt}{space 8} {...}
{c |}{...}
 {res} 21.07243  4.602308  3.038143
{txt}{space 8} {...}
{c |}{...}
 {res} .2038767  .7188369  .4070763
{txt}{space 8} {...}
{c |}{...}
 {res}     1704      1704      1704
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res}  .062069  4.537931        .2
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         3         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 3.630053 -1.147594       1.5
{txt}{space 8} {...}
{c |}{...}
 {res} 14.17729  3.033754      3.25
{txt}{space 8} {...}
{c |}{...}
 {res} .2421171  .6772154  .4013865
{txt}{space 8} {...}
{c |}{...}
 {res}      145       145       145
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res} .0448891  4.505679  .2087615
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 4.395919 -1.340741  1.433177
{txt}{space 8} {...}
{c |}{...}
 {res} 20.32411  4.514698  3.053997
{txt}{space 8} {...}
{c |}{...}
 {res} .2071166  .7155472  .4065335
{txt}{space 8} {...}
{c |}{...}
 {res}     1849      1849      1849
{txt}{hline 9}{c BT}{hline 30}

{com}. tabstat yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status if year==2012, by(caland) statistics(mean ma mi q sk k sd n)

{txt}Summary statistics: mean, max, min, p25, p50, p75, skewness, kurtosis, sd, N
  by categories of: caland 

{ralign 8:caland} {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s     plots   fstruct       job       sex       age      educ
{hline 9}{c +}{hline 160}
{ralign 8:1} {...}
{c |}{...}
 {res} 403.4619  3.656385  10.85913  10.85051  .0106263  181.8397  126.6523  111.3828  113.3912  .1687531    1.6769  .8448898  .7329362  .8888332  54.41963  7.030432
{txt}{space 8} {...}
{c |}{...}
 {res}    562.5       9.8  33.33333  33.33433  2.858143   345.001   306.251   200.001  524.5464         1      11.2         3  .9974286         1        75        17
{txt}{space 8} {...}
{c |}{...}
 {res} 183.3333        .2         1  .2867143      .001    62.501      .001    50.001      .001         0         0         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res}      350       1.9  5.555555  5.556555      .001   147.001   84.0635    70.001  91.62262         0  .8833334        .4   .624099         1        47         5
{txt}{space 8} {...}
{c |}{...}
 {res} 416.6667       3.1        10    10.001      .001   175.001   120.001   106.251  109.5343         0  1.357143  .6666667  .7932042         1        56         7
{txt}{space 8} {...}
{c |}{...}
 {res} 470.5882         5  13.46939  13.46767      .001  213.3343  167.4429  144.5843   130.001         0         2         1  .9113756         1        62         9
{txt}{space 8} {...}
{c |}{...}
 {res}-.6690234   .626449  1.320294  1.317568  17.37721  .5645726  .4132899  .4198505  2.898343  1.768849  2.559988  1.526327 -1.160381 -2.473978 -.2836713 -.3765707
{txt}{space 8} {...}
{c |}{...}
 {res} 2.709098  2.482439  4.459437  4.451216  319.1712  3.415482  3.268847  2.019421  19.11332  4.128828  13.18962  5.548044  3.757921  7.120566  2.399585  3.451216
{txt}{space 8} {...}
{c |}{...}
 {res}   88.455  2.219466  7.021979  7.017354  .1468953  55.47341  61.47683  47.88369   63.4285  .3746275  1.233619  .6223448  .2272337  .3144173  10.40624  2.505723
{txt}{space 8} {...}
{c |}{...}
 {res}     1997      1997      1997      1997      1997      1997      1997      1997      1997      1997      1997      1997      1997      1997      1997      1997
{txt}{hline 9}{c +}{hline 160}
{ralign 8:2} {...}
{c |}{...}
 {res} 405.7242  13.53442  7.175169  7.151956  .0252133  190.6333  118.9529  110.2893  96.37339  .2077922   3.48976  .6516264  .5130299  .9350649  50.66234  6.928259
{txt}{space 8} {...}
{c |}{...}
 {res}      560        35        18    18.001     1.001  339.6306  258.5195   200.001  524.5464         1      14.1         2  .9011413         1        75        12
{txt}{space 8} {...}
{c |}{...}
 {res} 193.3333        10         1     1.001      .001  83.33434      .001    50.001      .001         0  .9166667         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res}      360        10         4     4.001      .001   150.001  93.82453    80.001   60.4888         0       2.2        .4  .3743861         1        44         5
{txt}{space 8} {...}
{c |}{...}
 {res} 403.0223        12  6.485294  6.486294      .001   195.062  115.1933  103.8343  95.20688         0  3.008333        .5   .539153         1        49         8
{txt}{space 8} {...}
{c |}{...}
 {res}      470      15.7        10    10.001      .001  221.7064   142.001   136.001  116.4526         0     3.925         1  .6696777         1        58         8
{txt}{space 8} {...}
{c |}{...}
 {res}-.4900448  1.695476  .5656778  .5700627  6.125546   .287482  .2660633  .5591116  2.116042  1.440415  2.216474  1.082457 -.4043755  -3.53121  .2251802 -.5458856
{txt}{space 8} {...}
{c |}{...}
 {res} 2.706671    6.6454  2.504934  2.509231  43.42756  2.915492  3.083276  2.603411  15.70808  3.074795  8.771792  4.257623  2.416126  13.46944  2.377291   3.46893
{txt}{space 8} {...}
{c |}{...}
 {res} 77.93394  4.319849  3.980013  3.976238  .1219706  47.95281  43.96639  43.61855  63.07239   .407051   2.26757  .4251844  .1984026  .2472152  9.602029  2.371134
{txt}{space 8} {...}
{c |}{...}
 {res}      154       154       154       154       154       154       154       154       154       154       154       154       154       154       154       154
{txt}{hline 9}{c +}{hline 160}
{ralign 8:3} {...}
{c |}{...}
 {res}      300        70  4.285714  2.143857  2.143857  157.1439  217.2867  174.2867  16.24465         0      9.85         1  .0581295         1        57         3
{txt}{space 8} {...}
{c |}{...}
 {res}      300        70  4.285714  2.143857  2.143857  157.1439  217.2867  174.2867  16.24465         0      9.85         1  .0581295         1        57         3
{txt}{space 8} {...}
{c |}{...}
 {res}      300        70  4.285714  2.143857  2.143857  157.1439  217.2867  174.2867  16.24465         0      9.85         1  .0581295         1        57         3
{txt}{space 8} {...}
{c |}{...}
 {res}      300        70  4.285714  2.143857  2.143857  157.1439  217.2867  174.2867  16.24465         0      9.85         1  .0581295         1        57         3
{txt}{space 8} {...}
{c |}{...}
 {res}      300        70  4.285714  2.143857  2.143857  157.1439  217.2867  174.2867  16.24465         0      9.85         1  .0581295         1        57         3
{txt}{space 8} {...}
{c |}{...}
 {res}      300        70  4.285714  2.143857  2.143857  157.1439  217.2867  174.2867  16.24465         0      9.85         1  .0581295         1        57         3
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .         .         .         .         .         .         .         .         .         .         .         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .         .         .         .         .         .         .         .         .         .         .         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .         .         .         .         .         .         .         .         .         .         .         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        1         1         1         1         1         1         1         1         1         1         1         1         1         1         1         1
{txt}{hline 9}{c +}{hline 160}
{ralign 8:Total} {...}
{c |}{...}
 {res} 403.5757  4.394099  10.59245  10.58179  .0126614  182.4575  126.1434  111.3338  112.1282  .1714684  1.810429  .8311317  .7168858  .8921933  54.15195  7.021247
{txt}{space 8} {...}
{c |}{...}
 {res}    562.5        70  33.33333  33.33433  2.858143   345.001   306.251   200.001  524.5464         1      14.1         3  .9974286         1        75        17
{txt}{space 8} {...}
{c |}{...}
 {res} 183.3333        .2         1  .2867143      .001    62.501      .001    50.001      .001         0         0         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res}      350         2  5.263158  5.264158      .001   147.001    85.001    70.001    90.001         0        .9        .4   .595288         1        47         5
{txt}{space 8} {...}
{c |}{...}
 {res} 416.6667       3.5        10    10.001      .001  176.0218   120.001   105.964  107.8454         0     1.475  .6666667    .77868         1        56         7
{txt}{space 8} {...}
{c |}{...}
 {res} 470.2941         6  13.33333  13.33433      .001   215.001  166.6677  143.4324   130.001         0       2.2         1  .9035802         1        62         9
{txt}{space 8} {...}
{c |}{...}
 {res} -.660831  4.177672  1.358007  1.354642  15.92898  .5436463  .4232437   .427399  2.819861  1.743254  2.824635  1.546497 -1.032122 -2.529169 -.2436924 -.3851132
{txt}{space 8} {...}
{c |}{...}
 {res} 2.718228  50.02238  4.652842  4.642662  274.4015  3.391723  3.325095  2.050844  18.76482  4.038933  15.47064  5.693606  3.384511  7.396695  2.363193  3.451036
{txt}{space 8} {...}
{c |}{...}
 {res} 87.73724  3.792897  6.913927  6.910989  .1523424   54.9959  60.43476  47.59075  63.55907  .3770054  1.423519  .6121751  .2326596  .3102082  10.39166  2.496865
{txt}{space 8} {...}
{c |}{...}
 {res}     2152      2152      2152      2152      2152      2152      2152      2152      2152      2152      2152      2152      2152      2152      2152      2152
{txt}{hline 9}{c BT}{hline 160}

{ralign 8:caland} {...}
{c |}{...}
     train    health    status
{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res} .0776164   4.49324   .237356
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 3.157217  -1.61373  1.234629
{txt}{space 8} {...}
{c |}{...}
 {res} 10.96802  5.955436  2.524308
{txt}{space 8} {...}
{c |}{...}
 {res}  .267634  .7627207  .4255688
{txt}{space 8} {...}
{c |}{...}
 {res}     1997      1997      1997
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res} .0649351  4.636364  .2467532
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         3         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}  3.53121 -1.293343  1.174827
{txt}{space 8} {...}
{c |}{...}
 {res} 13.46944  3.682446  2.380218
{txt}{space 8} {...}
{c |}{...}
 {res} .2472152  .5695794  .4325285
{txt}{space 8} {...}
{c |}{...}
 {res}      154       154       154
{txt}{hline 9}{c +}{hline 30}
{ralign 8:3} {...}
{c |}{...}
 {res}        1         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        1         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        1         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        1         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        1         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        1         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        1         1         1
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res} .0771375  4.503253  .2379182
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}  3.16977 -1.623287  1.230983
{txt}{space 8} {...}
{c |}{...}
 {res} 11.04744  6.021521   2.51532
{txt}{space 8} {...}
{c |}{...}
 {res} .2668716   .751251  .4259078
{txt}{space 8} {...}
{c |}{...}
 {res}     2152      2152      2152
{txt}{hline 9}{c BT}{hline 30}

{com}. tabstat yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status if year==2013, by(caland) statistics(mean ma mi q sk k sd n)

{txt}Summary statistics: mean, max, min, p25, p50, p75, skewness, kurtosis, sd, N
  by categories of: caland 

{ralign 8:caland} {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s     plots   fstruct       job       sex       age      educ
{hline 9}{c +}{hline 160}
{ralign 8:1} {...}
{c |}{...}
 {res}   411.87  3.660063  10.72691  10.71646  .0124499  178.3889  135.7323  119.4472   129.206  .2282092  1.724617    .67612  .7295536         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}    562.5       9.7  33.33333  33.33433  2.858143   345.001   306.251   200.001  524.5464         1  11.77143         3         1         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res} 182.2222        .2         1     1.001      .001    62.501      .001    50.001      .001         0         0         0         0         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res} 369.2308       1.8         5     5.001      .001  142.8582   100.001  76.66766    97.001         0        .9        .5   .610529         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}      420       3.1     9.375     9.376      .001  171.4296    131.58  117.7093  117.2232         0       1.4  .6666667  .8041788         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}    481.6         5        14    14.001      .001  205.5566  172.5686  162.2232   144.001         0      2.05         1  .9106813         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}-.8060528  .5976107   1.29342  1.295895  16.68044  .6262343  .2120741  .1518728  2.754124  1.295234  2.317993  1.328358 -1.190723         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 3.059083  2.392207    4.3542  4.361762  306.6781  3.652053  3.321218  1.782585  13.69122  2.677632  11.38019   13.2248  3.688119         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 85.70523  2.273029  7.244035  7.240413  .1471007  54.26542   60.2351  49.68891  78.62169  .4197891  1.272022  .3264892  .2373877         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}     1893      1893      1893      1893      1893      1893      1893      1893      1893      1893      1893      1893      1893      1893      1893      1893
{txt}{hline 9}{c +}{hline 160}
{ralign 8:2} {...}
{c |}{...}
 {res} 416.0389     13.21  6.757019  6.712315  .0467039  175.9965  134.3862  121.8931  111.7118       .35  3.435609  .8027311  .5304374         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}      510        40        21    21.001     2.001   313.001   244.001   200.001  524.5464         1      14.1         3  .9725278         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res} 196.2963        10         1     1.001      .001    80.001    30.001    50.001      .001         0  .1818182  .3333333         0         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res} 393.3036        10  3.439824  3.383353      .001   150.001  102.5177  84.33433  84.61274         0  2.208333        .6  .3721611         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res} 415.6967        12   5.50505   5.50605      .001  178.5465   130.001  117.3192   100.001         0      2.85       .75  .5543899         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res} 473.7749      14.9        10    10.001      .001   200.001  160.4484  152.0976   133.424         1      3.87         1  .7106279         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}-1.023687  2.552584  1.051693  1.069075  6.504282  .3939116   .257179  .2614249   2.54023  .6289709  2.231168  3.519562 -.4012487         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}  3.89013  12.53975  3.915748  3.972842  46.43063  4.336814   2.82678   2.10619  14.23213  1.395604  9.042761  18.93492  2.335809         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 69.15208  4.406502  4.225949  4.213216   .257981  39.47217  39.94657  43.88364  74.14678  .4784672  2.233273  .4059366   .216416         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}      160       160       160       160       160       160       160       160       160       160       160       160       160       160       160       160
{txt}{hline 9}{c +}{hline 160}
{ralign 8:3} {...}
{c |}{...}
 {res}    347.5        80         5     3.576     1.426   152.126   138.751   135.001  16.88425         0      9.85         1  .0593591         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}    347.5        80         5     3.576     1.426   152.126   138.751   135.001  16.88425         0      9.85         1  .0593591         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}    347.5        80         5     3.576     1.426   152.126   138.751   135.001  16.88425         0      9.85         1  .0593591         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}    347.5        80         5     3.576     1.426   152.126   138.751   135.001  16.88425         0      9.85         1  .0593591         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}    347.5        80         5     3.576     1.426   152.126   138.751   135.001  16.88425         0      9.85         1  .0593591         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}    347.5        80         5     3.576     1.426   152.126   138.751   135.001  16.88425         0      9.85         1  .0593591         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .         .         .         .         .         .         .         .         .         .         .         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .         .         .         .         .         .         .         .         .         .         .         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .         .         .         .         .         .         .         .         .         .         .         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        1         1         1         1         1         1         1         1         1         1         1         1         1         1         1         1
{txt}{hline 9}{c +}{hline 160}
{ralign 8:Total} {...}
{c |}{...}
 {res} 412.1634  4.441139  10.41488  10.40108  .0158064  178.1898  135.6289  119.6453  127.7886  .2375852  1.861854  .6861403  .7137168         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}    562.5        80  33.33333  33.33433  2.858143   345.001   306.251   200.001  524.5464         1      14.1         3         1         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res} 182.2222        .2         1     1.001      .001    62.501      .001    50.001      .001         0         0         0         0         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}    371.2         2         5     5.001      .001   143.001   100.001  78.14053  96.52731         0        .9        .5  .5782667         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}      420      3.55         9  8.974685      .001   171.876  131.2057  117.7441   117.001         0       1.5  .6666667  .7866658         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}    480.7         6  13.71429  13.63736      .001  204.3343  171.4296  160.8706  143.4793         0  2.333333         1  .9016242         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}-.8208713  5.096098   1.33724  1.339645  13.99982  .6286843  .2182146  .1551866  2.728678  1.233142   2.61827  1.661263 -1.066293         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 3.119044  74.16339  4.546737  4.553828  220.1413  3.739036  3.398271  1.806213   13.6904  2.520638  13.99234  14.77241  3.339486         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 84.51621  3.949853  7.133773  7.131766  .1617083  53.24673  58.88507  49.24487  78.42442  .4257073  1.455641  .3349596   .242113         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}     2054      2054      2054      2054      2054      2054      2054      2054      2054      2054      2054      2054      2054      2054      2054      2054
{txt}{hline 9}{c BT}{hline 160}

{ralign 8:caland} {...}
{c |}{...}
     train    health    status
{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res}        0         4  .2134179
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  1.398916
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  2.956967
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0  .4098285
{txt}{space 8} {...}
{c |}{...}
 {res}     1893      1893      1893
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res}        0         4     .2125
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  1.405604
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  2.975724
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0  .4103611
{txt}{space 8} {...}
{c |}{...}
 {res}      160       160       160
{txt}{hline 9}{c +}{hline 30}
{ralign 8:3} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        1         1         1
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res}        0         4  .2132425
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  1.400192
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  2.960537
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0  .4096972
{txt}{space 8} {...}
{c |}{...}
 {res}     2054      2054      2054
{txt}{hline 9}{c BT}{hline 30}

{com}. tabstat yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status if year==2014, by(caland) statistics(mean ma mi q sk k sd n)

{txt}Summary statistics: mean, max, min, p25, p50, p75, skewness, kurtosis, sd, N
  by categories of: caland 

{ralign 8:caland} {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s     plots   fstruct       job       sex       age      educ
{hline 9}{c +}{hline 160}
{ralign 8:1} {...}
{c |}{...}
 {res} 438.9973  3.567742    10.262  10.25999  .0040105  174.4045   139.835  119.2722  132.5497   .190803  1.650269  .6979188   .743944  .8874399  55.41935   6.96785
{txt}{space 8} {...}
{c |}{...}
 {res}    562.5       9.9  33.33333  33.33433  2.308692   345.001   306.251   200.001  524.5464         1        11         3         1         1        75        17
{txt}{space 8} {...}
{c |}{...}
 {res} 183.3333        .2         1     1.001      .001    62.501      .001    50.001      .001         0         0         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res} 395.8333       1.6         5     5.001      .001   138.126   100.001  78.33434   100.001         0       .86        .5  .6313102         1        47         5
{txt}{space 8} {...}
{c |}{...}
 {res} 461.5385         3       8.5     8.501      .001  166.6677  142.8582  113.3343  122.2232         0  1.333333  .6666667  .8134378         1        57         7
{txt}{space 8} {...}
{c |}{...}
 {res}      500         5  13.33333  13.33433      .001   202.501  173.3343   157.801   145.001         0         2         1  .9283357         1        63         9
{txt}{space 8} {...}
{c |}{...}
 {res}-.9629097  .6604081  1.321606  1.321315  28.18468  .7357856  .2712469  .2904346  2.580995  1.573785  2.519428   1.99761 -1.181635 -2.451731 -.2797755 -.3834932
{txt}{space 8} {...}
{c |}{...}
 {res} 3.236116  2.406922  4.302979  4.302663  858.1207   3.62405  3.024511  1.897755  12.76792    3.4768  12.75059  14.65556  3.748537  7.010983   2.31039  3.444464
{txt}{space 8} {...}
{c |}{...}
 {res} 90.11195  2.306876   7.52265  7.524032  .0704109   54.2724  66.09794  48.37741  80.29014   .393069  1.218791  .3769236  .2290722  .3161628  10.80448  2.666246
{txt}{space 8} {...}
{c |}{...}
 {res}     1457      1457      1457      1457      1457      1457      1457      1457      1457      1457      1457      1457      1457      1457      1457      1457
{txt}{hline 9}{c +}{hline 160}
{ralign 8:2} {...}
{c |}{...}
 {res} 468.6409  13.74214   5.82831  5.804594  .0257163  166.0322  151.2561  121.3956  105.7173  .4150943  3.444766  .8094691  .4941584  .9496855  52.10692  7.106312
{txt}{space 8} {...}
{c |}{...}
 {res}      560      35.5  31.54762  31.54862     2.001  252.3087  243.3343   200.001  524.5464         1      14.1         3   .926214         1        73        14
{txt}{space 8} {...}
{c |}{...}
 {res}      200        10         1     1.001      .001  81.66766  39.21669    50.001      .001         0  .8333333         0  .0401324         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res}      450        10  2.727273  2.728273      .001   150.001  131.8192    87.001    90.001         0       2.4        .6  .3622018         1        45         5
{txt}{space 8} {...}
{c |}{...}
 {res}    477.5        13         5  4.728272      .001  167.6677   150.001  116.3646   100.001         0       2.9       .75    .51648         1        51         8
{txt}{space 8} {...}
{c |}{...}
 {res}      500        15        10    10.001      .001  183.9422  172.1063   144.601  121.8443         1         4         1  .6593877         1        60         8
{txt}{space 8} {...}
{c |}{...}
 {res} -1.28303   2.04075  1.884597  1.880445  9.481484  .2774284 -.2767876  .5749802  3.776644  .3446278  2.322925  2.595607 -.2415153 -4.114363  .0076569 -.6431165
{txt}{space 8} {...}
{c |}{...}
 {res} 6.214674  8.245887  11.81254  11.72515  101.7323  3.405048  3.188904  2.307343  33.41429  1.118768  10.16709  13.35134  2.273061  17.92798  2.353619  3.846331
{txt}{space 8} {...}
{c |}{...}
 {res} 55.78656  4.441553  4.025755  4.037732  .1766014  30.24152  40.16082  41.05475  49.70304  .4942951  2.082439  .4678072   .213496  .2192837  9.574882  2.620761
{txt}{space 8} {...}
{c |}{...}
 {res}      159       159       159       159       159       159       159       159       159       159       159       159       159       159       159       159
{txt}{hline 9}{c +}{hline 160}
{ralign 8:3} {...}
{c |}{...}
 {res} 347.9088      78.9  4.942966  3.359682  1.585284  152.5992  105.1974  161.9782  13.94009         1      9.85         1  .0501466         1        59         3
{txt}{space 8} {...}
{c |}{...}
 {res} 347.9088      78.9  4.942966  3.359682  1.585284  152.5992  105.1974  161.9782  13.94009         1      9.85         1  .0501466         1        59         3
{txt}{space 8} {...}
{c |}{...}
 {res} 347.9088      78.9  4.942966  3.359682  1.585284  152.5992  105.1974  161.9782  13.94009         1      9.85         1  .0501466         1        59         3
{txt}{space 8} {...}
{c |}{...}
 {res} 347.9088      78.9  4.942966  3.359682  1.585284  152.5992  105.1974  161.9782  13.94009         1      9.85         1  .0501466         1        59         3
{txt}{space 8} {...}
{c |}{...}
 {res} 347.9088      78.9  4.942966  3.359682  1.585284  152.5992  105.1974  161.9782  13.94009         1      9.85         1  .0501466         1        59         3
{txt}{space 8} {...}
{c |}{...}
 {res} 347.9088      78.9  4.942966  3.359682  1.585284  152.5992  105.1974  161.9782  13.94009         1      9.85         1  .0501466         1        59         3
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .         .         .         .         .         .         .         .         .         .         .         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .         .         .         .         .         .         .         .         .         .         .         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .         .         .         .         .         .         .         .         .         .         .         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        1         1         1         1         1         1         1         1         1         1         1         1         1         1         1         1
{txt}{hline 9}{c +}{hline 160}
{ralign 8:Total} {...}
{c |}{...}
 {res} 441.8558   4.61478  9.822741  9.817618  .0071227  173.5677  140.9366  119.5074  129.8379  .2133581  1.831793  .7090744  .7189535  .8936302  55.09586  6.979011
{txt}{space 8} {...}
{c |}{...}
 {res}    562.5      78.9  33.33333  33.33433  2.308692   345.001   306.251   200.001  524.5464         1      14.1         3         1         1        75        17
{txt}{space 8} {...}
{c |}{...}
 {res} 183.3333        .2         1     1.001      .001    62.501      .001    50.001      .001         0         0         0         0         0        31         0
{txt}{space 8} {...}
{c |}{...}
 {res}      400       1.8  4.666667  4.652163      .001   140.001   100.001    81.251    97.001         0        .9        .5  .5816694         1        47         5
{txt}{space 8} {...}
{c |}{...}
 {res} 466.6667       3.5     8.125     8.126      .001  166.6677   145.001  113.3343   120.001         0       1.5  .6666667  .7894382         1        57         7
{txt}{space 8} {...}
{c |}{...}
 {res}      500         6      12.5    12.501      .001   200.001  173.0779  157.1439   145.001         0       2.3         1  .9156162         1        63         9
{txt}{space 8} {...}
{c |}{...}
 {res}-1.025555  4.591881  1.400453   1.39919  19.02732  .7719868  .2309493  .3041164   2.66442  1.399351  2.719661  2.132165 -.9978963 -2.553467 -.2413476 -.4066719
{txt}{space 8} {...}
{c |}{...}
 {res} 3.450615  57.62034  4.625031  4.621659  395.3281  3.832473  3.117293  1.934082  13.54917  2.958183  14.74254  14.83075  3.197697  7.520194  2.295511  3.471438
{txt}{space 8} {...}
{c |}{...}
 {res} 87.77178  4.395863  7.370916   7.37474  .0953946  52.43823  64.08142   47.6966  78.24296  .4098052  1.444939  .3880181  .2398896  .3084057  10.72964  2.662342
{txt}{space 8} {...}
{c |}{...}
 {res}     1617      1617      1617      1617      1617      1617      1617      1617      1617      1617      1617      1617      1617      1617      1617      1617
{txt}{hline 9}{c BT}{hline 160}

{ralign 8:caland} {...}
{c |}{...}
     train    health    status
{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res} .0741249  4.498284  .2072752
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 3.251277 -1.642086  1.444291
{txt}{space 8} {...}
{c |}{...}
 {res}  11.5708  6.133607  3.085975
{txt}{space 8} {...}
{c |}{...}
 {res}  .262064  .7578553  .4054936
{txt}{space 8} {...}
{c |}{...}
 {res}     1457      1457      1457
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res} .0691824  4.654088  .1823899
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         3         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 3.395419 -1.376224  1.644942
{txt}{space 8} {...}
{c |}{...}
 {res} 12.52887  3.914957  3.705836
{txt}{space 8} {...}
{c |}{...}
 {res} .2545658  .5624024  .3873857
{txt}{space 8} {...}
{c |}{...}
 {res}      159       159       159
{txt}{hline 9}{c +}{hline 30}
{ralign 8:3} {...}
{c |}{...}
 {res}        1         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        1         1         1
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res} .0742115  4.513915  .2047001
{txt}{space 8} {...}
{c |}{...}
 {res}        1         5         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         1         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         5         0
{txt}{space 8} {...}
{c |}{...}
 {res} 3.248871 -1.660872  1.463757
{txt}{space 8} {...}
{c |}{...}
 {res} 11.55516  6.239552  3.142584
{txt}{space 8} {...}
{c |}{...}
 {res} .2621959   .742094  .4036071
{txt}{space 8} {...}
{c |}{...}
 {res}     1617      1617      1617
{txt}{hline 9}{c BT}{hline 30}

{com}. tabstat yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status if year==2015, by(caland) statistics(mean ma mi q sk k sd n)

{txt}Summary statistics: mean, max, min, p25, p50, p75, skewness, kurtosis, sd, N
  by categories of: caland 

{ralign 8:caland} {...}
{c |}{...}
     yield      land     labor    flabor    elabor   fertile   machane        ot   subsidy  insura~s     plots   fstruct       job       sex       age      educ
{hline 9}{c +}{hline 160}
{ralign 8:1} {...}
{c |}{...}
 {res} 440.8157  3.600139  10.52663  10.52304  .0055906  175.2114  139.3593  130.5899  123.1578  .1720056  1.619739  .6651808  .7519475         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}    562.5       9.9  33.33333  33.33433  2.858143   345.001   306.251   200.001  524.5464         1        11         3         1         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res} 185.7143        .2         1      .001      .001    62.501      .001    50.001      .001         0         0         0         0         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}      400       1.7         5     5.001      .001   140.001   100.001  84.47564  87.00264         0      .875        .5  .6465585         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res} 452.4405         3        10    10.001      .001   168.001   140.001  131.0754   112.001         0  1.333333  .6666667   .822753         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}      500         5  13.88562  13.88662      .001   205.001   175.001  181.3213  136.0243         0         2         1  .9278372         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}-.9676796  .6218002  1.244268  1.241975  26.02038  .6533365  .0786608 -.0332947   2.54115  1.738247  2.420762  1.334872 -1.283208         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 3.415206  2.469551  4.263727  4.262962  764.1771  3.515893  3.284468   1.65934  12.27357  4.021503  12.48097  11.15897   4.01188         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 85.40629  2.292749  7.218717  7.221008  .0896604  52.54288  61.42184  51.46561  81.24285  .3775168  1.153008   .345067  .2290496         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}     1436      1436      1436      1436      1436      1436      1436      1436      1436      1436      1436      1436      1436      1436      1436      1436
{txt}{hline 9}{c +}{hline 160}
{ralign 8:2} {...}
{c |}{...}
 {res} 456.6706  14.81627  7.095618  7.055389  .0422292  166.8195  154.8494  138.5973  100.3458  .4638554  3.571681  .8193171  .5308277         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}      560        47  33.33333   32.9088     2.001   261.251   247.001   200.001  524.5464         1    11.875         3  .9303697         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res} 184.3478        10         1     1.001      .001    97.501  53.84715    50.001      .001         0        .1  .2857143  .0618665         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res} 406.5041        11         4     4.001      .001  145.4556  128.0963   105.001    75.001         0       2.4      .625  .3895972         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res} 470.9375     13.35  6.396104  6.397104      .001  168.2873   156.524  137.7108    90.001         0  3.008333       .75  .5360177         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}      500        17        10    10.001      .001  185.9883  188.5068   185.201   110.001         1  4.166667         1  .6985927         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}-1.113567  2.305474  1.721924  1.694885  6.964427  .2123923 -.3140974 -.0337573  4.175398  .1449576  1.881881  2.655494 -.2420735         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 5.313038  10.72762  10.55818  10.28739  51.37705  3.144409  2.599074   1.86934    26.197  1.021013  7.402403  13.65372  2.280747         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 60.30429  5.555007  4.270972  4.246411  .2542178  30.70004  39.66398  44.32445  66.98137  .5002008  2.032486  .3757317  .2158172         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}      166       166       166       166       166       166       166       166       166       166       166       166       166       166       166       166
{txt}{hline 9}{c +}{hline 160}
{ralign 8:3} {...}
{c |}{...}
 {res}      400        95  4.736842  3.264158  1.474684  134.3168  112.1063    133.58  12.71166         1      9.85         1  .0322488         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}      400        95  4.736842  3.264158  1.474684  134.3168  112.1063    133.58  12.71166         1      9.85         1  .0322488         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}      400        95  4.736842  3.264158  1.474684  134.3168  112.1063    133.58  12.71166         1      9.85         1  .0322488         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}      400        95  4.736842  3.264158  1.474684  134.3168  112.1063    133.58  12.71166         1      9.85         1  .0322488         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}      400        95  4.736842  3.264158  1.474684  134.3168  112.1063    133.58  12.71166         1      9.85         1  .0322488         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}      400        95  4.736842  3.264158  1.474684  134.3168  112.1063    133.58  12.71166         1      9.85         1  .0322488         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .         .         .         .         .         .         .         .         .         .         .         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .         .         .         .         .         .         .         .         .         .         .         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .         .         .         .         .         .         .         .         .         .         .         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        1         1         1         1         1         1         1         1         1         1         1         1         1         1         1         1
{txt}{hline 9}{c +}{hline 160}
{ralign 8:Total} {...}
{c |}{...}
 {res} 442.4321  4.818653  10.16772  10.15942  .0103012  174.3168  140.9464   131.421  120.7266  .2027449  1.827009  .6813514  .7286003         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}    562.5        95  33.33333  33.33433  2.858143   345.001   306.251   200.001  524.5464         1    11.875         3         1         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res} 184.3478        .2         1      .001      .001    62.501      .001    50.001      .001         0         0         0         0         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}      400       1.9         5     5.001      .001   140.001  105.5566  86.66766    84.001         0        .9        .5  .6005998         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res} 454.5454       3.6  9.459459  9.412766      .001   168.001   140.001  131.6187  111.3343         0       1.5  .6666667  .7989897         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res}      500         6  13.07692  13.07792      .001   200.001  177.3694  181.5304  133.3343         0       2.3         1  .9174427         0  54.39701  6.975917
{txt}{space 8} {...}
{c |}{...}
 {res} -1.00562  5.599488   1.32246  1.319872  16.37369  .6869163  .0246207 -.0449142  2.642821  1.478719  2.560414  1.491967 -1.084533         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 3.590584   77.3369  4.586707  4.582234  299.5358  3.705614  3.350068  1.687976  12.95838  3.186611  13.08944  11.56248  3.395335         .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res} 83.26392  4.965036  7.047574  7.050613  .1237796  50.76981  59.70099  50.80262  80.18765  .4021695  1.417891   .351382  .2379837         0         0         0
{txt}{space 8} {...}
{c |}{...}
 {res}     1603      1603      1603      1603      1603      1603      1603      1603      1603      1603      1603      1603      1603      1603      1603      1603
{txt}{hline 9}{c BT}{hline 160}

{ralign 8:caland} {...}
{c |}{...}
     train    health    status
{hline 9}{c +}{hline 30}
{ralign 8:1} {...}
{c |}{...}
 {res}        0         4  .2103064
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  1.421718
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  3.021281
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0  .4076682
{txt}{space 8} {...}
{c |}{...}
 {res}     1436      1436      1436
{txt}{hline 9}{c +}{hline 30}
{ralign 8:2} {...}
{c |}{...}
 {res}        0         4   .253012
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  1.136262
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  2.291091
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0  .4360532
{txt}{space 8} {...}
{c |}{...}
 {res}      166       166       166
{txt}{hline 9}{c +}{hline 30}
{ralign 8:3} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .         .
{txt}{space 8} {...}
{c |}{...}
 {res}        1         1         1
{txt}{hline 9}{c +}{hline 30}
{ralign 8:Total} {...}
{c |}{...}
 {res}        0         4  .2145976
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         1
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        0         4         0
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  1.390366
{txt}{space 8} {...}
{c |}{...}
 {res}        .         .  2.933116
{txt}{space 8} {...}
{c |}{...}
 {res}        0         0   .410671
{txt}{space 8} {...}
{c |}{...}
 {res}     1603      1603      1603
{txt}{hline 9}{c BT}{hline 30}

{com}. xtsum yield land labor  flabor elabor fertile machane ot subsidy insurance plots fstruct job sex age educ train health status

{txt}Variable         {c |}      Mean   Std. Dev.       Min        Max {c |}    Observations
{hline 17}{c +}{hline 44}{c +}{hline 16}
yield{col 10}overall {c |} {res} 420.7463   87.17527   182.2222      562.5{txt} {c |}{col 69}N =    9275
{col 10}between {c |}{col 31}{res} 85.76353   183.3333      562.5{txt} {c |}{col 69}n =    2794
{col 10}within  {c |}{col 31}{res} 38.55542   194.0796   615.8827{txt} {c |} T-bar = 3.31961
{col 18}{c |}{col 63}{c |}
land{col 10}overall {c |} {res} 4.539245   4.118386         .2         95{txt} {c |}{col 69}N =    9275
{col 10}between {c |}{col 31}{res} 3.662066         .2      69.38{txt} {c |}{col 69}n =    2794
{col 10}within  {c |}{col 31}{res} 1.294033  -41.84076   30.15924{txt} {c |} T-bar = 3.31961
{col 18}{c |}{col 63}{c |}
labor{col 10}overall {c |} {res}  10.3465   7.001067          1   33.33333{txt} {c |}{col 69}N =    9275
{col 10}between {c |}{col 31}{res}  6.60045          1   33.33333{txt} {c |}{col 69}n =    2794
{col 10}within  {c |}{col 31}{res} 2.458185   -7.36183    33.6149{txt} {c |} T-bar = 3.31961
{col 18}{c |}{col 63}{c |}
flabor{col 10}overall {c |} {res} 10.33773   7.001432       .001   33.33433{txt} {c |}{col 69}N =    9275
{col 10}between {c |}{col 31}{res} 6.600686   .2867143   33.33433{txt} {c |}{col 69}n =    2794
{col 10}within  {c |}{col 31}{res} 2.459603    -7.3706   33.60613{txt} {c |} T-bar = 3.31961
{col 18}{c |}{col 63}{c |}
elabor{col 10}overall {c |} {res} .0107704   .1306761       .001   2.858143{txt} {c |}{col 69}N =    9275
{col 10}between {c |}{col 31}{res} .1108663       .001   2.858143{txt} {c |}{col 69}n =    2794
{col 10}within  {c |}{col 31}{res} .0838025  -1.710841   2.296485{txt} {c |} T-bar = 3.31961
{col 18}{c |}{col 63}{c |}
fertile{col 10}overall {c |} {res} 175.0597   53.72627     62.501    345.001{txt} {c |}{col 69}N =    9275
{col 10}between {c |}{col 31}{res} 47.96907     62.501    345.001{txt} {c |}{col 69}n =    2794
{col 10}within  {c |}{col 31}{res}  28.6728  -18.06527   355.6709{txt} {c |} T-bar = 3.31961
{col 18}{c |}{col 63}{c |}
machane{col 10}overall {c |} {res} 129.5269   59.25646       .001    306.251{txt} {c |}{col 69}N =    9275
{col 10}between {c |}{col 31}{res}  54.7204       .001    306.251{txt} {c |}{col 69}n =    2794
{col 10}within  {c |}{col 31}{res} 28.65964  -74.63978   316.1936{txt} {c |} T-bar = 3.31961
{col 18}{c |}{col 63}{c |}
ot{col 10}overall {c |} {res} 116.6928   48.22432     50.001    200.001{txt} {c |}{col 69}N =    9275
{col 10}between {c |}{col 31}{res} 44.98404     50.001    200.001{txt} {c |}{col 69}n =    2794
{col 10}within  {c |}{col 31}{res} 20.11775   23.44283   228.3178{txt} {c |} T-bar = 3.31961
{col 18}{c |}{col 63}{c |}
subsidy{col 10}overall {c |} {res} 118.9255   72.44478       .001   524.5464{txt} {c |}{col 69}N =    9275
{col 10}between {c |}{col 31}{res} 62.96354       .001   524.5464{txt} {c |}{col 69}n =    2794
{col 10}within  {c |}{col 31}{res} 40.45465  -180.7109   475.3854{txt} {c |} T-bar = 3.31961
{col 18}{c |}{col 63}{c |}
insura~s{col 10}overall {c |} {res} .1954717   .3965848          0          1{txt} {c |}{col 69}N =    9275
{col 10}between {c |}{col 31}{res} .3363034          0          1{txt} {c |}{col 69}n =    2794
{col 10}within  {c |}{col 31}{res} .2280947  -.6045283   .9954717{txt} {c |} T-bar = 3.31961
{col 18}{c |}{col 63}{c |}
plots{col 10}overall {c |} {res} 1.814923   1.433942          0         15{txt} {c |}{col 69}N =    9275
{col 10}between {c |}{col 31}{res} 1.433166          0       14.1{txt} {c |}{col 69}n =    2794
{col 10}within  {c |}{col 31}{res} .3206925  -5.069692   8.699539{txt} {c |} T-bar = 3.31961
{col 18}{c |}{col 63}{c |}
fstruct{col 10}overall {c |} {res} .7254904   .4279602          0          3{txt} {c |}{col 69}N =    9275
{col 10}between {c |}{col 31}{res} .3117049          0          3{txt} {c |}{col 69}n =    2794
{col 10}within  {c |}{col 31}{res} .3210997   -1.07451    3.12549{txt} {c |} T-bar = 3.31961
{col 18}{c |}{col 63}{c |}
job{col 10}overall {c |} {res} .7178392   .2372968          0          1{txt} {c |}{col 69}N =    9275
{col 10}between {c |}{col 31}{res} .2211969          0    .997035{txt} {c |}{col 69}n =    2794
{col 10}within  {c |}{col 31}{res} .1067173   .0157621   1.376635{txt} {c |} T-bar = 3.31961
{col 18}{c |}{col 63}{c |}
sex{col 10}overall {c |} {res} .5392992   .4984801          0          1{txt} {c |}{col 69}N =    9275
{col 10}between {c |}{col 31}{res} .2907553          0          1{txt} {c |}{col 69}n =    2794
{col 10}within  {c |}{col 31}{res}  .438378  -.2107008   1.339299{txt} {c |} T-bar = 3.31961
{col 18}{c |}{col 63}{c |}
age{col 10}overall {c |} {res} 54.40057   8.183333         31         75{txt} {c |}{col 69}N =    9275
{col 10}between {c |}{col 31}{res} 6.874113         31         75{txt} {c |}{col 69}n =    2794
{col 10}within  {c |}{col 31}{res} 5.129468   31.64176   80.24176{txt} {c |} T-bar = 3.31961
{col 18}{c |}{col 63}{c |}
educ{col 10}overall {c |} {res} 6.975917   2.004035          0         17{txt} {c |}{col 69}N =    9275
{col 10}between {c |}{col 31}{res} 1.645463          0         15{txt} {c |}{col 69}n =    2794
{col 10}within  {c |}{col 31}{res} 1.268928  -1.024083   17.23194{txt} {c |} T-bar = 3.31961
{col 18}{c |}{col 63}{c |}
train{col 10}overall {c |} {res} .0397844   .1954628          0          1{txt} {c |}{col 69}N =    9275
{col 10}between {c |}{col 31}{res}  .157518          0          1{txt} {c |}{col 69}n =    2794
{col 10}within  {c |}{col 31}{res} .1342316  -.7102156   .8397844{txt} {c |} T-bar = 3.31961
{col 18}{c |}{col 63}{c |}
health{col 10}overall {c |} {res}  4.30717   .6247599          1          5{txt} {c |}{col 69}N =    9275
{col 10}between {c |}{col 31}{res} .4706256          1          5{txt} {c |}{col 69}n =    2794
{col 10}within  {c |}{col 31}{res} .4484235    1.50717    6.30717{txt} {c |} T-bar = 3.31961
{col 18}{c |}{col 63}{c |}
status{col 10}overall {c |} {res} .2168194   .4121008          0          1{txt} {c |}{col 69}N =    9275
{col 10}between {c |}{col 31}{res} .3455718          0          1{txt} {c |}{col 69}n =    2794
{col 10}within  {c |}{col 31}{res} .2384037  -.5831806   1.016819{txt} {c |} T-bar = 3.31961

{com}. 
. **方差分析
. oneway yield caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}    yield
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res}  419.7224
  {txt}        2 {c |}  {res} 432.19716
  {txt}        3 {c |}  {res} 348.85219
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 420.74631

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 132372.427      2   66186.2135      8.72     0.0002
{txt} Within groups     {res} 70345647.1   9272   7586.89032
{txt}{hline 72}
    Total          {res} 70478019.5   9274   7599.52766

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 47.1356{txt}  Prob>chi2 = {res}0.000

                        {txt}Comparison of yield by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} 12.4748
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res}-70.8702    -83.345
         {txt}{c |}  {res}    0.311      0.169
{txt}
{com}. //oneway income cland, mean bonferroni 
. //oneway profit cland, mean bonferroni 
. oneway labor caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   laboro,
            {c |} Winsorized
            {c |}  fraction
            {c |}     .01
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 10.692705
  {txt}        2 {c |}  {res} 6.6273756
  {txt}        3 {c |}  {res} 4.7413805
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 10.346503

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 11987.0996      2   5993.54982    125.56     0.0000
{txt} Within groups     {res} 442577.439   9272   47.7326832
{txt}{hline 72}
    Total          {res} 454564.539   9274   49.0149384

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}308.1113{txt}  Prob>chi2 = {res}0.000

           {txt}Comparison of laboro, Winsorized fraction .01 by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-4.06533
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res}-5.95132     -1.886
         {txt}{c |}  {res}    0.255      1.000
{txt}
{com}. oneway flabor caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   flabor
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 10.686903
  {txt}        2 {c |}  {res} 6.5948656
  {txt}        3 {c |}  {res} 3.0859241
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 10.337732

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 12228.1892      2   6114.09458    128.15     0.0000
{txt} Within groups     {res} 442383.737   9272   47.7117921
{txt}{hline 72}
    Total          {res} 454611.926   9274   49.0200481

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}305.5544{txt}  Prob>chi2 = {res}0.000

                        {txt}Comparison of flabor by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-4.09204
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res}-7.60098   -3.50894
         {txt}{c |}  {res}    0.083      0.933
{txt}
{com}. oneway elabor caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   elabor
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .00780134
  {txt}        2 {c |}  {res}  .0345101
  {txt}        3 {c |}  {res} 1.6574563
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} .01077043

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 11.3629546      2   5.68147732    358.35     0.0000
{txt} Within groups     {res} 147.002044   9272   .015854405
{txt}{hline 72}
    Total          {res} 158.364999   9274   .017076235

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}625.0873{txt}  Prob>chi2 = {res}0.000

                        {txt}Comparison of elabor by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} .026709
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res} 1.64965    1.62295
         {txt}{c |}  {res}    0.000      0.000
{txt}
{com}. oneway machane caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   machane
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 129.15187
  {txt}        2 {c |}  {res} 133.51612
  {txt}        3 {c |}  {res} 143.33536
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 129.52689

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 14432.8534      2   7216.42672      2.06     0.1281
{txt} Within groups     {res} 32549619.2   9272   3510.52838
{txt}{hline 72}
    Total          {res}   32564052   9274   3511.32758

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 92.7436{txt}  Prob>chi2 = {res}0.000

                       {txt}Comparison of machane by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} 4.36425
         {txt}{c |}  {res}    0.145
         {txt}{c |}
       3 {c |}   {res} 14.1835    9.81924
         {txt}{c |}  {res}    1.000      1.000
{txt}
{com}. oneway ot caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}     ot
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 116.55751
  {txt}        2 {c |}  {res} 117.98167
  {txt}        3 {c |}  {res} 151.21147
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 116.69283

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 6223.87699      2    3111.9385      1.34     0.2624
{txt} Within groups     {res} 21561253.3   9272   2325.41559
{txt}{hline 72}
    Total          {res} 21567477.2   9274    2325.5852

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 17.1226{txt}  Prob>chi2 = {res}0.000

                          {txt}Comparison of ot by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} 1.42417
         {txt}{c |}  {res}    1.000
         {txt}{c |}
       3 {c |}   {res}  34.654    33.2298
         {txt}{c |}  {res}    0.452      0.508
{txt}
{com}. oneway subsidy caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   subsidy
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 120.76513
  {txt}        2 {c |}  {res} 99.541418
  {txt}        3 {c |}  {res} 14.945162
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 118.92549

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 366551.802      2   183275.901     35.18     0.0000
{txt} Within groups     {res} 48305682.5   9272   5209.84496
{txt}{hline 72}
    Total          {res} 48672234.3   9274    5248.2461

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 40.3284{txt}  Prob>chi2 = {res}0.000

                       {txt}Comparison of subsidy by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-21.2237
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res} -105.82   -84.5963
         {txt}{c |}  {res}    0.010      0.058
{txt}
{com}. oneway insurance caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |} insurances
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .18180747
  {txt}        2 {c |}  {res} .34183673
  {txt}        3 {c |}  {res}        .5
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res}  .1954717

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 18.7509828      2   9.37549141     60.37     0.0000
{txt} Within groups     {res} 1439.85883   9272   .155291073
{txt}{hline 72}
    Total          {res} 1458.60981   9274   .157279471

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 66.6959{txt}  Prob>chi2 = {res}0.000

                      {txt}Comparison of insurances by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} .160029
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res} .318193    .158163
         {txt}{c |}  {res}    0.319      1.000
{txt}
{com}. oneway plots caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}    plots
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res}  1.662113
  {txt}        2 {c |}  {res} 3.4281404
  {txt}        3 {c |}  {res} 9.8500004
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 1.8149235

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 2496.76561      2   1248.38281    698.45     0.0000
{txt} Within groups     {res}  16572.347   9272   1.78735408
{txt}{hline 72}
    Total          {res} 19069.1126   9274   2.05619071

{txt}Bartlett's test for equal variances:  chi2({res}1{txt}) = {res}614.2610{txt}  Prob>chi2 = {res}0.000

{txt}note: Bartlett's test performed on cells with positive variance:
      1 multiple-observation cells not used

                        Comparison of plots by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} 1.76603
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res} 8.18789    6.42186
         {txt}{c |}  {res}    0.000      0.000
{txt}
{com}. oneway fstruct caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}  fstructs,
            {c |} Winsorized
            {c |}  fraction
            {c |}     .01
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .72203948
  {txt}        2 {c |}  {res}  .7614468
  {txt}        3 {c |}  {res}         1
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} .72549038

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 1.41609696      2   .708048482      3.87     0.0209
{txt} Within groups     {res} 1697.11652   9272   .183036726
{txt}{hline 72}
    Total          {res} 1698.53262   9274   .183149948

{txt}Bartlett's test for equal variances:  chi2({res}1{txt}) = {res} 10.3063{txt}  Prob>chi2 = {res}0.001

{txt}note: Bartlett's test performed on cells with positive variance:
      1 multiple-observation cells not used

          Comparison of fstructs, Winsorized fraction .01 by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} .039407
         {txt}{c |}  {res}    0.041
         {txt}{c |}
       3 {c |}   {res} .277961    .238553
         {txt}{c |}  {res}    0.582      0.798
{txt}
{com}. oneway job caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}     job
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .73705713
  {txt}        2 {c |}  {res}  .5132081
  {txt}        3 {c |}  {res} .04997101
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} .71783924

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 37.7478122      2   18.8739061    361.22     0.0000
{txt} Within groups     {res} 484.468867   9272   .052250741
{txt}{hline 72}
    Total          {res} 522.216679   9274   .056309756

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 24.5841{txt}  Prob>chi2 = {res}0.000

                         {txt}Comparison of job by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-.223849
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res}-.687086   -.463237
         {txt}{c |}  {res}    0.000      0.000
{txt}
{com}. oneway sex caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}     sex
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .53835277
  {txt}        2 {c |}  {res}  .5497449
  {txt}        3 {c |}  {res}        .5
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} .53929919

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} .099323972      2   .049661986      0.20     0.8189
{txt} Within groups     {res} 2304.32612   9272    .24852525
{txt}{hline 72}
    Total          {res} 2304.42544   9274   .248482364

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}  0.1383{txt}  Prob>chi2 = {res}0.933

                         {txt}Comparison of sex by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} .011392
         {txt}{c |}  {res}    1.000
         {txt}{c |}
       3 {c |}   {res}-.038353   -.049745
         {txt}{c |}  {res}    1.000      1.000
{txt}
{com}. oneway age caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}    agee,
            {c |} Winsorized
            {c |}  fraction
            {c |}     .01
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 54.561099
  {txt}        2 {c |}  {res} 52.653604
  {txt}        3 {c |}  {res} 56.198505
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 54.400568

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 2624.31811      2   1312.15906     19.67     0.0000
{txt} Within groups     {res} 618427.032   9272   66.6983425
{txt}{hline 72}
    Total          {res}  621051.35   9274   66.9669344

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 17.0163{txt}  Prob>chi2 = {res}0.000

            {txt}Comparison of agee, Winsorized fraction .01 by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-1.90749
         {txt}{c |}  {res}    0.000
         {txt}{c |}
       3 {c |}   {res} 1.63741     3.5449
         {txt}{c |}  {res}    1.000      1.000
{txt}
{com}. oneway educ caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}    educ
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 6.9788705
  {txt}        2 {c |}  {res} 6.9540921
  {txt}        3 {c |}  {res} 4.9879587
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 6.9759174

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 16.2553861      2   8.12769303      2.02     0.1322
{txt} Within groups     {res} 37229.5781   9272   4.01526943
{txt}{hline 72}
    Total          {res} 37245.8335   9274    4.0161563

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res}  3.9288{txt}  Prob>chi2 = {res}0.140

                         {txt}Comparison of educ by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-.024778
         {txt}{c |}  {res}    1.000
         {txt}{c |}
       3 {c |}   {res}-1.99091   -1.96613
         {txt}{c |}  {res}    0.141      0.151
{txt}
{com}. oneway train caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}    train
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .03970779
  {txt}        2 {c |}  {res} .03826531
  {txt}        3 {c |}  {res}        .5
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} .03978437

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} .849052602      2   .424526301     11.14     0.0000
{txt} Within groups     {res} 353.470516   9272   .038122359
{txt}{hline 72}
    Total          {res} 354.319569   9274    .03820569

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 16.2670{txt}  Prob>chi2 = {res}0.000

                        {txt}Comparison of train by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res}-.001442
         {txt}{c |}  {res}    1.000
         {txt}{c |}
       3 {c |}   {res} .460292    .461735
         {txt}{c |}  {res}    0.000      0.000
{txt}
{com}. oneway health caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   health
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} 4.3025804
  {txt}        2 {c |}  {res} 4.3571429
  {txt}        3 {c |}  {res}      4.25
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} 4.3071698

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} 2.14971868      2   1.07485934      2.75     0.0637
{txt} Within groups     {res} 3617.72349   9272   .390177253
{txt}{hline 72}
    Total          {res} 3619.87321   9274   .390324909

{txt}Bartlett's test for equal variances:  chi2({res}2{txt}) = {res} 23.2247{txt}  Prob>chi2 = {res}0.000

                        {txt}Comparison of health by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} .054562
         {txt}{c |}  {res}    0.058
         {txt}{c |}
       3 {c |}   {res} -.05258   -.107143
         {txt}{c |}  {res}    1.000      1.000
{txt}
{com}. oneway status caland, mean bonferroni 

            {txt}{c |} Summary of
            {c |}   status
     caland {c |}        Mean
{hline 12}{c +}{hline 12}
          1 {c |}  {res} .21668434
  {txt}        2 {c |}  {res} .21938776
  {txt}        3 {c |}  {res}         0
{txt}{hline 12}{c +}{hline 12}
      Total {c |}  {res} .21681941

                        {txt}Analysis of Variance
    Source              SS         df      MS            F     Prob > F
{hline 72}
Between groups     {res} .193369035      2   .096684518      0.57     0.5660
{txt} Within groups     {res}  1574.7828   9272   .169842839
{txt}{hline 72}
    Total          {res} 1574.97617   9274   .169827062

{txt}Bartlett's test for equal variances:  chi2({res}1{txt}) = {res}  0.0367{txt}  Prob>chi2 = {res}0.848

{txt}note: Bartlett's test performed on cells with positive variance:
      1 multiple-observation cells not used

                        Comparison of status by caland
                                (Bonferroni)
Row Mean-{c |}
Col Mean {c |}          1          2
{hline 9}{c +}{hline 22}
       2 {c |}   {res} .002703
         {txt}{c |}  {res}    1.000
         {txt}{c |}
       3 {c |}   {res}-.216684   -.219388
         {txt}{c |}  {res}    0.879      0.865
{txt}
{com}. 
. ***生成交叉项
. g lnyield = ln(yield)
{txt}
{com}. g lnland = ln(land)
{txt}
{com}. g lnlabor = ln(labor)
{txt}
{com}. g lnflabor = ln(flabor)
{txt}
{com}. g lnelabor = ln(elabor)
{txt}
{com}. g lnfertile = ln(fertile)
{txt}
{com}. g lnmachane = ln(machane)
{txt}
{com}. g lnot = ln(ot)
{txt}
{com}. g lnsubsidy = ln(subsidy)
{txt}
{com}. g lninsurance = ln(insurance)
{txt}(7,462 missing values generated)

{com}. g lnland2 = lnland^2
{txt}
{com}. g lnlabor2 = lnlabor^2
{txt}
{com}. g lnflabor2 = lnflabor^2
{txt}
{com}. g lnelabor2 = lnelabor^2
{txt}
{com}. g lnfertile2 = lnfertile^2
{txt}
{com}. g lnmachane2 = lnmachane^2
{txt}
{com}. g lnot2 = lnot^2
{txt}
{com}. g lnlaborlnfertile = lnlabor*lnfertile
{txt}
{com}. g lnlaborlnmachane = lnlabor*lnmachane
{txt}
{com}. g lnlaborlnot = lnlabor*lnot
{txt}
{com}. g lnflaborlnelabor = lnflabor*lnelabor
{txt}
{com}. g lnflaborlnfertile = lnflabor*lnfertile
{txt}
{com}. g lnflaborlnmachane = lnflabor*lnmachane
{txt}
{com}. g lnflaborlnot = lnflabor*lnot
{txt}
{com}. g lnelaborlnfertile = lnelabor*lnfertile
{txt}
{com}. g lnelaborlnmachane = lnelabor*lnmachane
{txt}
{com}. g lnelaborlnot = lnelabor*lnot
{txt}
{com}. g lnfertilelnmachane = lnfertile*lnmachane
{txt}
{com}. g lnfertilelnot = lnfertile*lnot
{txt}
{com}. g lnmachanelnot = lnmachane*lnot
{txt}
{com}. 
. **简单的相关性检验
. //reg lnprofit lnland
. pwcorr lnyield lnland,sig

             {txt}{c |}  lnyield   lnland
{hline 13}{c +}{hline 18}
     lnyield {c |} {res}  1.0000 
             {txt}{c |}
             {c |}
      lnland {c |} {res}  0.1362   1.0000 
             {txt}{c |}{res}   0.0000
             {txt}{c |}

{com}. //pwcorr lnprofit lnland,sig
. qui reg lnyield lnland land lnlabor lnfertile lnmachane lnot lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy
{txt}
{com}. estat vif

{txt}    Variable {c |}       VIF       1/VIF  
{hline 13}{c +}{hline 22}
{space 8}lnot {c |} {res}   694.48    0.001440
{txt}{space 7}lnot2 {c |} {res}   653.31    0.001531
{txt}lnfertilel~t {c |} {res}   585.76    0.001707
{txt}{space 2}lnfertile2 {c |} {res}   545.74    0.001832
{txt}{space 3}lnfertile {c |} {res}   483.34    0.002069
{txt}lnlaborlnf~e {c |} {res}   403.60    0.002478
{txt}{space 3}lnmachane {c |} {res}   364.50    0.002744
{txt}lnfertilel~e {c |} {res}   348.90    0.002866
{txt}{space 5}lnlabor {c |} {res}   345.78    0.002892
{txt}{space 1}lnlaborlnot {c |} {res}   190.39    0.005252
{txt}lnmachanel~t {c |} {res}   105.35    0.009492
{txt}{space 4}lnlabor2 {c |} {res}    19.39    0.051560
{txt}lnlaborlnm~e {c |} {res}    15.04    0.066495
{txt}{space 6}lnland {c |} {res}     3.91    0.255762
{txt}{space 8}land {c |} {res}     3.54    0.282824
{txt}{space 2}lnmachane2 {c |} {res}     1.61    0.621163
{txt}{space 7}plots {c |} {res}     1.59    0.629084
{txt}{space 6}health {c |} {res}     1.42    0.705451
{txt}{space 9}age {c |} {res}     1.33    0.751401
{txt}{space 9}sex {c |} {res}     1.29    0.774972
{txt}{space 9}job {c |} {res}     1.24    0.804925
{txt}{space 8}loan {c |} {res}     1.22    0.822877
{txt}{space 8}educ {c |} {res}     1.20    0.829937
{txt}{space 3}lnsubsidy {c |} {res}     1.10    0.905226
{txt}{space 7}train {c |} {res}     1.10    0.912906
{txt}{space 2}insurances {c |} {res}     1.07    0.936615
{txt}{space 6}status {c |} {res}     1.03    0.969751
{txt}{space 5}fstruct {c |} {res}     1.02    0.980105
{txt}{hline 13}{c +}{hline 22}
    Mean VIF {c |} {res}   170.69
{txt}
{com}. qui reg lnyield lnland land lnlabor lnfertile lnmachane lnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy
{txt}
{com}. estat vif

{txt}    Variable {c |}       VIF       1/VIF  
{hline 13}{c +}{hline 22}
{space 6}lnland {c |} {res}     3.83    0.260907
{txt}{space 8}land {c |} {res}     3.51    0.285057
{txt}{space 7}plots {c |} {res}     1.56    0.639792
{txt}{space 6}health {c |} {res}     1.40    0.714011
{txt}{space 9}age {c |} {res}     1.32    0.755202
{txt}{space 8}lnot {c |} {res}     1.32    0.758244
{txt}{space 9}sex {c |} {res}     1.27    0.788135
{txt}{space 5}lnlabor {c |} {res}     1.27    0.788197
{txt}{space 9}job {c |} {res}     1.22    0.821099
{txt}{space 8}educ {c |} {res}     1.20    0.832001
{txt}{space 3}lnfertile {c |} {res}     1.19    0.837649
{txt}{space 3}lnmachane {c |} {res}     1.13    0.881241
{txt}{space 7}train {c |} {res}     1.08    0.923839
{txt}{space 8}loan {c |} {res}     1.08    0.927484
{txt}{space 3}lnsubsidy {c |} {res}     1.06    0.943852
{txt}{space 2}insurances {c |} {res}     1.05    0.948142
{txt}{space 6}status {c |} {res}     1.03    0.972587
{txt}{space 5}fstruct {c |} {res}     1.02    0.985156
{txt}{hline 13}{c +}{hline 22}
    Mean VIF {c |} {res}     1.48
{txt}
{com}. pwcorr lnlabor lnfertile lnmachane lnot lnfertile2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot

             {txt}{c |}  lnlabor lnfer~le lnmach~e     lnot lnfert~2    lnot2 lnlab~le
{hline 13}{c +}{hline 63}
     lnlabor {c |} {res}  1.0000 
   {txt}lnfertile {c |} {res}  0.1566   1.0000 
   {txt}lnmachane {c |} {res}  0.0005   0.1167   1.0000 
        {txt}lnot {c |} {res}  0.2380   0.3375   0.1863   1.0000 
  {txt}lnfertile2 {c |} {res}  0.1607   0.9988   0.1171   0.3335   1.0000 
       {txt}lnot2 {c |} {res}  0.2390   0.3344   0.1819   0.9990   0.3308   1.0000 
{txt}lnlaborlnf~e {c |} {res}  0.9821   0.3305   0.0223   0.2860   0.3348   0.2865   1.0000 
{txt}lnlaborlnm~e {c |} {res}  0.5634   0.1797   0.7831   0.2836   0.1827   0.2804   0.5720 
 {txt}lnlaborlnot {c |} {res}  0.9648   0.2271   0.0528   0.4710   0.2301   0.4725   0.9627 
{txt}lnfertilel~e {c |} {res}  0.0246   0.2576   0.9881   0.2288   0.2585   0.2243   0.0709 
{txt}lnfertilel~t {c |} {res}  0.2500   0.7189   0.1920   0.8953   0.7163   0.8938   0.3679 
{txt}lnmachanel~t {c |} {res}  0.0588   0.1871   0.9703   0.3959   0.1866   0.3922   0.0901 

             {txt}{c |} lnlab~ne lnlabo~t lnfer~ne lnfert~t lnmach~t
{hline 13}{c +}{hline 45}
lnlaborlnm~e {c |} {res}  1.0000 
 {txt}lnlaborlnot {c |} {res}  0.5879   1.0000 
{txt}lnfertilel~e {c |} {res}  0.7882   0.0851   1.0000 
{txt}lnfertilel~t {c |} {res}  0.2942   0.4552   0.2900   1.0000 
{txt}lnmachanel~t {c |} {res}  0.7941   0.1581   0.9703   0.3800   1.0000 
{txt}
{com}. 
. xtreg lnlabor lnland lnland2,fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     9,275
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     2,794

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0499{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.1469{col 63}{txt}avg{col 67}={col 69}{res}       3.3
{txt}     overall = {res}0.1212{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}2793{txt}){col 67}={col 70}{res}    93.67
{txt}corr(u_i, Xb){col 16}= {res}0.0580{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:2,794} clusters in id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     lnlabor{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}lnland {c |}{col 14}{res}{space 2}-.2432863{col 26}{space 2} .0281683{col 37}{space 1}   -8.64{col 46}{space 3}0.000{col 54}{space 4}-.2985191{col 67}{space 3}-.1880534
{txt}{space 5}lnland2 {c |}{col 14}{res}{space 2}  -.00744{col 26}{space 2}  .010662{col 37}{space 1}   -0.70{col 46}{space 3}0.485{col 54}{space 4}-.0283463{col 67}{space 3} .0134662
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.414999{col 26}{space 2} .0227693{col 37}{space 1}  106.06{col 46}{space 3}0.000{col 54}{space 4} 2.370353{col 67}{space 3} 2.459646
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .62311841
     {txt}sigma_e {c |} {res} .31172759
         {txt}rho {c |} {res} .79982705{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. xtreg lnflabor lnland lnland2,fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     9,275
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     2,794

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0427{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.1457{col 63}{txt}avg{col 67}={col 69}{res}       3.3
{txt}     overall = {res}0.1175{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}2793{txt}){col 67}={col 70}{res}    94.80
{txt}corr(u_i, Xb){col 16}= {res}0.0555{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:2,794} clusters in id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    lnflabor{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}lnland {c |}{col 14}{res}{space 2}-.2465762{col 26}{space 2} .0283211{col 37}{space 1}   -8.71{col 46}{space 3}0.000{col 54}{space 4}-.3021085{col 67}{space 3}-.1910438
{txt}{space 5}lnland2 {c |}{col 14}{res}{space 2}-.0070789{col 26}{space 2} .0107272{col 37}{space 1}   -0.66{col 46}{space 3}0.509{col 54}{space 4}-.0281129{col 67}{space 3} .0139551
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.415185{col 26}{space 2} .0228599{col 37}{space 1}  105.65{col 46}{space 3}0.000{col 54}{space 4} 2.370361{col 67}{space 3} 2.460009
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .62768644
     {txt}sigma_e {c |} {res} .34193059
         {txt}rho {c |} {res} .77115879{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. xtreg lnelabor lnland lnland2,fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     9,275
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     2,794

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0025{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.0201{col 63}{txt}avg{col 67}={col 69}{res}       3.3
{txt}     overall = {res}0.0259{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}2793{txt}){col 67}={col 70}{res}     3.39
{txt}corr(u_i, Xb){col 16}= {res}0.0708{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0338

{txt}{ralign 78:(Std. Err. adjusted for {res:2,794} clusters in id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}    lnelabor{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}lnland {c |}{col 14}{res}{space 2} .0058254{col 26}{space 2} .0235421{col 37}{space 1}    0.25{col 46}{space 3}0.805{col 54}{space 4}-.0403362{col 67}{space 3}  .051987
{txt}{space 5}lnland2 {c |}{col 14}{res}{space 2} .0311342{col 26}{space 2} .0192556{col 37}{space 1}    1.62{col 46}{space 3}0.106{col 54}{space 4}-.0066224{col 67}{space 3} .0688908
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-6.918666{col 26}{space 2} .0280098{col 37}{space 1} -247.01{col 46}{space 3}0.000{col 54}{space 4}-6.973588{col 67}{space 3}-6.863744
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .53669884
     {txt}sigma_e {c |} {res} .46210788
         {txt}rho {c |} {res} .57426588{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. xtreg lnfertile lnland lnland2,fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     9,275
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     2,794

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0162{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.0047{col 63}{txt}avg{col 67}={col 69}{res}       3.3
{txt}     overall = {res}0.0071{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}2793{txt}){col 67}={col 70}{res}    29.95
{txt}corr(u_i, Xb){col 16}= {res}-0.1587{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:2,794} clusters in id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   lnfertile{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}lnland {c |}{col 14}{res}{space 2}-.1106189{col 26}{space 2} .0186932{col 37}{space 1}   -5.92{col 46}{space 3}0.000{col 54}{space 4}-.1472728{col 67}{space 3} -.073965
{txt}{space 5}lnland2 {c |}{col 14}{res}{space 2} .0114635{col 26}{space 2} .0067597{col 37}{space 1}    1.70{col 46}{space 3}0.090{col 54}{space 4}-.0017911{col 67}{space 3}  .024718
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 5.225654{col 26}{space 2} .0140339{col 37}{space 1}  372.36{col 46}{space 3}0.000{col 54}{space 4} 5.198136{col 67}{space 3} 5.253172
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .29436281
     {txt}sigma_e {c |} {res} .19552097
         {txt}rho {c |} {res}  .6938734{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. xtreg lnmachane lnland lnland2,fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     9,275
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     2,794

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0103{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.1053{col 63}{txt}avg{col 67}={col 69}{res}       3.3
{txt}     overall = {res}0.0681{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}2793{txt}){col 67}={col 70}{res}     4.15
{txt}corr(u_i, Xb){col 16}= {res}0.1659{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0159

{txt}{ralign 78:(Std. Err. adjusted for {res:2,794} clusters in id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}   lnmachane{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}lnland {c |}{col 14}{res}{space 2} .6252064{col 26}{space 2}  .221078{col 37}{space 1}    2.83{col 46}{space 3}0.005{col 54}{space 4} .1917137{col 67}{space 3} 1.058699
{txt}{space 5}lnland2 {c |}{col 14}{res}{space 2}-.2061144{col 26}{space 2} .0717008{col 37}{space 1}   -2.87{col 46}{space 3}0.004{col 54}{space 4}-.3467063{col 67}{space 3}-.0655226
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 4.182043{col 26}{space 2}  .125484{col 37}{space 1}   33.33{col 46}{space 3}0.000{col 54}{space 4} 3.935992{col 67}{space 3} 4.428094
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} 1.8167265
     {txt}sigma_e {c |} {res} 1.1056836
         {txt}rho {c |} {res} .72970867{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. xtreg lnot lnland lnland2,fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     9,275
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     2,794

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.0166{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.0118{col 63}{txt}avg{col 67}={col 69}{res}       3.3
{txt}     overall = {res}0.0040{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}2{txt},{res}2793{txt}){col 67}={col 70}{res}    32.58
{txt}corr(u_i, Xb){col 16}= {res}-0.2456{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 78:(Std. Err. adjusted for {res:2,794} clusters in id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}        lnot{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}lnland {c |}{col 14}{res}{space 2}-.1287667{col 26}{space 2} .0192464{col 37}{space 1}   -6.69{col 46}{space 3}0.000{col 54}{space 4}-.1665052{col 67}{space 3}-.0910281
{txt}{space 5}lnland2 {c |}{col 14}{res}{space 2} .0174783{col 26}{space 2} .0070763{col 37}{space 1}    2.47{col 46}{space 3}0.014{col 54}{space 4} .0036031{col 67}{space 3} .0313536
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 4.784211{col 26}{space 2} .0146243{col 37}{space 1}  327.14{col 46}{space 3}0.000{col 54}{space 4} 4.755536{col 67}{space 3} 4.812886
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .43697549
     {txt}sigma_e {c |} {res} .21207621
         {txt}rho {c |} {res}  .8093609{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. 
. **混合回归、固定效应回归or随机效应回归？
. qui xtreg lnyield lnland land lnlabor lnfertile lnmachane lnot lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy, re r
{txt}
{com}. xtoverid

{txt}Test of overidentifying restrictions: fixed vs random effects
Cross-section time-series model: xtreg re  robust cluster(id)
Sargan-Hansen statistic{res}{col 25}964.560{txt}  Chi-sq({res}28{txt}){col 47}P-value = {res}0.0000
{txt}
{com}. reg lnyield lnland land lnlabor lnfertile lnmachane lnot lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy i.sm i.year, vce(cluster id)

{txt}Linear regression                               Number of obs     = {res}     9,275
                                                {txt}F(37, 2793)       =  {res}    96.39
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.4149
                                                {txt}Root MSE          =    {res} .18425

{txt}{ralign 84:(Std. Err. adjusted for {res:2,794} clusters in id)}
{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}           lnyield{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}lnland {c |}{col 20}{res}{space 2} .0642327{col 32}{space 2} .0068755{col 43}{space 1}    9.34{col 52}{space 3}0.000{col 60}{space 4} .0507511{col 73}{space 3} .0777144
{txt}{space 14}land {c |}{col 20}{res}{space 2} -.007138{col 32}{space 2} .0011193{col 43}{space 1}   -6.38{col 52}{space 3}0.000{col 60}{space 4}-.0093328{col 73}{space 3}-.0049432
{txt}{space 11}lnlabor {c |}{col 20}{res}{space 2} .0069113{col 32}{space 2} .0837718{col 43}{space 1}    0.08{col 52}{space 3}0.934{col 60}{space 4}-.1573495{col 73}{space 3} .1711721
{txt}{space 9}lnfertile {c |}{col 20}{res}{space 2}  1.66377{col 32}{space 2} .2062815{col 43}{space 1}    8.07{col 52}{space 3}0.000{col 60}{space 4}  1.25929{col 73}{space 3} 2.068249
{txt}{space 9}lnmachane {c |}{col 20}{res}{space 2}-.0023862{col 32}{space 2} .0428478{col 43}{space 1}   -0.06{col 52}{space 3}0.956{col 60}{space 4}-.0864027{col 73}{space 3} .0816303
{txt}{space 14}lnot {c |}{col 20}{res}{space 2} 1.823755{col 32}{space 2}  .173928{col 43}{space 1}   10.49{col 52}{space 3}0.000{col 60}{space 4} 1.482715{col 73}{space 3} 2.164796
{txt}{space 10}lnlabor2 {c |}{col 20}{res}{space 2} .0274472{col 32}{space 2} .0043409{col 43}{space 1}    6.32{col 52}{space 3}0.000{col 60}{space 4} .0189355{col 73}{space 3} .0359588
{txt}{space 8}lnfertile2 {c |}{col 20}{res}{space 2}-.0652105{col 32}{space 2} .0209084{col 43}{space 1}   -3.12{col 52}{space 3}0.002{col 60}{space 4}-.1062079{col 73}{space 3} -.024213
{txt}{space 8}lnmachane2 {c |}{col 20}{res}{space 2} .0043963{col 32}{space 2} .0006641{col 43}{space 1}    6.62{col 52}{space 3}0.000{col 60}{space 4}  .003094{col 73}{space 3} .0056985
{txt}{space 13}lnot2 {c |}{col 20}{res}{space 2}-.1007469{col 32}{space 2} .0178047{col 43}{space 1}   -5.66{col 52}{space 3}0.000{col 60}{space 4}-.1356587{col 73}{space 3}-.0658352
{txt}{space 2}lnlaborlnfertile {c |}{col 20}{res}{space 2}-.0665273{col 32}{space 2} .0157029{col 43}{space 1}   -4.24{col 52}{space 3}0.000{col 60}{space 4}-.0973177{col 73}{space 3}-.0357369
{txt}{space 2}lnlaborlnmachane {c |}{col 20}{res}{space 2} .0151393{col 32}{space 2} .0024549{col 43}{space 1}    6.17{col 52}{space 3}0.000{col 60}{space 4} .0103256{col 73}{space 3} .0199529
{txt}{space 7}lnlaborlnot {c |}{col 20}{res}{space 2} .0290531{col 32}{space 2} .0109182{col 43}{space 1}    2.66{col 52}{space 3}0.008{col 60}{space 4} .0076447{col 73}{space 3} .0504616
{txt}lnfertilelnmachane {c |}{col 20}{res}{space 2}-.0060967{col 32}{space 2} .0075963{col 43}{space 1}   -0.80{col 52}{space 3}0.422{col 60}{space 4}-.0209915{col 73}{space 3} .0087982
{txt}{space 5}lnfertilelnot {c |}{col 20}{res}{space 2}-.1499159{col 32}{space 2} .0213185{col 43}{space 1}   -7.03{col 52}{space 3}0.000{col 60}{space 4}-.1917175{col 73}{space 3}-.1081144
{txt}{space 5}lnmachanelnot {c |}{col 20}{res}{space 2} .0026782{col 32}{space 2} .0039454{col 43}{space 1}    0.68{col 52}{space 3}0.497{col 60}{space 4} -.005058{col 73}{space 3} .0104143
{txt}{space 15}sex {c |}{col 20}{res}{space 2}-.0127066{col 32}{space 2} .0087425{col 43}{space 1}   -1.45{col 52}{space 3}0.146{col 60}{space 4} -.029849{col 73}{space 3} .0044357
{txt}{space 15}age {c |}{col 20}{res}{space 2} .0003436{col 32}{space 2} .0003308{col 43}{space 1}    1.04{col 52}{space 3}0.299{col 60}{space 4}-.0003051{col 73}{space 3} .0009923
{txt}{space 14}educ {c |}{col 20}{res}{space 2} .0007239{col 32}{space 2}  .001293{col 43}{space 1}    0.56{col 52}{space 3}0.576{col 60}{space 4}-.0018115{col 73}{space 3} .0032593
{txt}{space 13}train {c |}{col 20}{res}{space 2} .0072656{col 32}{space 2} .0135874{col 43}{space 1}    0.53{col 52}{space 3}0.593{col 60}{space 4}-.0193768{col 73}{space 3}  .033908
{txt}{space 12}health {c |}{col 20}{res}{space 2}-.0011823{col 32}{space 2} .0043499{col 43}{space 1}   -0.27{col 52}{space 3}0.786{col 60}{space 4}-.0097116{col 73}{space 3} .0073471
{txt}{space 12}status {c |}{col 20}{res}{space 2} .0093721{col 32}{space 2} .0060124{col 43}{space 1}    1.56{col 52}{space 3}0.119{col 60}{space 4}-.0024171{col 73}{space 3} .0211613
{txt}{space 11}fstruct {c |}{col 20}{res}{space 2}-.0251646{col 32}{space 2}  .005693{col 43}{space 1}   -4.42{col 52}{space 3}0.000{col 60}{space 4}-.0363275{col 73}{space 3}-.0140017
{txt}{space 13}plots {c |}{col 20}{res}{space 2} .0112381{col 32}{space 2} .0024682{col 43}{space 1}    4.55{col 52}{space 3}0.000{col 60}{space 4} .0063985{col 73}{space 3} .0160778
{txt}{space 8}insurances {c |}{col 20}{res}{space 2}-.0014712{col 32}{space 2} .0061173{col 43}{space 1}   -0.24{col 52}{space 3}0.810{col 60}{space 4}-.0134661{col 73}{space 3} .0105237
{txt}{space 14}loan {c |}{col 20}{res}{space 2}-.0493377{col 32}{space 2} .0092934{col 43}{space 1}   -5.31{col 52}{space 3}0.000{col 60}{space 4}-.0675604{col 73}{space 3} -.031115
{txt}{space 15}job {c |}{col 20}{res}{space 2} .0040196{col 32}{space 2} .0128216{col 43}{space 1}    0.31{col 52}{space 3}0.754{col 60}{space 4}-.0211212{col 73}{space 3} .0291605
{txt}{space 9}lnsubsidy {c |}{col 20}{res}{space 2}-.0046137{col 32}{space 2} .0011603{col 43}{space 1}   -3.98{col 52}{space 3}0.000{col 60}{space 4}-.0068889{col 73}{space 3}-.0023386
{txt}{space 18} {c |}
{space 16}sm {c |}
{space 15}13  {c |}{col 20}{res}{space 2}-.0430966{col 32}{space 2} .0161437{col 43}{space 1}   -2.67{col 52}{space 3}0.008{col 60}{space 4}-.0747514{col 73}{space 3}-.0114419
{txt}{space 15}32  {c |}{col 20}{res}{space 2}-.0505606{col 32}{space 2} .0143172{col 43}{space 1}   -3.53{col 52}{space 3}0.000{col 60}{space 4} -.078634{col 73}{space 3}-.0224873
{txt}{space 15}34  {c |}{col 20}{res}{space 2}-.0583774{col 32}{space 2} .0147788{col 43}{space 1}   -3.95{col 52}{space 3}0.000{col 60}{space 4}-.0873559{col 73}{space 3}-.0293989
{txt}{space 15}37  {c |}{col 20}{res}{space 2} .0764823{col 32}{space 2} .0146716{col 43}{space 1}    5.21{col 52}{space 3}0.000{col 60}{space 4} .0477139{col 73}{space 3} .1052507
{txt}{space 15}41  {c |}{col 20}{res}{space 2} .0383302{col 32}{space 2} .0149208{col 43}{space 1}    2.57{col 52}{space 3}0.010{col 60}{space 4} .0090734{col 73}{space 3}  .067587
{txt}{space 18} {c |}
{space 14}year {c |}
{space 13}2012  {c |}{col 20}{res}{space 2} -.065395{col 32}{space 2} .0052475{col 43}{space 1}  -12.46{col 52}{space 3}0.000{col 60}{space 4}-.0756844{col 73}{space 3}-.0551056
{txt}{space 13}2013  {c |}{col 20}{res}{space 2}-.0727659{col 32}{space 2} .0098736{col 43}{space 1}   -7.37{col 52}{space 3}0.000{col 60}{space 4}-.0921262{col 73}{space 3}-.0534057
{txt}{space 13}2014  {c |}{col 20}{res}{space 2}-.0004415{col 32}{space 2} .0061001{col 43}{space 1}   -0.07{col 52}{space 3}0.942{col 60}{space 4}-.0124026{col 73}{space 3} .0115196
{txt}{space 13}2015  {c |}{col 20}{res}{space 2}-.0217502{col 32}{space 2} .0097953{col 43}{space 1}   -2.22{col 52}{space 3}0.026{col 60}{space 4} -.040957{col 73}{space 3}-.0025434
{txt}{space 18} {c |}
{space 13}_cons {c |}{col 20}{res}{space 2}-3.328072{col 32}{space 2}  .653614{col 43}{space 1}   -5.09{col 52}{space 3}0.000{col 60}{space 4}-4.609688{col 73}{space 3}-2.046457
{txt}{hline 19}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. xtreg lnyield lnland land lnlabor lnfertile lnmachane lnot lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy i.year, re r
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}     9,275
{txt}Group variable: {res}id                              {txt}Number of groups  = {res}     2,794

{txt}R-sq:                                           Obs per group:
     within  = {res}0.0825                                         {txt}min = {res}         1
{txt}     between = {res}0.4522                                         {txt}avg = {res}       3.3
{txt}     overall = {res}0.3496                                         {txt}max = {res}         5

                                                {txt}Wald chi2({res}32{txt})     =  {res}  1655.95
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2       =     {res}0.0000

{txt}{ralign 84:(Std. Err. adjusted for {res:2,794} clusters in id)}
{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}           lnyield{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      z{col 52}   P>|z|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}lnland {c |}{col 20}{res}{space 2} .0224151{col 32}{space 2}  .007581{col 43}{space 1}    2.96{col 52}{space 3}0.003{col 60}{space 4} .0075567{col 73}{space 3} .0372735
{txt}{space 14}land {c |}{col 20}{res}{space 2}-.0050025{col 32}{space 2} .0014251{col 43}{space 1}   -3.51{col 52}{space 3}0.000{col 60}{space 4}-.0077956{col 73}{space 3}-.0022093
{txt}{space 11}lnlabor {c |}{col 20}{res}{space 2} .0021606{col 32}{space 2} .0668173{col 43}{space 1}    0.03{col 52}{space 3}0.974{col 60}{space 4}-.1287988{col 73}{space 3} .1331201
{txt}{space 9}lnfertile {c |}{col 20}{res}{space 2} .8968394{col 32}{space 2} .1616062{col 43}{space 1}    5.55{col 52}{space 3}0.000{col 60}{space 4}  .580097{col 73}{space 3} 1.213582
{txt}{space 9}lnmachane {c |}{col 20}{res}{space 2} .0430741{col 32}{space 2} .0315383{col 43}{space 1}    1.37{col 52}{space 3}0.172{col 60}{space 4}-.0187398{col 73}{space 3} .1048879
{txt}{space 14}lnot {c |}{col 20}{res}{space 2} .9703504{col 32}{space 2} .1395606{col 43}{space 1}    6.95{col 52}{space 3}0.000{col 60}{space 4} .6968166{col 73}{space 3} 1.243884
{txt}{space 10}lnlabor2 {c |}{col 20}{res}{space 2} .0056639{col 32}{space 2} .0035406{col 43}{space 1}    1.60{col 52}{space 3}0.110{col 60}{space 4}-.0012756{col 73}{space 3} .0126034
{txt}{space 8}lnfertile2 {c |}{col 20}{res}{space 2}-.0330888{col 32}{space 2} .0157974{col 43}{space 1}   -2.09{col 52}{space 3}0.036{col 60}{space 4}-.0640511{col 73}{space 3}-.0021264
{txt}{space 8}lnmachane2 {c |}{col 20}{res}{space 2} .0037374{col 32}{space 2} .0005462{col 43}{space 1}    6.84{col 52}{space 3}0.000{col 60}{space 4} .0026669{col 73}{space 3} .0048079
{txt}{space 13}lnot2 {c |}{col 20}{res}{space 2}-.0472264{col 32}{space 2} .0127935{col 43}{space 1}   -3.69{col 52}{space 3}0.000{col 60}{space 4}-.0723011{col 73}{space 3}-.0221517
{txt}{space 2}lnlaborlnfertile {c |}{col 20}{res}{space 2}-.0071763{col 32}{space 2} .0123795{col 43}{space 1}   -0.58{col 52}{space 3}0.562{col 60}{space 4}-.0314397{col 73}{space 3}  .017087
{txt}{space 2}lnlaborlnmachane {c |}{col 20}{res}{space 2} .0044782{col 32}{space 2} .0019308{col 43}{space 1}    2.32{col 52}{space 3}0.020{col 60}{space 4}  .000694{col 73}{space 3} .0082624
{txt}{space 7}lnlaborlnot {c |}{col 20}{res}{space 2}-.0029536{col 32}{space 2} .0082705{col 43}{space 1}   -0.36{col 52}{space 3}0.721{col 60}{space 4}-.0191635{col 73}{space 3} .0132564
{txt}lnfertilelnmachane {c |}{col 20}{res}{space 2}-.0116206{col 32}{space 2} .0054343{col 43}{space 1}   -2.14{col 52}{space 3}0.032{col 60}{space 4}-.0222716{col 73}{space 3}-.0009696
{txt}{space 5}lnfertilelnot {c |}{col 20}{res}{space 2}-.0842785{col 32}{space 2} .0163766{col 43}{space 1}   -5.15{col 52}{space 3}0.000{col 60}{space 4}-.1163761{col 73}{space 3}-.0521809
{txt}{space 5}lnmachanelnot {c |}{col 20}{res}{space 2} .0034362{col 32}{space 2}  .002704{col 43}{space 1}    1.27{col 52}{space 3}0.204{col 60}{space 4}-.0018636{col 73}{space 3}  .008736
{txt}{space 15}sex {c |}{col 20}{res}{space 2}-.0038165{col 32}{space 2} .0068033{col 43}{space 1}   -0.56{col 52}{space 3}0.575{col 60}{space 4}-.0171507{col 73}{space 3} .0095177
{txt}{space 15}age {c |}{col 20}{res}{space 2} .0000853{col 32}{space 2} .0002417{col 43}{space 1}    0.35{col 52}{space 3}0.724{col 60}{space 4}-.0003884{col 73}{space 3} .0005589
{txt}{space 14}educ {c |}{col 20}{res}{space 2} .0003168{col 32}{space 2} .0009755{col 43}{space 1}    0.32{col 52}{space 3}0.745{col 60}{space 4}-.0015952{col 73}{space 3} .0022288
{txt}{space 13}train {c |}{col 20}{res}{space 2} .0011609{col 32}{space 2} .0092694{col 43}{space 1}    0.13{col 52}{space 3}0.900{col 60}{space 4}-.0170067{col 73}{space 3} .0193286
{txt}{space 12}health {c |}{col 20}{res}{space 2} .0006009{col 32}{space 2} .0033855{col 43}{space 1}    0.18{col 52}{space 3}0.859{col 60}{space 4}-.0060345{col 73}{space 3} .0072363
{txt}{space 12}status {c |}{col 20}{res}{space 2} .0101357{col 32}{space 2} .0049234{col 43}{space 1}    2.06{col 52}{space 3}0.040{col 60}{space 4}  .000486{col 73}{space 3} .0197854
{txt}{space 11}fstruct {c |}{col 20}{res}{space 2}-.0103042{col 32}{space 2} .0039887{col 43}{space 1}   -2.58{col 52}{space 3}0.010{col 60}{space 4} -.018122{col 73}{space 3}-.0024865
{txt}{space 13}plots {c |}{col 20}{res}{space 2} .0162433{col 32}{space 2} .0026041{col 43}{space 1}    6.24{col 52}{space 3}0.000{col 60}{space 4} .0111393{col 73}{space 3} .0213473
{txt}{space 8}insurances {c |}{col 20}{res}{space 2} .0006044{col 32}{space 2}  .004485{col 43}{space 1}    0.13{col 52}{space 3}0.893{col 60}{space 4}-.0081861{col 73}{space 3} .0093949
{txt}{space 14}loan {c |}{col 20}{res}{space 2}-.0126688{col 32}{space 2} .0077773{col 43}{space 1}   -1.63{col 52}{space 3}0.103{col 60}{space 4}-.0279119{col 73}{space 3} .0025744
{txt}{space 15}job {c |}{col 20}{res}{space 2}-.0058794{col 32}{space 2} .0106796{col 43}{space 1}   -0.55{col 52}{space 3}0.582{col 60}{space 4} -.026811{col 73}{space 3} .0150522
{txt}{space 9}lnsubsidy {c |}{col 20}{res}{space 2}-.0009984{col 32}{space 2} .0008417{col 43}{space 1}   -1.19{col 52}{space 3}0.236{col 60}{space 4}-.0026482{col 73}{space 3} .0006513
{txt}{space 18} {c |}
{space 14}year {c |}
{space 13}2012  {c |}{col 20}{res}{space 2}-.0576167{col 32}{space 2} .0044612{col 43}{space 1}  -12.92{col 52}{space 3}0.000{col 60}{space 4}-.0663604{col 73}{space 3}-.0488729
{txt}{space 13}2013  {c |}{col 20}{res}{space 2}-.0511441{col 32}{space 2} .0078406{col 43}{space 1}   -6.52{col 52}{space 3}0.000{col 60}{space 4}-.0665115{col 73}{space 3}-.0357767
{txt}{space 13}2014  {c |}{col 20}{res}{space 2} .0204565{col 32}{space 2} .0049623{col 43}{space 1}    4.12{col 52}{space 3}0.000{col 60}{space 4} .0107306{col 73}{space 3} .0301824
{txt}{space 13}2015  {c |}{col 20}{res}{space 2} .0074829{col 32}{space 2} .0077317{col 43}{space 1}    0.97{col 52}{space 3}0.333{col 60}{space 4} -.007671{col 73}{space 3} .0226368
{txt}{space 18} {c |}
{space 13}_cons {c |}{col 20}{res}{space 2} .7656687{col 32}{space 2}  .545558{col 43}{space 1}    1.40{col 52}{space 3}0.160{col 60}{space 4}-.3036053{col 73}{space 3} 1.834943
{txt}{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
           sigma_u {c |} {res} .15710879
           {txt}sigma_e {c |} {res} .11339803
               {txt}rho {c |} {res} .65747653{txt}   (fraction of variance due to u_i)
{hline 19}{c BT}{hline 64}

{com}. xtreg lnyield lnland land lnlabor lnfertile lnmachane lnot lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy i.year, fe r
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     9,275
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     2,794

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.1215{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.1018{col 63}{txt}avg{col 67}={col 69}{res}       3.3
{txt}     overall = {res}0.0780{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}32{txt},{res}2793{txt}){col 67}={col 70}{res}    26.24
{txt}corr(u_i, Xb){col 16}= {res}0.0825{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 84:(Std. Err. adjusted for {res:2,794} clusters in id)}
{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}           lnyield{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}lnland {c |}{col 20}{res}{space 2}-.0341096{col 32}{space 2} .0099556{col 43}{space 1}   -3.43{col 52}{space 3}0.001{col 60}{space 4}-.0536306{col 73}{space 3}-.0145886
{txt}{space 14}land {c |}{col 20}{res}{space 2}-.0009595{col 32}{space 2} .0014742{col 43}{space 1}   -0.65{col 52}{space 3}0.515{col 60}{space 4}  -.00385{col 73}{space 3} .0019311
{txt}{space 11}lnlabor {c |}{col 20}{res}{space 2} .0631633{col 32}{space 2}  .069167{col 43}{space 1}    0.91{col 52}{space 3}0.361{col 60}{space 4}-.0724602{col 73}{space 3} .1987868
{txt}{space 9}lnfertile {c |}{col 20}{res}{space 2} .2655738{col 32}{space 2}  .157534{col 43}{space 1}    1.69{col 52}{space 3}0.092{col 60}{space 4}-.0433211{col 73}{space 3} .5744687
{txt}{space 9}lnmachane {c |}{col 20}{res}{space 2} .0675923{col 32}{space 2} .0306325{col 43}{space 1}    2.21{col 52}{space 3}0.027{col 60}{space 4} .0075276{col 73}{space 3} .1276569
{txt}{space 14}lnot {c |}{col 20}{res}{space 2} .0071274{col 32}{space 2} .1421635{col 43}{space 1}    0.05{col 52}{space 3}0.960{col 60}{space 4}-.2716289{col 73}{space 3} .2858836
{txt}{space 10}lnlabor2 {c |}{col 20}{res}{space 2}-.0056364{col 32}{space 2} .0041779{col 43}{space 1}   -1.35{col 52}{space 3}0.177{col 60}{space 4}-.0138286{col 73}{space 3} .0025557
{txt}{space 8}lnfertile2 {c |}{col 20}{res}{space 2}-.0093001{col 32}{space 2} .0151884{col 43}{space 1}   -0.61{col 52}{space 3}0.540{col 60}{space 4}-.0390818{col 73}{space 3} .0204816
{txt}{space 8}lnmachane2 {c |}{col 20}{res}{space 2} .0013927{col 32}{space 2} .0005953{col 43}{space 1}    2.34{col 52}{space 3}0.019{col 60}{space 4} .0002253{col 73}{space 3}   .00256
{txt}{space 13}lnot2 {c |}{col 20}{res}{space 2} .0158879{col 32}{space 2} .0136951{col 43}{space 1}    1.16{col 52}{space 3}0.246{col 60}{space 4}-.0109657{col 73}{space 3} .0427414
{txt}{space 2}lnlaborlnfertile {c |}{col 20}{res}{space 2} .0047957{col 32}{space 2}  .012427{col 43}{space 1}    0.39{col 52}{space 3}0.700{col 60}{space 4}-.0195713{col 73}{space 3} .0291626
{txt}{space 2}lnlaborlnmachane {c |}{col 20}{res}{space 2}-.0020599{col 32}{space 2} .0020912{col 43}{space 1}   -0.99{col 52}{space 3}0.325{col 60}{space 4}-.0061604{col 73}{space 3} .0020406
{txt}{space 7}lnlaborlnot {c |}{col 20}{res}{space 2}-.0132136{col 32}{space 2} .0089175{col 43}{space 1}   -1.48{col 52}{space 3}0.139{col 60}{space 4}-.0306992{col 73}{space 3} .0042719
{txt}lnfertilelnmachane {c |}{col 20}{res}{space 2}-.0129528{col 32}{space 2} .0051679{col 43}{space 1}   -2.51{col 52}{space 3}0.012{col 60}{space 4}-.0230862{col 73}{space 3}-.0028194
{txt}{space 5}lnfertilelnot {c |}{col 20}{res}{space 2}-.0201446{col 32}{space 2}  .016157{col 43}{space 1}   -1.25{col 52}{space 3}0.213{col 60}{space 4}-.0518255{col 73}{space 3} .0115362
{txt}{space 5}lnmachanelnot {c |}{col 20}{res}{space 2} .0012224{col 32}{space 2} .0028162{col 43}{space 1}    0.43{col 52}{space 3}0.664{col 60}{space 4}-.0042996{col 73}{space 3} .0067444
{txt}{space 15}sex {c |}{col 20}{res}{space 2}-.0093618{col 32}{space 2} .0071659{col 43}{space 1}   -1.31{col 52}{space 3}0.192{col 60}{space 4}-.0234128{col 73}{space 3} .0046892
{txt}{space 15}age {c |}{col 20}{res}{space 2} .0001607{col 32}{space 2} .0002531{col 43}{space 1}    0.63{col 52}{space 3}0.526{col 60}{space 4}-.0003356{col 73}{space 3} .0006569
{txt}{space 14}educ {c |}{col 20}{res}{space 2}  .000192{col 32}{space 2} .0010399{col 43}{space 1}    0.18{col 52}{space 3}0.854{col 60}{space 4} -.001847{col 73}{space 3}  .002231
{txt}{space 13}train {c |}{col 20}{res}{space 2}-.0046313{col 32}{space 2} .0091423{col 43}{space 1}   -0.51{col 52}{space 3}0.612{col 60}{space 4}-.0225576{col 73}{space 3} .0132951
{txt}{space 12}health {c |}{col 20}{res}{space 2}-.0038381{col 32}{space 2} .0035003{col 43}{space 1}   -1.10{col 52}{space 3}0.273{col 60}{space 4}-.0107016{col 73}{space 3} .0030254
{txt}{space 12}status {c |}{col 20}{res}{space 2} .0092239{col 32}{space 2}  .005513{col 43}{space 1}    1.67{col 52}{space 3}0.094{col 60}{space 4}-.0015862{col 73}{space 3} .0200339
{txt}{space 11}fstruct {c |}{col 20}{res}{space 2}-.0050673{col 32}{space 2} .0040585{col 43}{space 1}   -1.25{col 52}{space 3}0.212{col 60}{space 4}-.0130252{col 73}{space 3} .0028906
{txt}{space 13}plots {c |}{col 20}{res}{space 2} .0066905{col 32}{space 2} .0042186{col 43}{space 1}    1.59{col 52}{space 3}0.113{col 60}{space 4}-.0015814{col 73}{space 3} .0149623
{txt}{space 8}insurances {c |}{col 20}{res}{space 2} .0051965{col 32}{space 2} .0049338{col 43}{space 1}    1.05{col 52}{space 3}0.292{col 60}{space 4}-.0044778{col 73}{space 3} .0148708
{txt}{space 14}loan {c |}{col 20}{res}{space 2} .0045858{col 32}{space 2} .0077908{col 43}{space 1}    0.59{col 52}{space 3}0.556{col 60}{space 4}-.0106905{col 73}{space 3}  .019862
{txt}{space 15}job {c |}{col 20}{res}{space 2}-.0021369{col 32}{space 2}  .012815{col 43}{space 1}   -0.17{col 52}{space 3}0.868{col 60}{space 4}-.0272647{col 73}{space 3}  .022991
{txt}{space 9}lnsubsidy {c |}{col 20}{res}{space 2} .0007897{col 32}{space 2} .0009019{col 43}{space 1}    0.88{col 52}{space 3}0.381{col 60}{space 4}-.0009787{col 73}{space 3} .0025581
{txt}{space 18} {c |}
{space 14}year {c |}
{space 13}2012  {c |}{col 20}{res}{space 2}-.0480716{col 32}{space 2} .0043168{col 43}{space 1}  -11.14{col 52}{space 3}0.000{col 60}{space 4} -.056536{col 73}{space 3}-.0396072
{txt}{space 13}2013  {c |}{col 20}{res}{space 2}-.0416804{col 32}{space 2} .0079641{col 43}{space 1}   -5.23{col 52}{space 3}0.000{col 60}{space 4}-.0572965{col 73}{space 3}-.0260642
{txt}{space 13}2014  {c |}{col 20}{res}{space 2} .0383071{col 32}{space 2} .0049995{col 43}{space 1}    7.66{col 52}{space 3}0.000{col 60}{space 4}  .028504{col 73}{space 3} .0481102
{txt}{space 13}2015  {c |}{col 20}{res}{space 2} .0148379{col 32}{space 2}  .007996{col 43}{space 1}    1.86{col 52}{space 3}0.064{col 60}{space 4}-.0008407{col 73}{space 3} .0305166
{txt}{space 18} {c |}
{space 13}_cons {c |}{col 20}{res}{space 2} 4.980935{col 32}{space 2} .5453752{col 43}{space 1}    9.13{col 52}{space 3}0.000{col 60}{space 4} 3.911556{col 73}{space 3} 6.050315
{txt}{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
           sigma_u {c |} {res} .23380461
           {txt}sigma_e {c |} {res} .11339803
               {txt}rho {c |} {res} .80956151{txt}   (fraction of variance due to u_i)
{hline 19}{c BT}{hline 64}

{com}. 
. 
. **二次项和交叉项联合检验
. tab year, gen(y)

       {txt}year {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       2011 {c |}{res}      1,849       19.94       19.94
{txt}       2012 {c |}{res}      2,152       23.20       43.14
{txt}       2013 {c |}{res}      2,054       22.15       65.28
{txt}       2014 {c |}{res}      1,617       17.43       82.72
{txt}       2015 {c |}{res}      1,603       17.28      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      9,275      100.00
{txt}
{com}. xtreg lnyield lnland land lnlabor lnfertile lnmachane lnot lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot sex age educ train health status  fstruct plots  insurance loan job lnsubsidy y2-y5, fe vce(cluster id)
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}     9,275
{txt}Group variable: {res}id{txt}{col 49}Number of groups{col 67}={col 69}{res}     2,794

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.1215{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.1018{col 63}{txt}avg{col 67}={col 69}{res}       3.3
{txt}     overall = {res}0.0780{col 63}{txt}max{col 67}={col 69}{res}         5

{txt}{col 49}F({res}32{txt},{res}2793{txt}){col 67}={col 70}{res}    26.24
{txt}corr(u_i, Xb){col 16}= {res}0.0825{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{ralign 84:(Std. Err. adjusted for {res:2,794} clusters in id)}
{hline 19}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 20}{c |}{col 32}    Robust
{col 1}           lnyield{col 20}{c |}      Coef.{col 32}   Std. Err.{col 44}      t{col 52}   P>|t|{col 60}     [95% Con{col 73}f. Interval]
{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 12}lnland {c |}{col 20}{res}{space 2}-.0341096{col 32}{space 2} .0099556{col 43}{space 1}   -3.43{col 52}{space 3}0.001{col 60}{space 4}-.0536306{col 73}{space 3}-.0145886
{txt}{space 14}land {c |}{col 20}{res}{space 2}-.0009595{col 32}{space 2} .0014742{col 43}{space 1}   -0.65{col 52}{space 3}0.515{col 60}{space 4}  -.00385{col 73}{space 3} .0019311
{txt}{space 11}lnlabor {c |}{col 20}{res}{space 2} .0631633{col 32}{space 2}  .069167{col 43}{space 1}    0.91{col 52}{space 3}0.361{col 60}{space 4}-.0724602{col 73}{space 3} .1987868
{txt}{space 9}lnfertile {c |}{col 20}{res}{space 2} .2655738{col 32}{space 2}  .157534{col 43}{space 1}    1.69{col 52}{space 3}0.092{col 60}{space 4}-.0433211{col 73}{space 3} .5744687
{txt}{space 9}lnmachane {c |}{col 20}{res}{space 2} .0675923{col 32}{space 2} .0306325{col 43}{space 1}    2.21{col 52}{space 3}0.027{col 60}{space 4} .0075276{col 73}{space 3} .1276569
{txt}{space 14}lnot {c |}{col 20}{res}{space 2} .0071274{col 32}{space 2} .1421635{col 43}{space 1}    0.05{col 52}{space 3}0.960{col 60}{space 4}-.2716289{col 73}{space 3} .2858836
{txt}{space 10}lnlabor2 {c |}{col 20}{res}{space 2}-.0056364{col 32}{space 2} .0041779{col 43}{space 1}   -1.35{col 52}{space 3}0.177{col 60}{space 4}-.0138286{col 73}{space 3} .0025557
{txt}{space 8}lnfertile2 {c |}{col 20}{res}{space 2}-.0093001{col 32}{space 2} .0151884{col 43}{space 1}   -0.61{col 52}{space 3}0.540{col 60}{space 4}-.0390818{col 73}{space 3} .0204816
{txt}{space 8}lnmachane2 {c |}{col 20}{res}{space 2} .0013927{col 32}{space 2} .0005953{col 43}{space 1}    2.34{col 52}{space 3}0.019{col 60}{space 4} .0002253{col 73}{space 3}   .00256
{txt}{space 13}lnot2 {c |}{col 20}{res}{space 2} .0158879{col 32}{space 2} .0136951{col 43}{space 1}    1.16{col 52}{space 3}0.246{col 60}{space 4}-.0109657{col 73}{space 3} .0427414
{txt}{space 2}lnlaborlnfertile {c |}{col 20}{res}{space 2} .0047957{col 32}{space 2}  .012427{col 43}{space 1}    0.39{col 52}{space 3}0.700{col 60}{space 4}-.0195713{col 73}{space 3} .0291626
{txt}{space 2}lnlaborlnmachane {c |}{col 20}{res}{space 2}-.0020599{col 32}{space 2} .0020912{col 43}{space 1}   -0.99{col 52}{space 3}0.325{col 60}{space 4}-.0061604{col 73}{space 3} .0020406
{txt}{space 7}lnlaborlnot {c |}{col 20}{res}{space 2}-.0132136{col 32}{space 2} .0089175{col 43}{space 1}   -1.48{col 52}{space 3}0.139{col 60}{space 4}-.0306992{col 73}{space 3} .0042719
{txt}lnfertilelnmachane {c |}{col 20}{res}{space 2}-.0129528{col 32}{space 2} .0051679{col 43}{space 1}   -2.51{col 52}{space 3}0.012{col 60}{space 4}-.0230862{col 73}{space 3}-.0028194
{txt}{space 5}lnfertilelnot {c |}{col 20}{res}{space 2}-.0201446{col 32}{space 2}  .016157{col 43}{space 1}   -1.25{col 52}{space 3}0.213{col 60}{space 4}-.0518255{col 73}{space 3} .0115362
{txt}{space 5}lnmachanelnot {c |}{col 20}{res}{space 2} .0012224{col 32}{space 2} .0028162{col 43}{space 1}    0.43{col 52}{space 3}0.664{col 60}{space 4}-.0042996{col 73}{space 3} .0067444
{txt}{space 15}sex {c |}{col 20}{res}{space 2}-.0093618{col 32}{space 2} .0071659{col 43}{space 1}   -1.31{col 52}{space 3}0.192{col 60}{space 4}-.0234128{col 73}{space 3} .0046892
{txt}{space 15}age {c |}{col 20}{res}{space 2} .0001607{col 32}{space 2} .0002531{col 43}{space 1}    0.63{col 52}{space 3}0.526{col 60}{space 4}-.0003356{col 73}{space 3} .0006569
{txt}{space 14}educ {c |}{col 20}{res}{space 2}  .000192{col 32}{space 2} .0010399{col 43}{space 1}    0.18{col 52}{space 3}0.854{col 60}{space 4} -.001847{col 73}{space 3}  .002231
{txt}{space 13}train {c |}{col 20}{res}{space 2}-.0046313{col 32}{space 2} .0091423{col 43}{space 1}   -0.51{col 52}{space 3}0.612{col 60}{space 4}-.0225576{col 73}{space 3} .0132951
{txt}{space 12}health {c |}{col 20}{res}{space 2}-.0038381{col 32}{space 2} .0035003{col 43}{space 1}   -1.10{col 52}{space 3}0.273{col 60}{space 4}-.0107016{col 73}{space 3} .0030254
{txt}{space 12}status {c |}{col 20}{res}{space 2} .0092239{col 32}{space 2}  .005513{col 43}{space 1}    1.67{col 52}{space 3}0.094{col 60}{space 4}-.0015862{col 73}{space 3} .0200339
{txt}{space 11}fstruct {c |}{col 20}{res}{space 2}-.0050673{col 32}{space 2} .0040585{col 43}{space 1}   -1.25{col 52}{space 3}0.212{col 60}{space 4}-.0130252{col 73}{space 3} .0028906
{txt}{space 13}plots {c |}{col 20}{res}{space 2} .0066905{col 32}{space 2} .0042186{col 43}{space 1}    1.59{col 52}{space 3}0.113{col 60}{space 4}-.0015814{col 73}{space 3} .0149623
{txt}{space 8}insurances {c |}{col 20}{res}{space 2} .0051965{col 32}{space 2} .0049338{col 43}{space 1}    1.05{col 52}{space 3}0.292{col 60}{space 4}-.0044778{col 73}{space 3} .0148708
{txt}{space 14}loan {c |}{col 20}{res}{space 2} .0045858{col 32}{space 2} .0077908{col 43}{space 1}    0.59{col 52}{space 3}0.556{col 60}{space 4}-.0106905{col 73}{space 3}  .019862
{txt}{space 15}job {c |}{col 20}{res}{space 2}-.0021369{col 32}{space 2}  .012815{col 43}{space 1}   -0.17{col 52}{space 3}0.868{col 60}{space 4}-.0272647{col 73}{space 3}  .022991
{txt}{space 9}lnsubsidy {c |}{col 20}{res}{space 2} .0007897{col 32}{space 2} .0009019{col 43}{space 1}    0.88{col 52}{space 3}0.381{col 60}{space 4}-.0009787{col 73}{space 3} .0025581
{txt}{space 16}y2 {c |}{col 20}{res}{space 2}-.0480716{col 32}{space 2} .0043168{col 43}{space 1}  -11.14{col 52}{space 3}0.000{col 60}{space 4} -.056536{col 73}{space 3}-.0396072
{txt}{space 16}y3 {c |}{col 20}{res}{space 2}-.0416804{col 32}{space 2} .0079641{col 43}{space 1}   -5.23{col 52}{space 3}0.000{col 60}{space 4}-.0572965{col 73}{space 3}-.0260642
{txt}{space 16}y4 {c |}{col 20}{res}{space 2} .0383071{col 32}{space 2} .0049995{col 43}{space 1}    7.66{col 52}{space 3}0.000{col 60}{space 4}  .028504{col 73}{space 3} .0481102
{txt}{space 16}y5 {c |}{col 20}{res}{space 2} .0148379{col 32}{space 2}  .007996{col 43}{space 1}    1.86{col 52}{space 3}0.064{col 60}{space 4}-.0008407{col 73}{space 3} .0305166
{txt}{space 13}_cons {c |}{col 20}{res}{space 2} 4.980935{col 32}{space 2} .5453752{col 43}{space 1}    9.13{col 52}{space 3}0.000{col 60}{space 4} 3.911556{col 73}{space 3} 6.050315
{txt}{hline 19}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
           sigma_u {c |} {res} .23380461
           {txt}sigma_e {c |} {res} .11339803
               {txt}rho {c |} {res} .80956151{txt}   (fraction of variance due to u_i)
{hline 19}{c BT}{hline 64}

{com}. test lnlabor2 lnfertile2 lnmachane2 lnot2 lnlaborlnfertile lnlaborlnmachane lnlaborlnot lnfertilelnmachane lnfertilelnot lnmachanelnot

{p 0 7}{space 1}{text:( 1)}{space 1} {res}lnlabor2 = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} lnfertile2 = 0{p_end}
{p 0 7}{space 1}{text:( 3)}{space 1} lnmachane2 = 0{p_end}
{p 0 7}{space 1}{text:( 4)}{space 1} lnot2 = 0{p_end}
{p 0 7}{space 1}{text:( 5)}{space 1} lnlaborlnfertile = 0{p_end}
{p 0 7}{space 1}{text:( 6)}{space 1} lnlaborlnmachane = 0{p_end}
{p 0 7}{space 1}{text:( 7)}{space 1} lnlaborlnot = 0{p_end}
{p 0 7}{space 1}{text:( 8)}{space 1} lnfertilelnmachane = 0{p_end}
{p 0 7}{space 1}{text:( 9)}{space 1} lnfertilelnot = 0{p_end}
{p 0 7}{space 1}{text:(10)}{space 1} lnmachanelnot = 0{p_end}

{txt}       F( 10,  2793) ={res}    2.26
{txt}{col 13}Prob > F ={res}    0.0127
{txt}
{com}. test y2 y3 y4 y5

{p 0 7}{space 1}{text:( 1)}{space 1} {res}y2 = 0{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} y3 = 0{p_end}
{p 0 7}{space 1}{text:( 3)}{space 1} y4 = 0{p_end}
{p 0 7}{space 1}{text:( 4)}{space 1} y5 = 0{p_end}

{txt}       F(  4,  2793) ={res}  127.64
{txt}{col 13}Prob > F ={res}    0.0000
{txt}
{com}. 
. 
{txt}end of do-file

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. log off
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}D:\曾翠红\Stata14\新建文件夹 - 副本 (2)\新建文件夹\double小麦log.smcl
  {txt}log type:  {res}smcl
 {txt}paused on:  {res}22 Feb 2019, 15:01:32
{txt}{.-}
{smcl}
{txt}{sf}{ul off}